[[{"topic_id": 12830, "post_id": 30268, "post_number": 2, "score": 33.6, "author_username": "Pauljlei", "text": "Snapshot vote has been published below - voting begins on 4/24/2023. We thank the community for their participation.\nhttps://snapshot.org/#/aave.eth/proposal/0xc0be2141c5623d9233228b715def014050b5e224a6f8ec2c5ea67a15ba5cd8cb", "reads": 70, "readers_count": 69, "created": "2023-04-22T00:55:57.828Z"}, {"topic_id": 12830, "post_id": 30570, "post_number": 3, "score": 231.0, "author_username": "Pauljlei", "text": "The Snapshot vote has passed. We plan on putting up an on-chain vote in 4 weeks on 5/29/2023.\nReducing LT to 0 for all LP tokens will make those accounts liquidatable. As such, given the ~1 week long governance process, this would give users 5 weeks from now to make any changes to their positions. Currently, there are ~$120k of LP tokens supplied in the market.", "reads": 56, "readers_count": 55, "created": "2023-05-01T22:00:01.654Z"}, {"topic_id": 12830, "post_id": 31415, "post_number": 4, "score": 10.0, "author_username": "Gauntlet", "text": "To give users additional time, we target 6/6/2023 for an on-chain proposal.", "reads": 50, "readers_count": 49, "created": "2023-05-26T16:20:27.818Z"}, {"topic_id": 12830, "post_id": 32207, "post_number": 5, "score": 29.6, "author_username": "Gauntlet", "text": "From a technical perspective, we have discovered that there are some limitations with reducing LT to zero for this market. As a result, for now, we will only move forward with freezing the remaining assets (which have been approved by the Snapshot vote), and not reduce LT to zero. As such, our upcoming AIP will not cause any user liquidations.", "reads": 48, "readers_count": 47, "created": "2023-06-05T19:28:06.582Z"}, {"topic_id": 12830, "post_id": 32312, "post_number": 6, "score": 24.2, "author_username": "Gauntlet", "text": "AIP published:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 46, "readers_count": 45, "created": "2023-06-07T16:09:16.896Z"}, {"topic_id": 12830, "post_id": 32444, "post_number": 7, "score": 43.6, "author_username": "Jsimo01", "text": "Hi there.  I currently have quite a bit of WBTC lent out and stables borrowed on Ethereum V2 AMM.  now I have collateral frozen.  Can you advise the easiest way to transfer to V3?", "reads": 43, "readers_count": 42, "created": "2023-06-12T21:52:43.979Z"}, {"topic_id": 12830, "post_id": 32674, "post_number": 8, "score": 26.8, "author_username": "miguelmtz", "text": "Hey @Jsimo01 ,\nAlthough all reserves are frozen, you can still unwind your position on Ethereum V2 AMM. Just payback your debt and withdraw your collateral", "reads": 34, "readers_count": 33, "created": "2023-06-16T10:54:56.173Z"}, {"topic_id": 12830, "post_id": 32676, "post_number": 9, "score": 22.2, "author_username": "bgdlabs", "text": "\n\n\n Jsimo01:\n\nHi there. I currently have quite a bit of WBTC lent out and stables borrowed on Ethereum V2 AMM. now I have collateral frozen. Can you advise the easiest way to transfer to V3?\n\n\n@Jsimo01 the BGD Aave v2 → v3 migration tool has been enabled between Ethereum v2 AMM and Aave v3 Ethereum on app.aave.com, so you should be able to use it to migrate your position too.", "reads": 36, "readers_count": 35, "created": "2023-06-16T11:14:20.459Z"}, {"topic_id": 12830, "post_id": 32682, "post_number": 10, "score": 46.6, "author_username": "Jsimo01", "text": "Thank you - Yes, I moved everything to ETH V3. I should be good…cheers", "reads": 33, "readers_count": 32, "created": "2023-06-16T12:23:41.000Z"}, {"topic_id": 12830, "post_id": 41765, "post_number": 11, "score": 9.6, "author_username": "ghantav", "text": "Hi, I have a position in V2, no borrowing. How can i withdraw it now?", "reads": 23, "readers_count": 22, "created": "2024-02-26T17:09:39.032Z"}, {"topic_id": 12830, "post_id": 41766, "post_number": 12, "score": 9.2, "author_username": "sakulstra", "text": "Go to the ui, select the correct pool and withdraw (or migrate to v3, I think there’s a feature on ui for this as well)", "reads": 21, "readers_count": 20, "created": "2024-02-26T17:21:05.877Z"}, {"topic_id": 12830, "post_id": 41801, "post_number": 13, "score": 9.2, "author_username": "ghantav", "text": "On Web UI, this is not available\n\n, it shows V2 has been deprecated.", "reads": 21, "readers_count": 20, "created": "2024-02-27T16:03:57.180Z"}, {"topic_id": 12830, "post_id": 41802, "post_number": 14, "score": 8.8, "author_username": "sakulstra", "text": "The pool is deprecated, but if you login with a wallet that has funds in the pool you can withdraw/repay & migrate\nimage2992×1138 220 KB", "reads": 19, "readers_count": 18, "created": "2024-02-27T16:58:10.575Z"}, {"topic_id": 12830, "post_id": 41814, "post_number": 15, "score": 14.4, "author_username": "ghantav", "text": "It’s not visible in supply. I can see it in my wallet.\n\n  \n      \n\n      Ethereum (ETH) Blockchain Explorer\n  \n\n  \n    \n\nProxy | Address 0x89d19532ed703e9cb5d8884caf9bc165dc45e8cb | Etherscan\n\n  The Contract Address 0x89d19532ed703e9cb5d8884caf9bc165dc45e8cb page allows users to view the source code, transactions, balances, and analytics for the contract address. Users can also interact and make transactions to the contract directly on...\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 22, "readers_count": 21, "created": "2024-02-28T03:05:31.770Z"}, {"topic_id": 12830, "post_id": 41825, "post_number": 16, "score": 9.6, "author_username": "sakulstra", "text": "@ghantav what you have is aave-v1 assets, not aave v2 amm assets.\nAvara hosts an interface for aave-v1 here: Aave - Open Source Liquidity Protocol", "reads": 23, "readers_count": 22, "created": "2024-02-28T07:27:08.740Z"}, {"topic_id": 12830, "post_id": 41880, "post_number": 17, "score": 14.6, "author_username": "ghantav", "text": "I am using Argent Wallet and wallet connect is not working. So I am kind of stuck, can you please suggest alternative actions?", "reads": 23, "readers_count": 22, "created": "2024-02-29T02:57:19.233Z"}, {"topic_id": 12830, "post_id": 41882, "post_number": 18, "score": 14.4, "author_username": "sakulstra", "text": "Just a community member and as the ui is closed source i can’t really check. I assume the wallet connect integration is just outdated. Perhaps check with the avara support on discord or email.\nOne thing i guess one can always do is interact with the block explorer directly as i assume it supports modern wallet connect.", "reads": 22, "readers_count": 21, "created": "2024-02-29T08:38:56.101Z"}, {"topic_id": 12830, "post_id": 43797, "post_number": 19, "score": 7.6, "author_username": "bobnorris", "text": "Hi, I have BPTWBTCWETH LP staked on AMM Market which I can withdraw, but I can’t unwrap into the component parts. I have borrows in WBTC and ETH which I can’t pay down using BPTWBTCWETH and it’s also not migratable to v3. The token isn’t recognised on balancer.io any more so how can I extract the WBTC & ETH from BPTWBTCWETH to pay off outstanding loans?", "reads": 15, "readers_count": 14, "created": "2024-04-20T13:37:55.021Z"}, {"topic_id": 12830, "post_id": 43843, "post_number": 20, "score": 46.8, "author_username": "miguelmtz", "text": "Hi, you can use the Balancer V1 ui to redeem your BPT tokens. I recommend to ask for help in Aave Discord in case you have any problem ", "reads": 11, "readers_count": 10, "created": "2024-04-22T07:23:14.168Z"}], [{"topic_id": 17424, "post_id": 43790, "post_number": 2, "score": 3.6, "author_username": "EzR3aL", "text": "Hi,\nYou got somehow scammed and your funds moved to a Phishing wallet. Not related to Aave, it must be something else you may have signed before or a malicious link.", "reads": 31, "readers_count": 30, "created": "2024-04-20T06:43:36.180Z"}, {"topic_id": 17424, "post_id": 43791, "post_number": 3, "score": 13.6, "author_username": "soundbytec", "text": "Hi EzR3eal,\nthanks for responding!\nThe Aave webiste i was using is https://app.aave.com/. The only other website website i connected the Metamask wallet (with cold wallet assigned) recently is the https://reward-origineth.net/ (likely a fake NFT drop, phishing attack), in order to approve the website to connect to the wallet (pic below). The access to the private keys is not possible wo the cold wallet seed phrase which i share with no one.\nHave a couple of questions:\n\n\nHow is it possible for the attacker to move the collateral created through Aave smart contracts?\n(ETH → aETHwETH)? For the transaction at hand i was not online at the time, so unlikely i approved the transaction form the smart contract related to transaction: 0x1df7B652d428557044Cc15E22b7A6508E21caDa4\n\n\nIs it possible for the attacker to convert aETHwETH → ETH? How would they do that?\n\n\n\nThanks for helping me understand!\nBest,\nsoundbytec", "reads": 31, "readers_count": 30, "created": "2024-04-20T07:24:29.458Z"}, {"topic_id": 17424, "post_id": 43793, "post_number": 4, "score": 18.2, "author_username": "EzR3aL", "text": "Well it’s obviously a scam that drained your wallet. Etherscan is already flagging it.\nYou simply approved a contract to get access to your funds, if you would have used rabby this could have been prevented. As rabby simulates a transaction upfront.\nAnd aETHwETH is just an asset, so if there is liquidity it can be exchanged to ETH.", "reads": 27, "readers_count": 26, "created": "2024-04-20T09:46:18.352Z"}, {"topic_id": 17424, "post_id": 43804, "post_number": 5, "score": 7.4, "author_username": "soundbytec", "text": "@EzR3aL\nThanks for the tip on Rabby - ill look into it.\nIs the approaval transaction also recorded on the network? How can i check it?\nWhat was interesting is that there were other coins on the account, however none of those were touched, very likely because the approval contract is related only to collateral used on Aave, e.g. aETHwETH. This suggests to me that the attackers vector of attack is focused around the way that Aave borrowing works.\nOne other recent example i managed to find here:\n  \n      \n\n      Binance\n  \n\n  \n    \n\nWhale Cancels Authorization After Losing $4.2 Million in Phishing Attack\n\n  According to Foresight News, the whale who lost approximately $4.2 million in a phishing attack yesterday has canceled the related authorization. The attacker pushed the whale's aEthWETH address in Aa\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 23, "readers_count": 22, "created": "2024-04-20T17:59:56.764Z"}, {"topic_id": 17424, "post_id": 43807, "post_number": 6, "score": 2.0, "author_username": "EzR3aL", "text": "Every transaction is written on the Blockchain.", "reads": 20, "readers_count": 19, "created": "2024-04-20T18:24:45.967Z"}, {"topic_id": 17424, "post_id": 43819, "post_number": 7, "score": 0, "author_username": "ACI", "text": "", "reads": 13, "readers_count": 12, "created": "2024-04-21T18:56:51.362Z"}], [{"topic_id": 17360, "post_id": 43591, "post_number": 2, "score": 141.6, "author_username": "ChaosLabs", "text": "Aave V2 and V3 Liquidation Analaysis\nIn the past 48 hours, the cryptocurrency market has experienced a significant and rapid decline in asset prices. Both ETH and BTC saw substantial drops, with ETH plummeting by 17% and BTC by 12% from their recent peaks. Particularly noteworthy is the occurrence of 10% and 8.3% drops within just 30 minutes, reflecting the market’s volatility and the speed at which prices can fluctuate. This swift downturn also affected more volatile crypto assets, with many experiencing drops exceeding 20%. As a result, we summarize the recent liquidation events on Aave V2 and V3 to analyze the impact of this downturn on the protocol.\nAave v3\nLiquidations\nIn the past 48 hours, liquidations totaling over $65 million took place, with a significant portion of $50 million, representing 77%, occurring within the last 24 hours alone. These liquidations involved 4,250 events across 1,858 unique accounts and were executed by 70 distinct liquidators.\n\n\nThe majority of liquidations, amounting to 70.6% or $46.9 million, took place on the Ethereum Mainnet.\n\n58.8% of all liquidations involved wstETH or WETH as collateral assets. Additionally, assets like AAVE and WAVAX saw a relatively high number of liquidations, accounting for 9.8% ($6.52 million) and 9.2% ($6.13 million), respectively.\n\nAs expected, 98.5% of debt assets were represented by various stablecoin iterations.\n\nAccount Size Distribution\nBelow, we illustrate the distribution of accounts liquidated over the last 48 hours, categorized by the size of the positions involved. Notably, the largest account amounted to $8.11 million, comprising a wstETH-collateralized USDC debt position.\n\n\n\n\nMinimum Size of Collateral Seized\nNumber of Accounts\nSum of Liquidated\n% of Total\n\n\n\n\n100K\n68\n54.85M\n84.3%\n\n\n500K\n18\n43.4M\n66.7%\n\n\n1M\n11\n37.9M\n58.3%\n\n\n2.5M\n7\n31.9M\n49%\n\n\n\nBad Debt\nAave V3 demonstrated exceptional efficiency over the last 48 hours, with minimal bad debt incurred, as evidenced in the chart below.\n\nAave V2\nSimilar to V3, V2 experienced over $24M in liquidations over the past 48 hours, with $15M, or 62.5%, happening within the last 24 hours. This involved 334 liquidation events across 245 unique accounts, executed by 31 unique liquidators.\n\n\nNaturally, the vast majority of liquidations occurred on Ethereum Mainnet, accounting for 99% or $23.8M of the total.\n\n98.4% of the seized collateral originated from WETH and stETH.\n\nSurprisingly, however, the vast majority of debt asset liquidations stemmed from WBTC debt, as can be seen below.\n\nThis originated from a single account that accounted for $21.9M in seized collateral, representing 91.25% of the total liquidation amount. Subsequently, this position has experienced a 30% reduction in value, leaving 17K ETH as collateral against 676 WBTC in debt.\nAccount Size Distribution\n\n\n\n\nMinimum Size of Collateral Seized\nNumber of Accounts\nSum of Liquidated\n% of Total\n\n\n\n\n50K\n7\n23.5M\n97.9%\n\n\n100K\n5\n23.4M\n97.5%\n\n\n500K\n2\n22.7M\n94.5%\n\n\n1M\n1\n21.9M\n91.25%\n\n\n\nBad Debt\nAave V2 worked incredibly efficiently over the last 48 hours, incurring minimal bad debt, as can be seen in the chart below.\n\nConclusion\nOverall, the Aave protocol demonstrated robust performance over the past 48 hours, with the current parameterization proving effective during this stress test. We’ll remain vigilant and make necessary adjustments if faced with further extreme conditions.", "reads": 34, "readers_count": 33, "created": "2024-04-14T20:37:20.153Z"}], [{"topic_id": 17053, "post_id": 42641, "post_number": 2, "score": 117.2, "author_username": "EzR3aL", "text": "Hello @LlamaRisk im happy to see a risk provider engaging with the DAO after recently one decided to leave the DAO.\nI like the scope you are providing and the 6 months of “test” engagement. And from your previous work I can see that you are very strong focused on stablecoin assets, right?\nCan you tell me where you are based and how many people are working for LlamaRisk and maybe some background information, to better understand your skills.\nIf approved by the DAO what would the collaboration between you and Chaos look like?\nFrom what I can read both of you are specialized in different fields.\nAre you going to be Aave exclusive or also working for other lending protocols, for example also forks of Aave v2/3?\nThank you", "reads": 91, "readers_count": 90, "created": "2024-03-20T15:44:13.871Z"}, {"topic_id": 17053, "post_id": 42654, "post_number": 3, "score": 76.0, "author_username": "Frida", "text": "It is great to see a team like @LlamaRisk taking interest in becoming a Risk Mgmt provider for Aave.\nDo you have a high-level example of a low-hanging fruit you would tackle first? Or an aspect of Aave you would like to focus first?\nClear examples would help to understand what some of the themes you outline in the Temp Check would look like.\nWould there be a ramp-up plan if you were to be elected? How would that look like? Aave has many markets in different blockchains resulting in different risk profiles. Also, Chaos Labs (and prev Gauntlet as well) are part of different roles (I believe stewards or sth like that).", "reads": 85, "readers_count": 84, "created": "2024-03-21T00:32:04.390Z"}, {"topic_id": 17053, "post_id": 42676, "post_number": 4, "score": 186.4, "author_username": "LlamaRisk", "text": "@EzR3aL, @Frida, appreciate your support and interest!\n\n\n\n EzR3aL:\n\n\nAnd from your previous work I can see that you are very strong focused on stablecoin assets, right?\n\n\n\nAt LlamaRisk, we spend a great deal of our attention assessing the protocol design of stablecoins, liquid staking derivatives, and other pegged assets. We also review centralized issuers and relevant risks related to reserves, attestations, and regulatory compliance. Our main clients are Curve and Prisma, so naturally, most of our work revolves around stablecoins and liquid staking tokens.\n\n\n\n EzR3aL:\n\nCan you tell me where you are based and how many people are working for LlamaRisk and maybe some background information, to better understand your skills.\n\n\nWe began in 2021 as a service to Curve DAO in response to a realization that integrations were happening faster than DAO members could reasonably assess the risk. We formed to be an objective resource because, at the time, it was a bull market; there was a new, exciting bribe market, and we realized a certain complacency and get-rich-quick mentality was overcoming good judgment that could have lasting consequences. Here are a couple of situations where we put our neck on the line in the interest of protecting Curve’s reputation and its LPs, and which resulted in favorable outcomes for Curve:\nTangible USDR: A stablecoin backed by real estate\n\nLlamaRisk Report - April 25, 2023\nResponse by Tangible - April 27, 2023\nLlamaRisk proposal to pause USDR gauge - April 28, 2023\nUSDR Depeg - Oct. 11, 2023\n\nTUSD: A custodial stablecoin with intransparent reserves\n\nLlamaRisk Report - Aug. 19, 2023\nProposal to reduce Pegkeeper exposure from 25m to 5m crvUSD - Aug. 24, 2023\nTUSD depeg - Jan. 18, 2024\nProposal to reduce Pegkeeper exposure from 5m to 0 crvUSD - Feb. 12, 2024\n\nOur team comprises researchers, analysts, economists, data scientists, smart contract developers, and legal experts. We have five full-time members and about a dozen analysts. Our team is fully distributed across America, Europe, and Asia.\n\n\n\n EzR3aL:\n\nIf approved by the DAO what would the collaboration between you and Chaos look like?\nFrom what I can read both of you are specialized in different fields.\n\n\nWe have a prior history wokring with Chaos Labs, with contracting them to develop a risk dashboard for crvUSD. We communicated with members of their team from onboarding until delivery of the product and have begun developing a good relationship with their team. We intend to work closely with them and provide support in areas where their resources are better spent elsewhere. That means we will produce qualitative collateral risk reports for assets backing GHO, including market and adoption analytics and technical, counterparty, and regulatory risk factors. This focus will allow Chaos Labs to dedicate more attention to quantitative analysis across the various chains Aave is deployed. LlamaRisk and Chaos Labs are aligned in our enthusiasm for collaboration, and we see this mutual attitude as a big opportunity to bring Aave’s risk services to the next level.\n\n\n\n EzR3aL:\n\nAre you going to be Aave exclusive or also working for other lending protocols, for example also forks of Aave v2/3?\n\n\nWe continue to partner with Curve and plan to provide service for Curve Lending, particularly by developing a simulation tool for improved optimization and risk monitoring. LlamaRisk has never directly engaged with AAVE forks; we work with just a handful of protocols, most prominently Curve Finance and Prisma Finance. For full transparency, we have worked on aggregator vaults on behalf of Curve and Prisma, including strategy design and management and supporting contract development. These are initiatives to promote integrations of the crvUSD and mkUSD stablecoins, employing high transparency and risk management standards for which we have built a reputation. We have an active aggregator on Sturdy v2 with $5.7m in TVL currently and an upcoming vault on Morpho, both of which involve Curve LPs as collateral to borrow crvUSD.\nTo address potential concerns about how committed we are to our partners, consider that we have been partnered with Curve for the entire time we have operated and have yet to terminate an engagement with any of our partners. Loyalty is central to each protocol we partner with; it is not something we treat casually. Anyone can verify this by contacting the Curve and Prisma team (on Telegram if direct contacts are unavailable) and asking them how their experience working with LlamaRisk has been. We guarantee they will only have positive things to say. Rest assured that we will treat an engagement with Aave with the same dedication that has earned us the respect of our other partners.\n\n\n\n Frida:\n\nDo you have a high-level example of a low-hanging fruit you would tackle first? Or an aspect of Aave you would like to focus first? Clear examples would help to understand what some of the themes you outline in the Temp Check would look like.\n\n\nWe see potential to add immediate value in a few key areas:\n\nSupport GHO adoption: A particular focus will be put on the GHO stablecoin to review and assess the underlying collateral assets. We will also explore potential venues for further integration and adoption of GHO within the broader ecosystem. Our insights will help to ensure the stability and trust in GHO, supporting its wider use and acceptance.\nRegulatory Review: We offer unique expertise in providing regulatory reviews of Aave, which will complement Chaos Labs’ quantitative analysis and serve as a component of multidisciplinary risk assessment. Our team will prioritize this area, adding significant value to the community. We can also explore delivering stand-alone updates on key regulatory changes to inform the community about the evolving landscape.\nEmpirical Research and Qualitative Risk Assessment: We will provide empirical research and qualitative risk assessment of assets in Aave’s markets across various chains, analyzing factors like market dynamics, adoption, technical risks, and counterparty risks.\n\n\n\n\n Frida:\n\nWould there be a ramp-up plan if you were to be elected? How would that look like? Aave has many markets in different blockchains resulting in different risk profiles. Also, Chaos Labs (and prev Gauntlet as well) are part of different roles (I believe stewards or sth like that).\n\n\nAs a new contributor to the Aave ecosystem, we are excited to learn about the different governance processes, participating actors, and the overall structure of the protocol. While we have extensive experience interacting with various DAOs, we recognize that engaging directly with Aave governance will require some learning, and we are very keen to acquire this knowledge quickly. Note, however, that we do have extensive experience as Aave users; members of our team have interacted with the protocol and followed developments since as far back as early 2020.\nWe are committed to rapidly ramping up our participation in governance discussions, particularly in areas where our expertise can add significant value. Chaos Labs has generously offered support and guidance to facilitate our learning process, which will help us adapt and contribute effectively.\nOur ramp-up plan involves dedicating efforts to familiarize ourselves with Aave’s governance structure and risk management frameworks. We will work closely with the Aave community, Chaos Labs, and other key stakeholders to ensure our contributions are well-informed and aligned with the protocol’s goals. With the unique needs of Aave in mind, we will develop a custom framework to comprehensively assess assets on Aave, particularly collateral backing GHO, as a priority. We will then systematically begin applying the framework, starting with assets that GHO is most exposed to and/or present noteworthy systemic risks.\nBy the end of this initial engagement period, we aim to be fully ramped up and integrated into the Aave ecosystem, allowing us to expand our scope to cover additional observed pain points and deliver maximum value to the community sustainably and effectively.", "reads": 87, "readers_count": 86, "created": "2024-03-21T16:36:07.827Z"}, {"topic_id": 17053, "post_id": 42718, "post_number": 5, "score": 208.6, "author_username": "ChaosLabs", "text": "We’re excited to see new contributors looking to contribute and enhance risk management within Aave. As the leading lending protocol featuring a broad range of deployments and assets, Aave necessitates top-tier contributors, especially in risk management.\nThe proposed scope appears to enrich the DAO, offering a complementary perspective to our work at Chaos Labs, especially in areas outside our current focus, as described by the Legal Regulatory Advisory, Qualitative Analysis, and Policy Work. We highly regard LlamaRisk’s past publications and have had a positive experience collaborating with the team while we developed a risk platform for crvUSD. Adopting a phased approach, beginning with a clearly defined scope, to allow LlamaRisk to demonstrate its value to the DAO and refine its focus based on identified needs and opportunities for maximum impact seems prudent.\nIf the community decides to onboard LlamaRisk, Chaos Labs will be ready and eager to assist with their onboarding. We will collaborate closely to protect Aave and ensure it continues to be the leading protocol in the space.", "reads": 71, "readers_count": 70, "created": "2024-03-22T19:55:51.743Z"}, {"topic_id": 17053, "post_id": 42797, "post_number": 6, "score": 77.8, "author_username": "ACI", "text": "The current proposal has been escalated to TEMP CHECK Snapshot.\nVote will start tomorrow, we encourage everyone to participate!", "reads": 67, "readers_count": 66, "created": "2024-03-25T13:53:36.469Z"}, {"topic_id": 17053, "post_id": 42831, "post_number": 7, "score": 31.8, "author_username": "midapple", "text": "I wonder if there will there be other bidders for Aave’s risk provider position. It would be helpful to see other contenders before voting on the eventual on chain proposal.", "reads": 62, "readers_count": 61, "created": "2024-03-26T09:20:27.367Z"}, {"topic_id": 17053, "post_id": 42843, "post_number": 8, "score": 101.4, "author_username": "stani", "text": "Thank you @LlamaRisk overall supportive for the proposal, the budget seems also good but also the scope as well. I think this proposal is the best proposal fro the Aave DAO with a subject for review after the 6-month engagement.", "reads": 60, "readers_count": 59, "created": "2024-03-26T17:08:57.790Z"}, {"topic_id": 17053, "post_id": 42919, "post_number": 9, "score": 55.2, "author_username": "sid_areta", "text": "LlamaRisk’s credentials are impressive; their work with Curve and Prisma, the 70+ risk assessments they have published, the team composition, previous experience in collaboratively working with Chaos Labs, and expertise around regulation and policy, which is a skill-set the DAO does not currently have, position LlamaRisk well for the engagement. Their agent-based simulation model will complement that of Chaos Labs and provide a check and balance to their recommendations depending on the inputs to LlamaRisk’s models. The budget proposed is fair - $250k for the first 6 months is not excessive at all. The disclosures and reports provided on their spending are also good practice.\nThe scope adds further expertise in the areas of LSTs, LRTs, and GHO, all of which are becoming critical components of the protocol and could drive a lot of revenue for Aave. Providing further expertise on GHO is crucial for its wider adoption, so this is a welcome addition for the DAO. It is not immediately clear why the DAO would need any regulatory advice but since this is included within LlamaRisk’s broader scope and may become more important if Aave engages with RWAs in the near future, we are not opposed to it.\nOne concern is that other risk managers who potentially want to work with the DAO should also get a chance to put their proposals up. However, there is time before a potential on-chain vote, so if other risk managers put their hands up to work with Aave DAO, these can be considered as well.\nAll in all, we will vote YES in favour of this proposal.", "reads": 55, "readers_count": 54, "created": "2024-03-27T17:28:04.746Z"}, {"topic_id": 17053, "post_id": 42936, "post_number": 10, "score": 54.8, "author_username": "Kene_StableLab", "text": "This is a great proposal from an experienced team who put forth a proposal with a good scope and budget. The only issue that may arise is with competing proposals.\nIn order to solve this I would proposal that after a successful ARFC Snapshot vote, prospective risk service providers should be put to a final Snapshot vote to determine which service provider will be engaged by the DAO.", "reads": 53, "readers_count": 52, "created": "2024-03-28T06:19:24.377Z"}, {"topic_id": 17053, "post_id": 43028, "post_number": 11, "score": 40.8, "author_username": "MarcZeller", "text": "Hello,\nWith the ACI we’ll be supportive of this TEMP CHECK, As we have 3 different proposals for a Risk service provider slot,\nWe do not consider an efficient ressource allocation to have more than two Risk service providers.\nWe suggest that at ARFC stage, the candidates that received a positive TEMP CHECK snapshot vote outcome to be in sync at ARFC to ensure equal opportunity and representation and allow everyone to have a fair shot to present their SP candidacy to the Aave community.\nAfter a sufficient debate period, we suggest a single ranked voting ARFC snapshot vote to allow governance to express their preference.", "reads": 58, "readers_count": 57, "created": "2024-03-31T04:31:51.599Z"}, {"topic_id": 17053, "post_id": 43072, "post_number": 12, "score": 75.4, "author_username": "LlamaRisk", "text": "While we are eager to start working for the Aave DAO and await the ARFC vote for selecting the additional risk service provider, we wanted to share some of our recent work that is relevant to current Aave affairs;\nOnboarding weETH to Aave V3 (mainnet and Arbitrum)\n\n  \n    \n    \n    [ARFC] Onboard weETH to Aave v3 on Ethereum Governance\n  \n  \n    Proposal updated to include Risk team feedback \n\nTitle: [ARFC] Onboarding of weETH to Aave v3 on Ethereum\nAuthor: Ether.fi & @ACI ( Aave Chan Initiative)\nDate: 2024-02-27\nSummary\nThe current ARFC seeks to add Ether.fi Liquid Restaking Token weETH to Aave V3 Ethereum, after the successful TEMP CHECK and TEMP CHECK Snapshot. \nThe intention behind this initiative is to enhance the diversity of assets on Aave and bolster liquidity within the ecosystem. \nMotivation\neETH is an LRT that allows users t…\n  \n\n\nWe recently completed a comprehensive risk assessment on Ether.fi’s weETH token, which can be found here. This report analyzes the market, technology, and regulatory risks associated with weETH as a potential collateral asset. This assessment is highly relevant to the ongoing discussions around onboarding weETH to Aave V3 on Ethereum ([ARFC] Onboard weETH to Aave v3 on Ethereum).\nOur team is continually building expertise in the emerging Liquid Restaking Token (LRT) ecosystem, and we are committed to providing valuable insights to inform the AAVE community’s decision-making process.\nOnboarding sUSDe to Aave V3 mainnet\n\n  \n    \n    \n    [ARFC] Onboard sUSDe to Aave V3 on Ethereum Governance\n  \n  \n    Title: [ARFC] Onboard sUSDe to Aave V3 on Ethereum\nAuthor: ACI (Aave Chan Initiative)\nDate: 2024-04-01\nSummary\nThis is an ARFC to seek approval for the addition of sUSDe to Aave V3 on Ethereum, following the consensus reached in the TEMP CHECK stage. \nMotivation\nAs discussed in the TEMP CHECK, Ethena’s synthetic dollar, USDe, provides a stable crypto-native solution for a cash and carry structured product. The staked version of USDe, sUSDe, earns yield from the protocol and has high potential fo…\n  \n\n\nWe are also working on a risk assessment for Ethena’s sUSDe. Given the recent proposal to onboard sUSDe to Aave V3 on Ethereum ([ARFC] Onboard sUSDe to Aave V3 on Ethereum), we believe our forthcoming report on sUSDe will be of great interest to the Aave community. Once completed, we will share our findings and analysis with the DAO.\nWe are dedicated to providing high-quality, independent risk assessments to support the growth and security of the Aave protocol. We look forward to working more closely with the Aave DAO and contributing our expertise to the community.", "reads": 57, "readers_count": 56, "created": "2024-04-01T15:40:32.647Z"}, {"topic_id": 17053, "post_id": 43338, "post_number": 13, "score": 126.8, "author_username": "LlamaRisk", "text": "Sharing our latest publication which dives deep into the challenges DeFi lending faces under the current European regulatory landscape.\nKey Highlights:\n\nThe need for DeFi protocols to adapt and possibly redefine strategies to ensure genuine decentralization, amidst regulatory scrutiny.\nPractical suggestions for DeFi protocols, including enhancing DAO structures and maintaining a permissionless design, to uphold the decentralized ethos and operational integrity.\nUpcoming comprehensive analysis by the EU Commission, which could set the stage for future regulatory treatments of decentralized finance.\n\nRead more here:\n  \n      \n\n      cryptorisks.substack.com\n  \n\n  \n    \n\nEU Regulations: Challenges for DeFi Lending Protocols\n\n  Navigating the waters of EU regulations and pathways for lending protocols to overcome challenges\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 39, "readers_count": 38, "created": "2024-04-08T10:17:29.021Z"}], [{"topic_id": 16705, "post_id": 41634, "post_number": 2, "score": 41.2, "author_username": "EzR3aL", "text": "Maybe someone can correct me, but those assets cannot be blocked, as they are from Aave. But what could happen is that your USDC/T is getting blocked and thus you cannot repay your loan and get liquidated.", "reads": 31, "readers_count": 30, "created": "2024-02-21T22:10:20.658Z"}, {"topic_id": 16705, "post_id": 41669, "post_number": 3, "score": 9.8, "author_username": "maokah", "text": "My plan is to supply my USDT/C on Aave receiving AUSDT/AUSDC in the progress. That AUSDT/AUSDC can be traded to different ETH addresses? So that I send the AUSDT to address 2 for example. And if i want to liquidate that position, will I get the locked USDT/C back that I previously provided or from the total smart contract?\nThank you", "reads": 24, "readers_count": 23, "created": "2024-02-22T22:45:43.139Z"}], [{"topic_id": 15934, "post_id": 39465, "post_number": 2, "score": 68.0, "author_username": "EzR3aL", "text": "Hello,\nunfortunately you interacted with some phishing scam. I would highly recommend you to send all token to  a hardware wallet and don’t enter any private keys, seed phrases, etc. somewhere.\nI also have to tell you that we cannot do anything for you. Get in touch with local authorities, they might help you if the scammer is using a CEX to exit to Fiat and has KYC.", "reads": 15, "readers_count": 14, "created": "2023-12-26T22:25:34.977Z"}, {"topic_id": 15934, "post_id": 39466, "post_number": 3, "score": 13.0, "author_username": "EzR3aL", "text": "", "reads": 15, "readers_count": 14, "created": "2023-12-26T22:25:39.379Z"}], [{"topic_id": 15405, "post_id": 37711, "post_number": 2, "score": 12.6, "author_username": "EzR3aL", "text": "Hey, please see here this thread. You will find your answer here.\n  \n    \n    \n    Aave v2/v3 security incident 04/11/2023 Development\n  \n  \n    there is no built in mechanism to freeze interest rates. It’s 6 days and everything will be restored, understand that this was an emergency situation and everything that could be humanly possible to restore normal operation asap has been done.\n  \n\n\nIt will take 5 days from now till everything will be unlocked again and going back to a normal state.\nIm going to close this thread to keep it clean.\nThank you", "reads": 38, "readers_count": 37, "created": "2023-11-08T08:23:53.666Z"}, {"topic_id": 15405, "post_id": 37712, "post_number": 3, "score": 22.2, "author_username": "EzR3aL", "text": "", "reads": 36, "readers_count": 35, "created": "2023-11-08T08:23:58.297Z"}], [{"topic_id": 15250, "post_id": 37246, "post_number": 2, "score": 63.6, "author_username": "ApuMallku", "text": "Thanks for the deep analysis @ChaosLabs; much appreciated that you took the lead on that. When can we expect to have a coherent and integral solution? A broader solution between all the SPs is needed. The lack of trust (and strategy) that GHO is receiving from the market is damaging the long-term vision for GHO as a key product. As a GHO borrower we are now drastically considering not borrowing more GHO until we understand who owns the GHO strategy, why @AaveLabs is not commenting on anything related to GHO, and why it was released without a further plan, etc. It’s incredibly scary to think that GHO is now in the hands of the community without having more context of the situation.", "reads": 68, "readers_count": 67, "created": "2023-10-27T10:49:52.068Z"}, {"topic_id": 15250, "post_id": 37247, "post_number": 3, "score": 48.6, "author_username": "EzR3aL", "text": "Hi all,\nfirst of all thank you Chaos Labs for this analysis. GHO is definitely looking for help.\nI think with the current proposed things like the SM upgrade including GHO and the Liquidity committee we are on track to help GHO reaching and holding its peg and restoring faith or establishing it. It is crucial to have different liqudity pools for GHO (see the graphics above).\n@ApuMallku we still have to consider, that GHO is just a few months old.\nGHO doesn’t have the benefits of being a dex liquidity based stablecoin like CRVUSD. Which is also heavily subsidized by Mich.\nGHO has the benefit of being multicollateral backed and has a high collaterization rate (2,79). This has to be advertised and actively used as a benefit.\nAlso i think the whole DeFi space is vulnerable to regulatory risks at the moment. Which could be a reason why Aavecompanies is more passive. Don’t get involved too much to not risk anything. Its better to stay in the background instead of being actively watched by SEC for example. This is probably going to be better in the future, but for now it is a risk. Just some idea of myself, don’t know if its true but could be. I mean some protocol interface already prohibit user to use them.", "reads": 68, "readers_count": 67, "created": "2023-10-27T11:25:29.487Z"}, {"topic_id": 15250, "post_id": 37248, "post_number": 4, "score": 68.2, "author_username": "ApuMallku", "text": "I see what you mean but it seems that the market is not looking for a highly collateralized stablecoin, everyone is chasing yield. If we can’t offer yield by subsidizing LPs maybe is time to offer GHO <> RWA like what Frax is doing with sFRAX and attract yieldooors who can also want a highly collateralized stablecoin. We are far from reaching PMF because it’s too early, we know, but we need to understand who is our target. Thats why we’ve been asking who owns GHO’s strategy and if there is/was a plan when launching the product. We think these questions are fair and the community deserves to know and have more transparency in order to make better governance decisions.", "reads": 66, "readers_count": 65, "created": "2023-10-27T11:42:08.738Z"}, {"topic_id": 15250, "post_id": 37249, "post_number": 5, "score": 58.6, "author_username": "EzR3aL", "text": "\nthe market is not looking for a highly collateralized stablecoin\n\nYet\nThe strategy has to be defined by the DAO. GHO is in our (Aave holder) hands. And we are the ones defining it.\nWe will definitely have to offer yield in any way. And RWA could be a way but i also think RWA are dangerous. You are basically combining the danger offchain and onchain together.\nI think GHO could be a great usecase for perp trading protocols. Use GHO as counter part with high collaterization similiar to Gains network with DAI. The protocol could be whitelisted as an facilitator and have a bucket size. GHO would get deep liquidity and the protocol would immediately have access to great liquidity, which is heavily needed to offer leverage.\nGMX is already struggling with GLP and GHO as a stablecoin would be perfect. Also it would be cheaper.", "reads": 68, "readers_count": 67, "created": "2023-10-27T12:21:23.534Z"}, {"topic_id": 15250, "post_id": 37254, "post_number": 6, "score": 242.8, "author_username": "TokenLogic", "text": "Hi Everyone,\nEarlier today @TokenBrice and the GLC created the following pools on Maverick. Both pools are currently receiving GHO incentives in effort to attract deposits.\nPool 57 provides greater USDC depth in liquidity as the price falls. This is in stark contrast to Uni v3 which has linear liquidity distribution over defined ranges. More deposits into the Maverick pool will help support GHO recovering the peg. The pool has been live only a few hours and has 553k in TVL.\nGHO-USDC #57\n\nPool 58 is a tight range pool that is offering greater capital efficiency and is attracting a lot of the current trading volume. The pool has been live only a few hours and has 520k in TVL.\nGHO-USDC #58\n\nThe Sommelier vault and the Aave DAO provided some buying support around the 22th October which started to move GHO’s price higher. However, the volume swaps from GHO to USDC was greater and the relief was short lived. The current Uniswap v3 pool is majority Sommelier’s Turbo GHO vault. 2.83M of of 3.09M. We are in touch with the Sommelier team as this liquidity is out of range.\nAuthor: @MatthewGraham", "reads": 64, "readers_count": 63, "created": "2023-10-27T15:40:52.211Z"}, {"topic_id": 15250, "post_id": 37630, "post_number": 7, "score": 44.8, "author_username": "chippervan", "text": "i have no problem with GHO being under peg and cheap to borrow. if Aave is worried about regulation as per @EzR3aL and do not want to work on parternships etc i think it is unfair to just raise interest rate as i believe raising interest rate alone will not restore peg. but it will hurt early adopters of GHO. which i think strategically could be a mistake.\nif it is critical to improve peg then i think increasing GHO utility should be the next move. the team have already tweaked the interest rate and it did nothing. market is moving too fast. next lever they pull on should be utility.\nexample:\n\n\nAave funds a compound fork using GHO as base asset, then use LM to incentivize depositors? if you could get GHO at low interest rate, use as collateral to farm another token then perhaps that would decrease sell pressure. maybe there could be other synergies with an app and token like this. I think Compound v3 codebase might be under business license but i think it is worth exploring.\n\n\nintegrate GHO into SILO as per crvUSD into SILO LLAMA edition. see:\nhttps://silodao.fyi/what-is-silo-llama\n\n\nintegrate GHO into SPARK protocol as per DAI into Aave\n\n\n@ApuMallku suggestion about RWA is interesting. not sure how that could work.\n\n\nnot sure what implications of using GHO on Aave as collateral. perhaps in isolation mode it could work but i think suggestions like this need to vetted by quants and risk experts. also wonder what price/oracle you would use for GHO when used as collateral vs price for debt? probably would need market price for GHO when used as collateral?\n\n\n@EzR3aL and others suggestion on using GHO BLP in SM is a bad idea imo. Yes, it is better than using Aave token but using assets individually makes more sense to me. I think if ppl are throwing out this suggestion then it needs proper quant/risk analysis and comparison to other options and not just a comparison to current solution. GHO BLP holds balancer protocol risk, risk of all assets that BLP is composed of, and all assets that GHO is composed of. I think if Aave had a big issue then GHO price would plummet. I think if Aave had a big issue related to one of the assets then I think Aave token would plummet, GHO would plummet, the asset with an issue would plummet, but the other assets that GHO is composed of would not; therefore using assets individually makes more sense. My logic is something along those lines.\n\n", "reads": 49, "readers_count": 48, "created": "2023-11-07T03:39:47.862Z"}], [], [{"topic_id": 14070, "post_id": 33706, "post_number": 2, "score": 158.4, "author_username": "TylerEther", "text": "This sounds remarkably similar to the rate controller I started developing early this year (read more) called Adrastia Prudentia. @bgdlabs (Ernesto) is somewhat familiar with it. Has Block Analitica considered creating a rate computer to plug into Prudentia?\nIn addition to the rate controller, we’re also running geometric-mean time-weighted average supply rate oracles that can be used to power the enhanced IRM with even more precision as you’ve described. Here’s one that’s been tracking the USDC supply rate on Polygon for the past 2 months: Aave v3 USDC Interest Rate Oracle by Adrastia.\nLet me know what you think because I’d love to work together on this!", "reads": 67, "readers_count": 66, "created": "2023-07-20T16:01:14.727Z"}, {"topic_id": 14070, "post_id": 33832, "post_number": 3, "score": 151.4, "author_username": "monet-supply", "text": "Hi Tyler,\nThe mechanism we proposed is focused on minimizing gas intensive operations to maintain user experience and reduce operating costs for the host protocol (Aave in this case). With the above rate automation mechanism, it should only be necessary for keepers to update the interest rate model once per day or less, which should help limit gas costs; this is particularly important on mainnet but might be less of a concern on other chains/L2s such as Polygon PoS, Gnosis, Avalanche, Optimism or Arbitrum.\nImo the core goals for IRM automation should be maintaining market safety, improving efficiency (lower spread between borrow and supply rates, resulting from higher average market utilization rates), and less voting/governance/service provider overhead, while limiting cost of operation. If Adrastia oracles can achieve this with better precision / at comparable cost, this would make sense to use borrow/supply rate oracles rather than the proposed geometric mean rate evaluation mechanism. But I suspect at least on Ethereum mainnet using daily geometric mean will probably offer a better tradeoff between precision and operating expenses.\nHappy to discuss further!", "reads": 57, "readers_count": 56, "created": "2023-07-24T19:42:46.467Z"}, {"topic_id": 14070, "post_id": 33909, "post_number": 4, "score": 50.2, "author_username": "TylerEther", "text": "Hey monet,\nThanks again for the response! We talked on Discord, but I’ll also respond here for transparency and to allow more people to participate in the discussion.\nThe core goals of maintaining market safety, improving efficiency, reducing overhead, and limiting the cost of operation are well aligned with Adrastia.\nOur rate oracles can be - and are - tailored to each chain that they’re deployed on. On L2s and alt-L1s, precision is cheap. With Polygon, for instance, a sensitivity threshold of 2% (2% → 2.04% => update) for the USDC supply rate costs about $4/month to maintain. Ethereum is much costlier, so a higher sensitivity threshold can be used such that updates occur on average once per day or less.\nI will provide a cost estimate for Ethereum and other chains in the coming days.\nThanks!", "reads": 51, "readers_count": 50, "created": "2023-07-26T18:00:59.047Z"}, {"topic_id": 14070, "post_id": 34238, "post_number": 5, "score": 43.6, "author_username": "TylerEther", "text": "Over the past week I’ve done a gas cost estimate for Ethereum while also deploying and running 7-day average USDC supply rate oracles on Arbitrum and Optimism, which are now reporting data.\nOn Ethereum mainnet, with a 25% change threshold, an average of about 2.138 updates would be triggered per day. With an ETH price of $2000 and gas price of 56 gwei, the cost would be about $800/month.\nIt’s a lot less expensive to run feeds on Arbitrum and Optimism, so I decided to go ahead and start running these oracles. The following costs are extrapolated from the past 7 days with the oracles using a 2% change threshold.\nNote that the recent interest rate volatility has inflated these costs. Also, note that the 2% change threshold can be raised to decrease costs.\nArbitrum: 0.1882 ETH/month or $376/month.\nOptimism: 0.0601 ETH/month or $120/month.\nLet me know if these gas costs sound reasonable.", "reads": 43, "readers_count": 42, "created": "2023-08-02T23:57:51.766Z"}, {"topic_id": 14070, "post_id": 34239, "post_number": 6, "score": 23.8, "author_username": "ApuMallku", "text": "\n\n\n BlockAnalitica:\n\nIf your protocol is interested in implementing deeper automation, feel free to get in touch and we’ll be happy to discuss how we can help.\n\n\nWhat is the status of this proposal? @monet-supply @BlockAnalitica Having an IRM automation is a huge improvement for current AAVE’s mechanism.", "reads": 44, "readers_count": 43, "created": "2023-08-03T00:12:24.742Z"}, {"topic_id": 14070, "post_id": 35059, "post_number": 7, "score": 51.6, "author_username": "Gauntlet", "text": "On the whole, Gauntlet agrees that technologies such as this automated IR can be valuable additions to the Aave protocol. A dynamic interest rate that can adjust in response to a number of factors could optimize capital efficiency in a manner that is equivalent to credit scoring, and also reduce risk caused by a dearth of available reserve liquidity.\nHowever, automated IR mechanisms do have their tradeoffs. We show in our research on dynamic rate curves that the deterministic nature of this automated IR mechanism - as evidenced by the constant nature of marginal increase/decrease in IR outside of the target utilization bounds - could introduce potential attack vectors analagous to JIT liquidity attacks for Uniswap. These attack vectors essentially allow for a strategic user to profit and seize higher yield at the expense of less sophisticated lenders. This over time may reduce overall liquidity on protocols, impairing the capital efficiency of the protocol. For instance,\n\nA strategic user adds a large amount of demand and raises utilization rates by opening borrow positions, causing the interest rate to spike dramatically.\nThe choice of how much of a spike was caused allows the strategic user to sequentially reduce demand (repaying a portion of the opened borrow) and increase supply in such a way that the interest rate and utilization are stationary.\nAfter a number of blocks, the strategic user returns the utilization to the level prior to opening loans.\n\n\nAt a high level, we find that the reducing the reserve factor below certain thresholds can negate attacker profitability. We have also identified that considering supply and demand elasticities may help with this IR param optimization, especially with the reserve factor and optimally balancing protocol revenue. As a result, models for these elasticities and/or their results can be fed into future automated IR mechanisms to make them more robust against potential attacks and manipulations and disincentivize adversarial actors.", "reads": 33, "readers_count": 32, "created": "2023-08-17T23:16:35.504Z"}], [{"topic_id": 14226, "post_id": 34186, "post_number": 2, "score": 10.2, "author_username": "ChaosLabs", "text": "As we’ve already proposed here, we recommend increasing the USDT supply cap on V3 Ethereum to 300M.", "reads": 26, "readers_count": 25, "created": "2023-08-02T06:09:08.716Z"}, {"topic_id": 14226, "post_id": 34332, "post_number": 3, "score": 64.4, "author_username": "Gauntlet", "text": "We will move forward to increase USDT Supply cap to 300M and will implement Risk Steward actions shortly.", "reads": 22, "readers_count": 21, "created": "2023-08-03T14:55:15.287Z"}, {"topic_id": 14226, "post_id": 34413, "post_number": 4, "score": 4.0, "author_username": "ChaosLabs", "text": "This has been executed via Risk Steward.", "reads": 20, "readers_count": 19, "created": "2023-08-04T08:14:36.411Z"}], [{"topic_id": 14302, "post_id": 34410, "post_number": 2, "score": 39.2, "author_username": "ChaosLabs", "text": "As discussed, we’re aligned here and support moving directly to AIP.", "reads": 46, "readers_count": 45, "created": "2023-08-04T07:37:38.542Z"}, {"topic_id": 14302, "post_id": 34412, "post_number": 3, "score": 38.4, "author_username": "0xkeyrock.eth", "text": "We are supportive of this proposal and being direct-to-AIP.", "reads": 42, "readers_count": 41, "created": "2023-08-04T08:14:20.846Z"}, {"topic_id": 14302, "post_id": 34433, "post_number": 4, "score": 51.8, "author_username": "Gauntlet", "text": "Gauntlet recommendation to lower CRV LT/LTV on v3 Polygon\nSummary\nGiven the declines in DEX liquidity for CRV and other associated risk factors for CRV, Gauntlet recommends reducing the LT, LTV for CRV on Polygon v3.\nFor expediency purposes and to prevent excess forced liquidations, we recommend reducing CRV LT from 75% to 65% and the LTV from 70% to 35%.\n\nAs of August 4, this causes 4 accounts to be liquidatable.\n\n\n\n\n\nuser_address\nsupply_balance_usd\nborrow_balance_usd\nhf\nhf_new\nsupplied_symbols\nborrowed_symbols\norig_lt\nnew_lt\n\n\n\n\n0x56df4b7996a0a96e09d31bd69d95fd29d0a2b3bd\n5031\n4158\n1.00\n0.97\n[‘USDC’, ‘CRV’]\n[‘USDT’, ‘WBTC’]\n0.75\n0.65\n\n\n0xf36375ef8ef450476541f6326631cac44f9f0a49\n65\n47\n1.05\n0.99\n[‘USDC’, ‘WETH’, ‘DAI’, ‘WBTC’, ‘CRV’, ‘WMATIC’]\n[‘DAI’, ‘WBTC’, ‘CRV’, ‘WMATIC’]\n0.75\n0.65\n\n\n0x68a4e84fec63e80b3978a69d64a09fd91ab16a59\n5\n3\n1.15\n0.99\n[‘CRV’]\n[‘DAI’]\n0.75\n0.65\n\n\n0x0d004dc793b724490b192002cd76ec0cf43ad87c\n3\n1\n1.00\n0.93\n[‘WMATIC’, ‘CRV’]\n[‘EURS’]\n0.75\n0.65\n\n\n\nReducing LT further may cause user 0x60a6d69802239e8678f35cf3cff8af6d64ab4088 to be liquidated. This user has the following positions.\n\nSupply: $240k CRV, $230k USDC, $30k WMATIC, $15k WBTC\nBorrow: $280k USDT and $97k USDC\n\nWith the above CRV LT reduction to 65%, the user’s HF will become 1.05. Given the currently DEX liquidity on Polygon and the fact that the user supplies a roughly equal amount of USDC and CRV, lowering the user’s buffer towards liquidation should not cause excess risk.\nNext steps\nWe will combine the LT, LTV and debt ceiling reduction on v3 Ethereum and Polygon in one AIP. We welcome community feedback and once @ChaosLabs confirms support for both recommendations, we will move directly to AIP on Aug 4.", "reads": 34, "readers_count": 33, "created": "2023-08-04T18:10:13.029Z"}, {"topic_id": 14302, "post_id": 34436, "post_number": 5, "score": 15.8, "author_username": "ChaosLabs", "text": "We support this proposal.\nThe proposal aligns with Chaos’ strategy to incrementally reduce CRV LTs, which we started implementing on the V3 Polygon market a few weeks ago here.", "reads": 29, "readers_count": 28, "created": "2023-08-04T21:10:50.897Z"}, {"topic_id": 14302, "post_id": 34437, "post_number": 6, "score": 15.4, "author_username": "Gauntlet", "text": "The AIP has been deployed - AIP-288", "reads": 27, "readers_count": 26, "created": "2023-08-04T22:25:03.547Z"}], [{"topic_id": 14213, "post_id": 34161, "post_number": 2, "score": 21.8, "author_username": "ProfitMaxi", "text": "I’m talking about this stuff: https://twitter.com/defi_cheetah/status/1686460194094800896 why FraxLend’s debt was prioritized over AAVE’s debt? Because it’s mechanism, can we do it better?", "reads": 34, "readers_count": 33, "created": "2023-08-01T21:29:41.081Z"}, {"topic_id": 14213, "post_id": 34430, "post_number": 3, "score": 4.8, "author_username": "Mj5921", "text": "\n  \n    \n    \n    FraxLend risk management model Risk\n  \n  \n    Why doesn’t Aave have a similar risk management model to FraxLend, where all the parameters are triggered automatically and do not depend on slow governance procedures? If AAVE has an automated model, a bad CRV scenario will probably never be allowed. I’m trying to digest why the AAVE model is better than FRAX, and I can’t find a good reason—the less human intervention for market reactions, the better, imho.\n  \n", "reads": 24, "readers_count": 23, "created": "2023-08-04T16:24:24.953Z"}], [{"topic_id": 14398, "post_id": 34649, "post_number": 2, "score": 22.4, "author_username": "EzR3aL", "text": "Hi, i cannot really help but maybe @Gauntlet and @ChaosLabs could take a look at this and maybe propose to increase the cap on MKR on v3.", "reads": 37, "readers_count": 36, "created": "2023-08-09T14:59:09.035Z"}, {"topic_id": 14398, "post_id": 34658, "post_number": 3, "score": 37.0, "author_username": "ChaosLabs", "text": "We have posted a recommendation to increase the supply cap for MKR here - [ARFC] - Risk Stewards - Increase Supply and Borrow Cap on V3 Ethereum 08.09.2023\nShould this proposal be accepted, the new supply cap will enable the migration of this position.", "reads": 35, "readers_count": 34, "created": "2023-08-09T17:51:18.097Z"}], [{"topic_id": 14181, "post_id": 34056, "post_number": 2, "score": 25.8, "author_username": "ChaosLabs", "text": "We support the proposed update", "reads": 30, "readers_count": 29, "created": "2023-07-30T18:24:23.161Z"}, {"topic_id": 14181, "post_id": 34242, "post_number": 3, "score": 55.0, "author_username": "Gauntlet", "text": "We’ve queued up the transaction to be executed via Risk Steward.", "reads": 26, "readers_count": 25, "created": "2023-08-03T01:48:26.511Z"}, {"topic_id": 14181, "post_id": 34250, "post_number": 4, "score": 35.2, "author_username": "ChaosLabs", "text": "We’ve observed multiple withdrawals of WMATIC over the past few days, resulting in a current supply of approximately 66.69M WMATIC amounting to less than 64% of the supply cap. Considering this level of utilization, we suggest waiting with the execution of this proposal.", "reads": 27, "readers_count": 26, "created": "2023-08-03T07:55:40.516Z"}, {"topic_id": 14181, "post_id": 34426, "post_number": 5, "score": 19.8, "author_username": "Gauntlet", "text": "Given the WMATIC supply cap utilization has decreased to 61%, we have rejected the risk steward transaction. Once @ChaosLabs signs and executes the rejection, the risk steward transaction will be canceled.", "reads": 25, "readers_count": 24, "created": "2023-08-04T15:25:15.135Z"}, {"topic_id": 14181, "post_id": 34493, "post_number": 6, "score": 3.8, "author_username": "ChaosLabs", "text": "The rejection transaction has been executed. The risk steward transaction has been canceled.", "reads": 20, "readers_count": 19, "created": "2023-08-06T09:28:31.627Z"}], [{"topic_id": 14194, "post_id": 34060, "post_number": 2, "score": 45.2, "author_username": "Gauntlet", "text": "Gauntlet recommends cancelling AIP 280 due to increased CRV volatility and CRV liquidity changes recently. Currently, AIP 280 will increase the effective liquidation price for CRV from 0.37 to 0.416 for 0x7a16ff8270133f063aab6c9977183d9e72835428 .", "reads": 51, "readers_count": 50, "created": "2023-07-30T20:57:36.832Z"}, {"topic_id": 14194, "post_id": 34063, "post_number": 3, "score": 94.2, "author_username": "Gauntlet", "text": "As an update, AIP 280 has been canceled.", "reads": 46, "readers_count": 45, "created": "2023-07-30T21:57:00.761Z"}, {"topic_id": 14194, "post_id": 34106, "post_number": 4, "score": 5.8, "author_username": "marblemonkey", "text": "Why was this proposal cancelled?", "reads": 29, "readers_count": 28, "created": "2023-08-01T02:37:13.767Z"}], [{"topic_id": 13825, "post_id": 33205, "post_number": 2, "score": 135.2, "author_username": "Gauntlet", "text": "We put up the snapshot for the risk parameter updates here. Voting begins in 1 day and lasts for 3 days.", "reads": 51, "readers_count": 50, "created": "2023-07-03T22:00:32.001Z"}, {"topic_id": 13825, "post_id": 33229, "post_number": 3, "score": 1164.4, "author_username": "MarcZeller", "text": "Hello, we agree on all proposed changes but one: setting CRV LTV to zero.\nthis will hurt more than help by removing the ability of CRV holders to increase their collateralization if needed by adding more collateral.\nThe governance already stated clearly their opinion on this very topic via a previous vote, Gauntlet attempt to sneak it back in another proposal has been noted and will be remembered.\nConsequently, the ACI voted no on the snapshot and intent to vote no on a potential AIP stage.\n", "reads": 47, "readers_count": 46, "created": "2023-07-05T08:13:20.313Z"}, {"topic_id": 13825, "post_id": 33245, "post_number": 5, "score": 203.2, "author_username": "Gauntlet", "text": "Hi @MarcZeller - we have no intention to sneak anything through. As we have mentioned previously here and here, we have recommended reducing CRV LTV to 0, and wanted to give the community the opportunity to express their sentiment outside of wholly freezing CRV. We appreciate the comments on the temp check - this is exactly why we do these Snapshot votes before on-chain votes.\nIt looks like the temp check will fail, and we will take that as a definitive signal and continue to balance risk/reward with that in mind across v2. In addition, we will take this as a community preference to unbundle recommendations for assets that are considered sensitive for the community moving forward.\nIn terms of next steps - we will remove the CRV recommendation and re-run the Snapshot vote without it.", "reads": 41, "readers_count": 40, "created": "2023-07-05T14:37:57.633Z"}, {"topic_id": 13825, "post_id": 33297, "post_number": 6, "score": 36.4, "author_username": "Michigan_Blockchain", "text": "Thank you @Gauntlet and @MarcZeller for your inputs. We agree that it would be best practice to unbundle potentially contentious proposals.\nWe also have a clarifying question. Does setting LTV–>0 affect user’s ability to add collateral to improve the health of their existing loans? The formula for the health factor contains LT, not LTV. So it seems with LTV = 0, users cannot take out additional loans, but would still be able to add collateral to prevent liquidation of existing loans? In other words, LTV=0 is different from freezing and users can still increase their collateralization?", "reads": 32, "readers_count": 31, "created": "2023-07-06T23:12:01.822Z"}, {"topic_id": 13825, "post_id": 33390, "post_number": 7, "score": 440.0, "author_username": "Gauntlet", "text": "We put up the new Snapshot vote here. Voting begins in 1 day and lasts for 3 days.", "reads": 25, "readers_count": 24, "created": "2023-07-10T22:50:55.194Z"}, {"topic_id": 13825, "post_id": 33847, "post_number": 8, "score": 9.0, "author_username": "Gauntlet", "text": "The AIP has been published here.", "reads": 20, "readers_count": 19, "created": "2023-07-25T15:00:34.218Z"}], [], [{"topic_id": 13727, "post_id": 32840, "post_number": 2, "score": 17.2, "author_username": "Gauntlet", "text": "We put the snapshot up here.  Voting begins in 24 hours and lasts for 3 days.", "reads": 61, "readers_count": 60, "created": "2023-06-21T18:58:22.463Z"}, {"topic_id": 13727, "post_id": 32940, "post_number": 3, "score": 10.8, "author_username": "MarcZeller", "text": "Hello, the ARFC failed to reach quorum by a thin margin (316k out of 320k)\nThe ACI is supportive of a re-run by gauntlet. as vote was held during a summer weekend and participation was not very high.", "reads": 54, "readers_count": 53, "created": "2023-06-26T08:23:11.464Z"}, {"topic_id": 13727, "post_id": 32948, "post_number": 4, "score": 10.2, "author_username": "ChaosLabs", "text": "Currently, we don’t perceive substantial market risk associated with TUSD, making counterparty risk the primary focus of the conversation.\nIf the community decides to decrease the protocol’s TUSD exposure, we suggest implementing a freeze on the asset as a potent risk management method. This strategy can be undone by the community once there’s more clarity on recent events or a shift in risk appetite.", "reads": 51, "readers_count": 50, "created": "2023-06-26T11:27:50.580Z"}, {"topic_id": 13727, "post_id": 32963, "post_number": 5, "score": 15.2, "author_username": "Gauntlet", "text": "Given that a total of 360k votes have been cast, we will move forward with AIP to reduce LT. We also agree that a freeze is a valuable tool and will do a re-run of a Snapshot vote to get the community’s preference for freeze, given the previous holiday weekend voting.", "reads": 51, "readers_count": 50, "created": "2023-06-26T21:08:15.420Z"}, {"topic_id": 13727, "post_id": 32967, "post_number": 6, "score": 245.8, "author_username": "fumoffuXx", "text": "Hi @Gauntlet please clarify on what constitututes a quorum for Snapshot.\nMark has stated no quorum was met. As well as aave governance discord stated that quorum is met if the top vote reaches 320k.\nIf thats the case why is an AIP being prepared without meeting the requirements?\nEven if so why should snapshot be reran just to fulfill the request of a single individual who wanted a different outcome?\nI assume AAVE is fully decentralised and does not belong to any country? So can we stop assuming that everyone has to conform to special holidays in USA? We dont see any special EU holidays granted such privileges.\nBecause this is screaming centralisation and moral hazard to me", "reads": 54, "readers_count": 53, "created": "2023-06-27T03:26:36.368Z"}, {"topic_id": 13727, "post_id": 32971, "post_number": 7, "score": 30.0, "author_username": "Gauntlet", "text": "Hi @fumoffuXx There were 316k votes for option 1 (lower LT & LTV) and a total of 360k votes, which is over the 320K quorum. Ideally, option 1 would need 4K extra votes, but we aim to be proactive on risk management here with moving forward to an on-chain proposal. The community may still vote No on the AIP— that is up to the community, but at least we want to give them the chance to express their vote on-chain.", "reads": 50, "readers_count": 49, "created": "2023-06-27T08:31:15.329Z"}, {"topic_id": 13727, "post_id": 32972, "post_number": 8, "score": 20.2, "author_username": "fumoffuXx", "text": "@Gauntlet Thanks for your reply, it still does not answer my question. is there a mismatch with parties not having a common understanding of a quorum, to you its total votes above 320k to others is top vote over 320k.\nCan we specify and agree to a common quorum definition? And if no quorum is met, should the AIP move forward?\nIn addition, shouldn’t the 3rd party risk assessors be in consensus before suggesting any risk parameter modifications?\nApologies in making your life difficult but this are legit concerns.", "reads": 51, "readers_count": 50, "created": "2023-06-27T09:09:27.395Z"}, {"topic_id": 13727, "post_id": 32973, "post_number": 9, "score": 29.8, "author_username": "MarcZeller", "text": "Hello, the intention behind the ARFC and TEMP CHECK framework is to require a minimum of 320k YAE votes AND an 80k differential in favor of the proposal, not simply 320k participation. This reflects the operational mechanics of the Aave governance smart contract. Snapshots are not designed to lower the threshold for a YAE outcome; their purpose is to be inclusive, accommodating all holders irrespective of the chain they’re on and their financial capabilities. They also serve as filters to manage the volume of on-chain AIPs.\nHowever, upon reviewing the language used in various voted-upon frameworks, it’s clear that the phrasing is, at best, ambiguous. As a DAO, we should strive for more precise and robust definitions.\nIn response to this, the ACI plans to publish several proposals in the immediate future to clarify these frameworks and governance guidelines.\nUntil these new guidelines are in place, we should avoid applying them retroactively. Given the current ambiguity in definitions, Gauntlet should be granted the benefit of the doubt if they so desire. And the ACI will not oppose an escalation of this proposal.", "reads": 49, "readers_count": 48, "created": "2023-06-27T09:44:12.687Z"}, {"topic_id": 13727, "post_id": 32979, "post_number": 10, "score": 61.8, "author_username": "fumoffuXx", "text": "i would like to disagree on your logic of allowing decisions to be perform with ambiguity, this is a very slippery slope.\nthe responses does not address the consensus amongst the third party risk assessors.", "reads": 59, "readers_count": 58, "created": "2023-06-27T12:03:12.287Z"}, {"topic_id": 13727, "post_id": 32980, "post_number": 11, "score": 77.0, "author_username": "MarcZeller", "text": "\n\n\n fumoffuXx:\n\nI would like to disagree on your logic of allowing decisions to be performed with ambiguity, this is a very slippery slope.\n\n\nYour perspective is appreciated. While each jurisdiction has its unique doctrines, the general principle across many is that retroactivity is usually discouraged, and ambiguity tends to favor actors like Gauntlet in such situations. This is typically designed to prevent arbitrary decisions and the so-called “slippery slopes”.\nRegardless, the ACI has published clearer guidelines ARFC to help avoid such situations in the future.", "reads": 60, "readers_count": 59, "created": "2023-06-27T13:10:37.244Z"}, {"topic_id": 13727, "post_id": 32982, "post_number": 12, "score": 117.0, "author_username": "fumoffuXx", "text": "Alright appreciate the reply and response", "reads": 60, "readers_count": 59, "created": "2023-06-27T13:46:25.024Z"}, {"topic_id": 13727, "post_id": 32994, "post_number": 13, "score": 56.0, "author_username": "Gauntlet", "text": "We put up the snapshot for freezing TUSD here. Voting begins in 8 hours and lasts for 3 days.", "reads": 55, "readers_count": 54, "created": "2023-06-27T18:01:50.040Z"}, {"topic_id": 13727, "post_id": 33043, "post_number": 14, "score": 84.6, "author_username": "Gauntlet", "text": "As an update, as of 2023-06-28, the following 3 accounts will become liquidatable if the proposed parameter changes are implemented.\n\n\n\n\nAddress\nHealth Factor\nHealth Factor With New Parameters\nTotal Borrows (USD)\nTotal Supply (USD)\nAsset(s) Borrowed\nAsset(s) Supplied\n\n\n\n\n0x4fe27a3898f69f35806e916a410b96d88f727abb\n1.013946\n0.952495\n888.470643\n1091.952757\nUSDT, USDC, TUSD\nTUSD\n\n\n0x7c384cc444ac2ca66dd778f757242919013c1ab7\n1.036963\n0.974117\n78.398214\n98.540663\nTUSD\nTUSD\n\n\n0x994f21ad9f08e71557001c5edcc8bb44bcd00f59\n1.010672\n0.949419\n423.256861\n518.513647\nUSDT\nTUSD\n\n\n\n", "reads": 48, "readers_count": 47, "created": "2023-06-28T23:18:01.258Z"}, {"topic_id": 13727, "post_id": 33044, "post_number": 15, "score": 18.6, "author_username": "Gauntlet", "text": "The AIP for lowering TUSD LT/LTV has been published here.", "reads": 43, "readers_count": 42, "created": "2023-06-28T23:24:17.868Z"}, {"topic_id": 13727, "post_id": 33099, "post_number": 16, "score": 28.6, "author_username": "Gauntlet", "text": "As an update, as of 2023-06-30, the following 4 accounts will become liquidatable if the proposed parameter changes are implemented.\n\n\n\n\nAddress\nHealth Factor\nHealth Factor With New Parameters\nTotal Borrows (USD)\nTotal Supply (USD)\nAsset(s) Borrowed\nAsset(s) Supplied\n\n\n\n\n0x4fe27a3898f69f35806e916a410b96d88f727abb\n1.014081\n0.952622\n889.762779\n1093.687106\nUSDC, USDT, TUSD\nTUSD\n\n\n0x7c384cc444ac2ca66dd778f757242919013c1ab7\n1.036292\n0.973486\n78.573597\n98.697175\nTUSD\nTUSD\n\n\n0x8cb3e94274c27d5bcd01215edf823de49c48c56d\n1.011898\n0.961913\n99.958241\n121.307420\nTUSD\nTUSD\n\n\n0x994f21ad9f08e71557001c5edcc8bb44bcd00f59\n1.011841\n0.950518\n423.439117\n519.337199\nUSDT\nTUSD\n\n\n\n", "reads": 43, "readers_count": 42, "created": "2023-06-30T15:40:47.697Z"}, {"topic_id": 13727, "post_id": 33155, "post_number": 17, "score": 47.4, "author_username": "Gauntlet", "text": "As an update, as of 2023-07-02, the following 5 accounts will become liquidatable if the proposed parameter changes are implemented.\n\n\n\n\nAddress\nHealth Factor\nHealth Factor with New Parameters\nTotal Borrows (USD)\nTotal Supply (USD)\nAssets Borrowed\nAssets Supplied\n\n\n\n\n0x4fe27a3898f69f35806e916a410b96d88f727abb\n1.013957\n0.952505\n890.743712\n1094.758520\n[USDT, TUSD, USDC]\n[TUSD]\n\n\n0x7c384cc444ac2ca66dd778f757242919013c1ab7\n1.035471\n0.972716\n78.712877\n98.793862\n[TUSD]\n[TUSD]\n\n\n0x89426d4e36ec07738e8236acd43090dc9d1152fe\n1.045709\n0.982333\n193.052777\n244.699534\n[WETH]\n[TUSD]\n\n\n0x8cb3e94274c27d5bcd01215edf823de49c48c56d\n1.010917\n0.960972\n100.135428\n121.405653\n[TUSD]\n[TUSD, USDC]\n\n\n0x994f21ad9f08e71557001c5edcc8bb44bcd00f59\n1.012651\n0.951279\n423.514820\n519.845960\n[USDT]\n[TUSD]\n\n\n\n", "reads": 37, "readers_count": 36, "created": "2023-07-02T05:17:47.244Z"}], [{"topic_id": 13644, "post_id": 32458, "post_number": 2, "score": 392.2, "author_username": "DecentMuse", "text": "This is an interesting case to observe because it’s possible that this debt has no intention of ever being paid off, as in it may be a form of profit taking.\nConsidering that the wallet is tagged as belonging to the founder of Curve, this would be a way to take profit that:\n\nDoesn’t harm CRV market value or optics of “founder selling”\nIs more economically efficient (eg. eat slippage via debt LTV vs trying to market sell that amount)\nIs tax optimized (or delayed)\n\nDoesn’t sound like too bad of a profit taking strategy from his vantage point to be honest.\nIt’s definitely an edge-case in terms of intended product use case here, but I think this is a fair assumption of what might be going on here.  I mean he did recently purchase a $60M mansion right?\nAs much as I love Curve as core pillar of defi and liquidity, I think this is a fair risk assessment considering the available liquidity in the market and risk of eating bad debt until CRV liquidity grows deeper.", "reads": 136, "readers_count": 135, "created": "2023-06-13T05:32:30.178Z"}, {"topic_id": 13644, "post_id": 32465, "post_number": 3, "score": 255.6, "author_username": "Primoz", "text": "Hey, we have been discussing this situation a bit with @yaron from RiskDAO\nHave you also considered freezing CRV on Aave v3? There’s about a $21m isolated debt ceiling available on $33m CRV supply cap.\nWhat’s more problematic here in our opinion is that this wallet has around $110m leverage on CRV across DeFi, outside Aave there’s another $20m borrowed on Fraxlend and $20m on Abracadabra. Both positions are on 75% LTV which is quite high for such a token and Fraxlend position has the weakest health factor compared to Abra and Aave.\nAnother idea would also be to gradually decrease LT at Aave v2 in order to better protect against bad debt when and if this user gets liquidated at high slippage. Especially because there’s additional debt on CRV outside Aave with worse collateralization metrics and I think Aave doesn’t want to be liquidating this user as the last one when most of the available liquidity is gone. Of course whoever liquidates the user first will also make the price worse…\nI also don’t see many unutilized assets that could be used for repayment of debt here, most of the available assets are CRV tokens from vesting. So if the price continues to drop and freeze is enabled the user is forced to repay debt rather than make continued top-ups and make the problem worse afterwards. Best hope is the user can actually repay debt with external assets.\nGeneral leverage on CRV needs to be reduced one way or another, you can’t have a $110m leverage built on an asset that has over 10% price slippage when selling $5m on-chain. Could be that off-chain liquidity is underestimated here but I still think the ratio is not healthy.", "reads": 128, "readers_count": 127, "created": "2023-06-13T09:34:55.654Z"}, {"topic_id": 13644, "post_id": 32477, "post_number": 4, "score": 154.8, "author_username": "ghostlyenergy", "text": "A few thoughts.\n\nWe should also consider increasing the reserve factor for CRV on the Ethereum V2 market to 99.9%. This position has unhealthy characteristics, and the cost to hold this position is clearly underpriced.\nI agree that we should move LTV to 0. Anyone who wants to use CRV as collateral can move to the V3 market.\n", "reads": 124, "readers_count": 123, "created": "2023-06-13T14:38:18.107Z"}, {"topic_id": 13644, "post_id": 32479, "post_number": 5, "score": 279.0, "author_username": "Emilio", "text": "I dont think freezing the CRV asset brings any benefit in this case. Even if we prevent this actor from borrowing more, we also prevent refillings, which are in any case legitimate and wouldnt help maintaining the position in an healthy state to begin with.\nSetting the ltv to 0 in V2 is unfortunately not enforceable. The ltv 0 check can be circumvented using flashloans (this is not possible in V3).\nI don’t see any reason to freeze the asset in V3, first the exposure is not as big to begin with, second the supply caps prevents from accumulating an excessive amount of CRV collateral, third there are many levers that we can change (lower the debt ceiling, further lower the supply cap, drop the ltv to 0) that unfortunately we dont have in V2 to prevent any risk.\nThe increase of the V2 reserve factor for CRV is an interesting approach, the protocol is currently sustaining a massive risk allowing this position and it’s not being paid nearly enough.\n@gauntletnetwork a simulation of the potential bad debt risk from liquidating this position would be very helpful, do you have anything on that?", "reads": 120, "readers_count": 119, "created": "2023-06-13T15:59:16.263Z"}, {"topic_id": 13644, "post_id": 32489, "post_number": 6, "score": 108.4, "author_username": "OneTrueKirk", "text": "\n\n\n Emilio:\n\nThe ltv 0 check can be circumvented using flashloans (this is not possible in V3).\n\n\nCould you clarify this? I assume you’re not saying that LTV requirements can be entirely circumvented in Aave v2. Is there something special about the “zero” value that produces unexpected behavior, such that a low but nonzero value is needed?", "reads": 117, "readers_count": 116, "created": "2023-06-13T19:06:49.841Z"}, {"topic_id": 13644, "post_id": 32490, "post_number": 7, "score": 147.8, "author_username": "Gauntlet", "text": "To clarify, this set of recommendations is only to freeze CRV and set CRV LTV to zero on Aave V2. This proposal will not impact Aave V3.\nWe agree that setting LTV to 0 is only a minimal improvement, however, it is directionally helpful. The benefits of freezing CRV on V2 include preventing the protocol from having more exposure to CRV. The amount of CRV concentrated on Aave, relative to the circulating supply of CRV, is already high. Given the limitations of V2 mechanisms, including the possibility of circumventing an LTV of 0, the only way to truly prevent more risk of this position is to prevent borrowing of all assets on V2. Freezing CRV on V2 is just a step towards preventing more exposure to the protocol from CRV.", "reads": 114, "readers_count": 113, "created": "2023-06-13T19:19:39.202Z"}, {"topic_id": 13644, "post_id": 32496, "post_number": 8, "score": 403.8, "author_username": "ChaosLabs", "text": "While freezing the asset may prevent the situation from worsening, it doesn’t alleviate the potential risk to the protocol. We are running simulations and analyses to devise a more structured strategy moving forward, to optimize the following:\n\nGradually reducing the LT for CRV on V2 to reduce borrowing power and exposure.\nLowering the debt ceiling on V3 - this action will reduce the potential exposure throughout the protocol.\nRaising the RF for CRV on V2 - this will have a very minor impact as borrows are currently disabled on V2, and the current total borrows stand at around 36M CRV. However, it will present a more appropriate reward for the protocol, given the risk the asset presents.\n", "reads": 119, "readers_count": 118, "created": "2023-06-13T19:58:43.105Z"}, {"topic_id": 13644, "post_id": 32520, "post_number": 9, "score": 1023.0, "author_username": "MarcZeller", "text": "Thank you all for your insights and discussions on this matter. I’d like to share a few thoughts from the perspective of the Aave-Chan Initiative (ACI).\nFirstly, it’s important to remember the core ethos of DeFi, which is neutrality. The protocol should function effectively regardless of whether a pool has one large position or a thousand smaller ones with similar liquidation ranges. The intention of users or what they do with their funds is not our primary concern. Users should be free to utilize the protocol as they see fit.\nSecondly, we need to be cautious about implementing “solutions” that could potentially do more harm than good. The user in question currently has a healthy Health Factor. Artificially increasing the odds of liquidation by increasing the Reserve Factor (RF) or lowering the Liquidation Threshold (LT) may not be the most sensible approach.\nLastly, we should generally encourage the use of Aave V3 over V2. One of the reasons this large position grew in V2 was due to overly conservative CRV parameters in V3, which prevented a seamless migration. V3 has caps that allow for more granular management, which is a significant advantage.\nIn conclusion, while we should certainly monitor and manage risks, it’s crucial that we do so in a way that respects the principles of DeFi and the functionality of our protocol. In our opinion, there is not a significant need for governance to enforce any kind of action at this point.\nWe would like to clearly state that we will vote no to any rushed plan that just reacts to social media chatter.", "reads": 115, "readers_count": 114, "created": "2023-06-14T08:56:07.245Z"}, {"topic_id": 13644, "post_id": 32538, "post_number": 12, "score": 92.2, "author_username": "Jommi", "text": "Why is it an issue if a user has no intention of repaying the debt? The protocol is making money on that debt, so its great. We dont make money on repayments.\nSeems like the issue here is just V2 being an overly simplimistic and optimistic view of how a shared money market in defi should work, and misses most of the latest additions to lending protocols that would combat things like this. Large positions like this can easily be handled via stuff like:\n\nPartial liquidations\nLiquidation fee auctions\nPosition Size -based LTV penalties\n\nEven then, Aave can do a bunch of things like:\n\nLTV and util curve management\nPool migration announcements\n\nWhy do we let so much liquidity sit on ancient mechanisms?", "reads": 111, "readers_count": 110, "created": "2023-06-14T13:44:58.783Z"}, {"topic_id": 13644, "post_id": 32548, "post_number": 14, "score": 101.0, "author_username": "X38x", "text": "\n\n\n Jommi:\n\nWhy is it an issue if a user has no intention of repaying the debt? The protocol is making money on that debt, so its great. We dont make money on repayments.\n\n\nAave is making $600 per day over that position. On the other hand if the user is liquidated Aave could lose millions. No one knows for sure how much the loss would be, but $10M+ is totally possible considering the debt is $63M.\nSo not a great deal…", "reads": 105, "readers_count": 104, "created": "2023-06-14T14:46:49.052Z"}, {"topic_id": 13644, "post_id": 32552, "post_number": 16, "score": 337.0, "author_username": "sickvisionz", "text": "Altering the protocol to explicitly attack one user who has done nothing to violate any of the rules or functions of the protocols seems questionable to me.  The evidence and things that show suspect behavior are even worse.\n\nWe’ve crunched some numbers and are going to pull a literal Minority Report. They’re guilty of future crimes and will be punished today.\nWe found out that they use more protocols than Aave.\nThe address is rumored to be a Curve founder.  PS: Curve recently launched a rival product to Aave.\nThey may be getting liquidity on tokens by borrowing against them… which of course goes against the principals of a money market.\n\nThis whole thing seems crazy to me.  I could at least understand it if they were a hacker or something but we’re going after a user who hasn’t violated or exploited or abused anything.  They literally just using the platform like normal and now that’s deemed a cardinal sin, with things like “they use protocols other than Aave” or “they engage in borrowing and lending on borrowing and lending platforms” being presented as evidence of their crimes or marks against their character.\nIf we’re going after a specific user, imo there has to be some real wrongdoing going on.  It can’t be some Minority Report prediction backed up with claims that they aren’t a maxi for the protocol and that borrowing against your tokens, the entire point of Aave, is now like unethical or something.", "reads": 110, "readers_count": 109, "created": "2023-06-14T15:28:28.509Z"}, {"topic_id": 13644, "post_id": 32557, "post_number": 17, "score": 70.8, "author_username": "pray.eth", "text": "\n\n\n AaveBull:\n\nThe ‘user’ has NO intention of repaying over $60m of debt (on AAVE alone) that YOUR OWN users have supplied the protocol with. These are users to whom you and other large governance voters have a duty towards. For the avoidance of any doubt, this position is essentially the FOUNDER telling you that he is ecstatic to lose 45% of his collateral’s value as priced by the market as recently as last week (latest deposit).\n\n\nYou have no idea whether he intends to repay the loan.  He may be ecstatic to lose 45% of his collateral’s value, as you noted.  But on the other hand, he may believe CRV is massively undervalued, and hence would rather borrow against his CRV holdings than sell at these ridiculously low prices.  We just don’t know. What we do know is his health factor at this point is totally fine.", "reads": 104, "readers_count": 103, "created": "2023-06-14T16:42:55.098Z"}, {"topic_id": 13644, "post_id": 32563, "post_number": 18, "score": 80.0, "author_username": "X38x", "text": "@pray.eth I agree when you say that we have no idea whether he actually intends to repay his debt or not, but I completely disagree when they say that this is fine because the health factor is high enough.\nThe health factor doesn’t take in consideration the market liquidity. Actually, the health factor is just a number that is the result of the Value of the Collateral divided by the Value of the Debt and multiplied by the Liquidation Threshold, which is an arbitrary number.\nThe fact that health factor > 1 doesn’t mean that a position is safe, especially when we’re talking about positions this big. It is very disingenuous for the Aave-Chan Initiative (ACI) to say the opposite without considering that the user is using 50% of the asset circulating supply as collateral. I understand that they’re doing this because they don’t want to create panic in the market, but at the same time this is putting Aave holders and Aave lenders at risk.\nAnd by the way, this is the exact reason why debt ceilings were introduced in V3. To say that this is fine is very disingenuous…", "reads": 100, "readers_count": 99, "created": "2023-06-14T17:04:34.774Z"}, {"topic_id": 13644, "post_id": 32568, "post_number": 21, "score": 85.2, "author_username": "pray.eth", "text": "Not sure why you need to call others “braindead” or “simpletons,” this kind of language simply discourages debate. Be better.\nHasn’t this user been adding collateral to his position and/or repaying part of his loan (in USDT)?  This doesn’t seem like the actions of someone looking to walk away from his debt obligations.  On the contrary, it seems like someone trying to properly manage his loan to avoid liquidation.", "reads": 101, "readers_count": 100, "created": "2023-06-14T17:19:22.415Z"}, {"topic_id": 13644, "post_id": 32575, "post_number": 24, "score": 200.4, "author_username": "DecentMuse", "text": "I think @MarcZeller raises some great points:\n\nOne one hand, this could possibly cause the liquidation by not allowing more CRV to top up position\n\nOn the other hand, this allows risk to balloon\n\n\nPerhaps the position will never reach liquidation point.  CRV does have great demand drivers as any project or protocol seeking a peg/liquidity strategy should be incorporating a Curve strategy.\n\nI think the comments about this being about ‘competition’ are misguided.  There is a legitimate risk of bad debt, should liquidation occur.  Hopefully it won’t and there’s probably no direct ill intent here, but wise to consider the possibility of both outcomes as this indirectly becomes a bet on CRV price.\nThis is a delicate situation as Marc points out that the users are free to do as they wish, this is defi after all, and it would be weird to target an individual.  However, this is also using the product in a way that probably wasn’t intended, at least in this specific edge case where a user does have access to a large % of collateral in a not super liquid market.\nProbably worth opening a conversation with Michael and seeing what his plans are.", "reads": 102, "readers_count": 101, "created": "2023-06-14T17:29:47.966Z"}, {"topic_id": 13644, "post_id": 32580, "post_number": 25, "score": 219.4, "author_username": "MarcZeller", "text": "every opinion on this forum are welcome, but not every way to express them are.\nfor those reading this, feel free to consult FAQ/Guidelines\nModeration has been and will be applied.", "reads": 97, "readers_count": 96, "created": "2023-06-14T18:29:45.268Z"}, {"topic_id": 13644, "post_id": 32595, "post_number": 27, "score": 29.4, "author_username": "Gauntlet", "text": "As an update, the AIP has been published here.", "reads": 97, "readers_count": 96, "created": "2023-06-14T23:33:17.213Z"}, {"topic_id": 13644, "post_id": 32596, "post_number": 28, "score": 29.8, "author_username": "bellonoff", "text": "@Gauntlet Are you looking at making proposals on any other tokens to avoid the risk of a similar collateral build up in V2 vs V3?", "reads": 99, "readers_count": 98, "created": "2023-06-14T23:49:34.954Z"}, {"topic_id": 13644, "post_id": 32612, "post_number": 29, "score": 119.6, "author_username": "ChaosLabs", "text": "We have started a discussion on other V2 assets on the thread here.\nGiven that CRV presents a distinct risk profile, it necessitates a unique approach and set of recommendations which we will present shortly.", "reads": 98, "readers_count": 97, "created": "2023-06-15T00:57:10.556Z"}, {"topic_id": 13644, "post_id": 32620, "post_number": 30, "score": 147.0, "author_username": "eboado", "text": "My opinion on the topic:\n\nThe exposure of Aave v2 Ethereum to CRV is too big, there should not be much doubt about it.\nThere is not much reason to think that the big position of CRV is trying to execute anything against Aave. It is from a long-term user, who historically has been actively maintaining his collateralization. Even these days, checking on-chain activity is clear that he is trying to de-risk positions.\nAdditionally, Curve is a pretty active project, with a big ecosystem around. It is not something measurable but sounds ridiculous for its founder (with huge exposure to it) to look for a liquidation.\nMarket is how it is at the moment, and still, the HF is at acceptable levels. Obviously, the sheer size of the position is what creates the risk, but only looking at that is simplistic.\nTalking about how risk should have been controlled before, calling out some mechanisms of Aave v2 gives close to zero value. That is a conversation to have in parallel, but the effort now should be simply de-risking if desirable.\n\nRegarding the proposed actions (and submitted AIP from @Gauntlet):\n\n\nFreezing CRV on v2. The exposure to CRV collateral is too high on Aave v2, that is clear. But there is not really any mechanism to reduce (fast) that without a debt ceiling.\nLet’s assume the CRV position goes close to liquidation. At that point, the user can mobilize non-CRV funds to repay or refill CRV. Considering the current size of CRV in his positions, seems remote he has a meaningful % of it available to refill. That means that the additional exposure from that potential refilling will not really change much negatively to Aave, but can make a bit of difference in the user protecting his position.\nBut if CRV gets frozen, he will not be able to refill.\nSo AGAINST freezing.\n\n\nLTV to 0 on Aave v2. LTV is a soft protection on Aave v2, with only Liquidation Threshold affecting Health Factor and influencing on the liquidation price. Changing LTV to 0 will disable new borrowings by average users, but doesn’t really change anything at the core.\nFundamentally, feels just correct for CRV to not have additional borrowings associated, but in my opinion, makes not much difference.\nSo ABSTAIN on LTV 0.\n\n", "reads": 110, "readers_count": 109, "created": "2023-06-15T07:50:45.983Z"}, {"topic_id": 13644, "post_id": 32629, "post_number": 31, "score": 666.8, "author_username": "ChaosLabs", "text": "\nSummary\nThe freezing of this market is a train that left the station over 12 months ago. The top CRV account holds a massive position in a market starved of liquidity. If we agree that we’re already knee-deep in exposure, a freeze at this stage is more of a token gesture than an effective strategy. It would only serve to handcuff an account that has historically shown sound management, hindering its ability to top up. Instead of cosmetic measures, we should zero in on impactful solutions involving additional LT reductions and increasing the RF with regard to CRV and broader V2 markets.\n\nAnalysis\nIn the context of the V2 framework, the scarcity of risk levers considerably narrows our operational capabilities. While freezing can offer some advantages, it concurrently presents potential obstacles. The upside is clear - freezing limits additional CRV risk exposure. However, a freeze could unintentionally trigger heightened levels of FUD, exacerbating the concern already sparked by this post and potentially accelerating a CRV depreciation. Following a freeze, account holders are precluded from topping up, and given the prevailing sparse market liquidity, the trajectory toward bad debt could be alarmingly precipitous.\nIt’s worth noting that CRV’s total supply has exceeded $100 million in markets with declining liquidity for over a year.\n\n354473450_1426877081408252_863655571873176780_n (1)2048×1280 46.3 KB\n\n$CRV supplied to Aave has posed an asymmetrically large risk for at least the past 12 months.\n\n354054756_281517187668777_5781164131001018686_n (1)2048×1299 30.1 KB\n\nThe opportune moment to propose a freeze was in the past. As of now, we’re applying a superficial solution to a much deeper issue. Our simulations show potential bad debt amounting to tens of millions, given the unprofitability of liquidations due to insufficient liquidity. Although capping the exposure seems appealing now, it fails to address the core issue.\nHistorical analysis of the top position shows that the user has been active and has been protecting their wallet health over time.\n\nFreezing the market would block the user from doing so. Furthermore, we must acknowledge that a freeze, immobilizing large CRV positions, could incite significant market turbulence. In this regard, a new economic attack vector has surfaced, potentially creating a vulnerability for a speculative attack on the CRV token. Speculators recognizing this potential setup, particularly if well capitalized, are likely evaluating the risk-reward characteristics of mounting an Avi-style attack.  For stakeholders who maintain a long-term bullish stance on CRV and aim to maximize accumulation, this scenario, where the price could depreciate rapidly, presents an opportunity to repurchase at a considerable markdown; thus, such investors can be very patient in their accumulation plans due to the current unfolding series of events.\n\nConclusion\nAs reiterated throughout this discussion, the implementation of a freeze is a severe measure and should be reserved for scenarios where it has the potential to enact material impact. In the case of CRV, Aave has been in a state of overexposure for over a year, and the right time for a freeze was then. Although not fiercely against a freeze, at this moment in time, its impact will be negligible and potentially very counterproductive. The market is highly volatile, and the top account holder has consistently demonstrated active risk management and maintenance of their position’s health. Regarding CRV, given V2’s high vulnerability to market volatility, we advocate against freezing, especially given the top accounts’ history of active risk management. We will be following up shortly with an ARFC to reduce CRV LTs.", "reads": 109, "readers_count": 108, "created": "2023-06-15T13:01:40.799Z"}, {"topic_id": 13644, "post_id": 32631, "post_number": 32, "score": 78.0, "author_username": "X38x", "text": "Although I’m not against freezing the CRV market, I agree with @ChaosLabs: freezing won’t have too much of a positive impact. It’s too late, the risk is already there and freezing won’t fix it.\nThe obvious way forward is reducing CRV LTs:\n\nit will increase the ratio between the collateral and the debt;\nit is the only way Aave can force the debt repayment.\n", "reads": 90, "readers_count": 89, "created": "2023-06-15T13:15:27.344Z"}, {"topic_id": 13644, "post_id": 32638, "post_number": 33, "score": 117.6, "author_username": "Zer0dot", "text": "Thank you to @Gauntlet and co for bringing this discussion up!\nHere are my thoughts.\nFreezing the market, as far as my understanding goes, would only prevent the user from adding to his CRV position. Why would we do that?\nThe main, real in my opinion, risk is the severe lack of liquidity CRV has, as outlined by folks in this thread. Whether it’s 1 or 1000 positions, CRV is too risky on V2 right now.\nIf we want to reduce exposure, we should do so cautiously and wisely.\nV2 in and of itself is outdated, and we should push users to migrate to V3, where there are a lot more risk controls. Not all positions can be migrated since V3 has an isolated debt ceiling of ~20MM, but I think proper risk management is worth the potential loss in TVL.\nOff the top of my head, and to encourage V2 → V3 migration anyway, why don’t we just raise rates and RF? Keep supply rates low, and borrow rates high. We could do so over multiple proposals, gradually over time if needed. Make leaving V2 a no-brainer, but let’s not shoot ourselves in the foot by rushing into it.\n\nProposal\nThere are much more well-equipped people here to figure out if this is a good idea (and the exact numbers), but I propose to gradually raise rates and reserve factors on major stablecoins in V2.\nThis way, users are incentivized to leave V2.\nThis will cause a net decrease in protocol-wide TVL, but a net increase in V3 TVL-- resulting in less need to constantly worry about the outdated V2.", "reads": 88, "readers_count": 87, "created": "2023-06-15T16:10:56.327Z"}, {"topic_id": 13644, "post_id": 32641, "post_number": 34, "score": 46.6, "author_username": "ChaosLabs", "text": "@Zer0dot this is one of the actions we’ve proposed and intend to pursue further through an ARFC\n\n\n\n ChaosLabs:\n\nInstead of cosmetic measures, we should zero in on impactful solutions involving additional LT reductions and increasing the RF with regard to CRV and broader V2 markets.\n\n\nFurthermore, we have put forward a proposal to lower the LT and LTV for CRV on V2 Ethereum, which can be found here.", "reads": 83, "readers_count": 82, "created": "2023-06-15T16:49:00.694Z"}, {"topic_id": 13644, "post_id": 32642, "post_number": 35, "score": 47.4, "author_username": "BlockEnthusiast", "text": "Don’t think looking at asks today is representative of the speculative demand in the event of a large squeeze. I do think its being underestimated.\nIf we look at the past for guidance we can see during the Avi situation that the attack triggered a massive increase in volume, far more than the price crash earlier in the month.\nFigure 1\n\nPrior to actual liquidation, mostly covering the large price drop which triggered Michael to deposit more CRV (this includes only DEX volume)\nFigure 2\n\nLess granular (day instead of hour), but extends through liquidation event (only dex volume)\nFigure 3\n\nbreaks down where liquidators sourced CRV\n(images taken from an article I wrote on the Avi events found here)\nIf we look at Figure 3, we can see that ~35% of CRV used in liquidations was sourced from new debt. Likewise we can expect a lot of recycled CRV generating new debt to handle the liquidation in this instance. While there is less borrower power in this direction, there is a much larger collateral buffer to protect the protocol from bad debt.\nLooking at figures 1 and 2, we can see that looking at bid and ask activity during minimal volatility is much less than during periods of high volatility. An even bigger difference in speculative demand exists during periods of publicly followed liquidations.\nI expect that off chain and on chain interest is being sufficiently underestimated, as it was during the last event.", "reads": 87, "readers_count": 86, "created": "2023-06-15T17:06:44.178Z"}, {"topic_id": 13644, "post_id": 32643, "post_number": 36, "score": 66.2, "author_username": "BlockEnthusiast", "text": "I agree the better focus should be to encourage migrating loans from v2 to v3.\nA migration of this kind would naturally increase the cost to borrow on v2 and soft push repayment or migration of the risky position, while allowing more collateral to be deposited if desired to reduce the likelihood of liquidation.", "reads": 81, "readers_count": 80, "created": "2023-06-15T17:09:50.049Z"}, {"topic_id": 13644, "post_id": 32653, "post_number": 37, "score": 111.6, "author_username": "Pierandrea", "text": "Hello everyone, I wanted to share a dashboard I created using Flipside to monitor the current status of Michael’s position. You can access it here: CRV - A possible liquidity Crunch? | Pierandrea | Flipside\nThis situation serves as an interesting example of the ongoing need to learn and update our DeFi products. While isolating to Aave v3 may help mitigate the risk, it does not provide a comprehensive solution for potential future scenarios like this. To prevent such issues, active monitoring of collateral liquidity (and decentralization of LPs) on decentralized exchanges should be implemented.\nKudos to Gauntlet for their remarkable work!", "reads": 83, "readers_count": 82, "created": "2023-06-15T22:29:31.507Z"}, {"topic_id": 13644, "post_id": 32681, "post_number": 38, "score": 191.6, "author_username": "0xkeyrock.eth", "text": "We’re not supportive of this action to freeze the asset as this is not how DeFi works. We agree that it worth paying attention to wallets at risk as general practice but are in line with the comments made by @MarcZeller and @ChaosLabs. As @ChaosLabs mentioned if there was a consensus to do a freeze, that should have been done long ago.\nThe position is still relatively healthy and we can see on-chain how actively managed it is.", "reads": 83, "readers_count": 82, "created": "2023-06-16T11:53:30.663Z"}, {"topic_id": 13644, "post_id": 32686, "post_number": 39, "score": 328.6, "author_username": "santinomics", "text": "\n\n\n Zer0dot:\n\nOff the top of my head, and to encourage V2 → V3 migration anyway, why don’t we just raise rates and RF? Keep supply rates low, and borrow rates high. We could do so over multiple proposals, gradually over time if needed. Make leaving V2 a no-brainer, but let’s not shoot ourselves in the foot by rushing into it.\n\n\n\n\n\n BlockEnthusiast:\n\nI agree the better focus should be to encourage migrating loans from v2 to v3.\nA migration of this kind would naturally increase the cost to borrow on v2 and soft push repayment or migration of the risky position, while allowing more collateral to be deposited if desired to reduce the likelihood of liquidation.\n\n\nProbably a bit off topic but it’s important to avoid assuming that changing parameters in Aave v2 will automatically result in a seamless migration to v3. Users have the freedom to close their positions and withdraw their funds from the protocol. It’s crucial to consider alternative options provided by other protocols, as well as the possibility of closing positions to reduce risk.\nThis discussion surrounding migration strategies is not exclusive to Aave, but also extends to other platforms like Compound, which is also undergoing a migration from v2 to v3. Given the complexities involved, it is advisable to adopt a phased and well-thought-out approach when implementing any changes. Careful consideration should be given to ensure a smooth transition and minimize potential disruptions for users.", "reads": 93, "readers_count": 92, "created": "2023-06-16T15:45:36.054Z"}, {"topic_id": 13644, "post_id": 32797, "post_number": 41, "score": 2162.4, "author_username": "Gauntlet", "text": "The AIP has not passed. In light of this, we thought it would be helpful to provide more clarity on the rationale for freezing CRV.\nWhy does Gauntlet recommend freezing CRV on Aave v2?\nFreezing prevents the continued excessive buildup of CRV, preventing further concentration. We don’t know how much CRV the user has on the backend that he can add to add this concentration.\n\n\nThe tradeoff is that user cannot use CRV to protect their position should it become liquidatable.\n\nThis is the point - freezing compels the user to either provide additional collateral or repay their debts. There is speculation that the user may be unable to access funds to repay their USDT debt, but this cannot be measured. It’s important to note that the user has already started repaying a portion of their debt since the proposal was introduced.\n\n\n\nUnfrozen CRV incentivizes the user to protect their position by depositing CRV, which will add further concentration risk, rather than repaying their debt.\n\n\nWe cannot predict how liquidity and market conditions will evolve in the future, so we cannot assign a probability to this. Consequently, adding more CRV to this position will increase future risk. We want to avoid a situation where the position has a higher amount of CRV as collateral and the liquidity of CRV has further decreased, making it harder to remove the position.\n\nWhy do increases in CRV collateral add additional risk?\n\n\nIncreases in CRV collateral add insolvency risk linearly with respect to the marginal increase in CRV position, which can be superproportional with respect to the original position. In other words, increasing the CRV position by x% can increase insolvencies by MORE THAN x%.\n\n\nGiven the user’s current position, suppose there was an initial CRV price drop that forces the user to adjust their positions, and the user needs to either repay USDT debt or refill CRV collateral to maintain a “safe” HF. For example - suppose the user’s target HF is 1.6, and CRV drops 16%. That means the user’s HF has dropped to 1.4 (supply 288m CRV, borrow 62m USDT, CRV price $0.62, current data as of 2023/06/16 23:30 UTC). This implies the user either needs to repay 7.7m USDT or deposit 41m CRV to return the HF to 1.6. The following heat map shows the relationship of increased insolvencies between adding CRV collateral vs repaying USDT debt when HF is held constant, to the CRV price drop and the amount of additional CRV added.\n\n\n\nLet the initial drop be drop_init (the above example is 16%). Then the user’s default insolvencies, assuming liquidations occur after the price has stabilized after a big drop of x%, are\n\n\n\nThe user’s insolvencies after repaying are\n\n\n\nThis implies that the insolvency is linear with respect to how much CRV we refill, and by how much CRV price drops by\n\n\nThe user’s insolvencies after refilling with CRV are the same as the user’s default insolvencies since USD balances remain the same.\n\n\nTherefore, refilling relative to repaying debt can increase final insolvencies by 1/(1-drop_init) - 1, which is the same as the CRV refill amount.\n\n\n\n\nLiquidations will mostly occur once the price has stabilized, if the stabilized price is lower than -70%, liquidations will drive the account towards realized insolvency. HF is currently 1.7, and currently, CRV needs to decrease by 40% to trigger liquidations and 70% to trigger insolvencies. Our simulations show that there is current liquidity levels can only support ~$6m in liquidation as CRV decreases in price. Drawing parallels to USDC depeg, liquidity deteriorates as CRV price drops, thresholding liquidation volume. Only when the price stabilizes and begins to trend flat does liquidation volume increase.\n\nAs a result, final_price(CRV) stabilizes at a price less than the min_price_no_insolvency(CRV), any liquidation will continue to drive the HF downwards. Moreover, if increased CRV supply from refills can continue to exert downward pressure on the stabilized CRV price, so the more CRV refill/supply, the lower the effective liquidation price could be and the greater the harm to the user HF.\nTo illustrate the potential speed of liquidations, during the previous CRV incident on 2022-11-22, 50m of CRV debt was repaid in 1 hr of time as CRV went from 0.61 to 0.71.\n\n\n\nThe user has the capacity to greatly increase their CRV position. For context, the user’s CRV position has doubled over the past half year. The user has roughly 150m CRV on other lending platforms, and 60m CRV unlock in the next year, which means he has the capacity to potentially increase their Aave v2 position by almost 70%.\n\n\n\n\nOn preventing borrow from increasing\n\nThis was our intention behind setting LTV to 0, and we look forward to improvements across Aave v2 to make that check more rigorous and non-circumventable. As we previously discussed, managing the user’s position requires addressing both sides of the problem. This involves preventing further supply growth and restricting the user from borrowing more in order to minimize risk.\n\n\nOn freezing being too extreme\n\nThis is the philosophical problem of DeFi - Gauntlet is looking to absolutely minimize bad debt on Aave that can result from market risk. At times, the best course of action is to intervene in a fairly extreme manner, similar to our pause suggestions during the USDC depeg. As DeFi gets more developed, we look forward to new automated, algorithmic mechanisms that serve as killswitches to stop normal behavior in abnormal events.\n", "reads": 87, "readers_count": 86, "created": "2023-06-20T16:16:25.794Z"}], [], [{"topic_id": 13147, "post_id": 31187, "post_number": 2, "score": 13.8, "author_username": "MarcZeller", "text": "Hello @IncentiveLord and thanks for publishing a proposal.\n\n\nARC process has been deprecated, is this proposal a temp check or a ARFC? following governance guidelines a TEMP CHECK for offboarding would be more fit.\n\n\nAave is a decentralized & permissionless protocol, an offboarding can’t happen overnight as the protocol can’t (and thxfully) touch user positions, are you advocating for a freeze that will remove the capabilities to have any additional deposits & borrows of this asset? followed by a offboarding plan making deposit unattractive via modified risk parameters and reserveFactor?\n\n\nMAI is present since a long time on Polygon market, are you targeting MAI in general or only MAI on Arb & optimism?\n\n\nThe ACI is not in favor of this proposal as we’re supportive of stablecoin diversity and do not consider MAI as a particularly risky asset for the protocol. but if this proposal reach support on TEMP CHECK snapshot stage, we will assist with ARFC & AIP stage following our policy to support aave governance.\n\n\nDisclaimer: I own QI & vQI representing a small portion of my portfolio.", "reads": 44, "readers_count": 43, "created": "2023-05-20T13:59:03.300Z"}, {"topic_id": 13147, "post_id": 31188, "post_number": 3, "score": 18.4, "author_username": "IncentiveLord", "text": "Thanks @MarcZeller for the reply.\n\n\nThis is one of my first governance contributions. Will check now.\n\n\nYes, freeze followed by offboarding.\n\n\nThough Polygon has a higher security assumption at 3 of 5 multi-sig, I will update the proposal to include Polygon as well.\n\n", "reads": 42, "readers_count": 41, "created": "2023-05-20T14:04:53.161Z"}, {"topic_id": 13147, "post_id": 31189, "post_number": 4, "score": 39.2, "author_username": "IncentiveLord", "text": "Here’s the updated temp check.\n\nSimple Summary[Updated Proposal]\nA proposal to freeze MAI from Aave over centralisation risks.\n\nMotivation\nThe objective of this proposal is to improve the quality of decentralised collateral on Aave by freezing MAI, even from the isolation mode.\n\nBelow is the explanation and the data for the same:\nAs per this ARFC, MAI is a decentralized stablecoin minted by the Qidao Protocol. However, MAI seems to be controlled by a 2 of 4 multi-sig on Optimism and Arbitrum, and 3 of 5 multising on Polygon. Completely in the control of the team.\n\nSpecification\nLooking at MAI contract, it can be minted by OnlyOwner here:\n\nand, the owner is a multi-sig\n\nwhich is controlled by these four addresses, under the 2 of 4 scheme\n\nOut of these four addresses, only one of them seems to be publicly admitted DAO address.\n\nPotential Loss\nAt combined debt ceiling of $7.1mil on Optimism, Arbitrum, Avalanche and Polygon – under the hands of only 2 signers – this presents a big risk to the DAO.\nIf these two actors do not act in the best interests of the DAO, Aave can lose upto $7.1mil.\n\nDisclaimer\nI am not associated to QiDAO or any other competing DAO. I am doing this to add value to the community.\n\nNext Steps\n\nDiscuss over possible flaws in the proposal.\nDiscuss other ways to mitigate this risk.\nDevelop a long term strategy to prevent this in the future.\n\n\nEdits\n\nChanged from ARC to Temp Check\nChanged Remove to Freeze\n", "reads": 46, "readers_count": 45, "created": "2023-05-20T14:18:25.183Z"}, {"topic_id": 13147, "post_id": 31217, "post_number": 5, "score": 108.2, "author_username": "Benjamin918", "text": "Hey, thank you for the feedback.\nWhile I don’t agree with your proposal, I think that your concerns are valid and merit action from QiDao. We should post a proposal on QiDao’s governance forum to address these issues.\nFrom reading your proposal, the main perceived issue is the ownership of contracts by a multisig of a few internal members of QiDao’s community.\nI’ve spoken to many active members of Aave’s governance community in order to arrive at a solution that best addresses the concerns you’ve mentioned. The general consensus is that QiDao should make certain changes, such as moving to a system similar to Aave Guardians. This of course needs to go through the proper governance process at QiDao. We should see a proposal posted on the QiDao forum sometime this week.\nIf you have any other feedback for QiDao, I would encourage you to visit the governance forum on QiDao’s Discord. Community members often propose ideas for governance approval and it’s a great way to improve the protocol collectively.", "reads": 41, "readers_count": 40, "created": "2023-05-21T19:20:48.756Z"}, {"topic_id": 13147, "post_id": 31237, "post_number": 6, "score": 76.8, "author_username": "Benjamin918", "text": "Following up on this, the proposal has been posted on QiDao’s governance forum: https://twitter.com/Benjamin918_/status/1660590473583493120?s=20", "reads": 34, "readers_count": 33, "created": "2023-05-22T10:20:52.833Z"}, {"topic_id": 13147, "post_id": 31242, "post_number": 7, "score": 7.0, "author_username": "ChainSentinel", "text": "I begrudgingly agree. I was just looking at the implementation of QiStablecoin on Polygon, which is the same token listed as MAI on Aave’s polygon deployment. (0xa3fa99a148fa48d14ed51d610c367c61876997f1)\nThe contract has a burn function, shown below:\n    function burn(address account, uint256 amount) external onlyOwner() {\n        _burn(account, amount);\n    }\n\nThe owner of this contract is a Multisig (0x3FEACf904b152b1880bDE8BF04aC9Eb636fEE4d8), which is a 3/5 multisig. This should not be acceptable.", "reads": 35, "readers_count": 34, "created": "2023-05-22T12:23:55.884Z"}, {"topic_id": 13147, "post_id": 32007, "post_number": 8, "score": 386.0, "author_username": "tuanyuan2008", "text": "\nSummary\nQiDao, owner of MAI Finance, is adopting QiDao Guardians, synonymous to Aave’s own Guardians. Per the Aave docs, the Guardians represent a 6/10 multisig and hold responsibilities allowing them to intervene during times of crisis in order to protect the protocol.\nBoth QiDao Guardians and Aave Guardians have similar roles:\n\nGuarding the respective protocol against possible governance takeovers by having a veto power on any deemed malicious AIP.\nActing as failsafe emergency actors, if needed.\n\nHowever, QiDao Guardians have additional duties:\n\nManaging the minting and burning of MAI to regulate debt ceilings for collateral vaults.\nOverseeing bridge diversification allocations for both MAI and QI.\n\nFurthermore, they are expected to actively engage in multisig operations, staying alert, responsive, and prompt in action when necessary; and uphold the protocol’s best interest, promptly revealing any potential conflicts of interest.\nBased on QIP197, although a Snapshot hasn’t been established yet, the following timeline is suggested:\n\nActivation of the QiDao Guardians: May 31st, 2023\nAddition of the Timelock to the multisig: June 15th, 2023\n\nQiDao currently utilizes a 2/4 MultiSig on Optimism and Arbitrum, and a 3/5 MultiSig on Polygon. The proposed changes aim to address the existing situation where QiDao members alone could manipulate the supply and distribution of MAI. The new setup would require 4 of 6 members to pass emergency actions, including minting and burning MAI. The six delegates are composed of two QiDao team members and one QiDao community member:\n\nMarc Zeller from Aave Chan Initiative\nHamzah Khan from Polygon Labs\nWeso from Beefy Finance\n0xNacho from QiDao Community\nBenjamin.lens from QiDao Protocol\nPablo the Penguin from QiDao Protocol\n\n\nMarket Risk Overview\nFrom a market risk standpoint, Gauntlet has recommended the removal of MAI from the Stablecoins eMode category across all chains. An analysis of user positions reveals that few complex positions are collateralized by MAI (added to Optimism and Arbitrum ~2 weeks ago):\n\nOn Optimism, only $105 of MAI is supplied, and $27 is borrowed.\nOn Arbitrum, only $469 of MAI is supplied, and $345 is borrowed.\nRoughly half of Polygon users merely supply miMATIC to generate interest, while the other half borrows various volatile assets.\n\n\nimage3368×870 130 KB\n\nHence, it does not seem that MAI is being utilized by users in the same capacity or with the same diversity as other stablecoins, such as USDC or DAI.", "reads": 30, "readers_count": 29, "created": "2023-06-02T16:50:27.560Z"}, {"topic_id": 13147, "post_id": 32346, "post_number": 9, "score": 129.8, "author_username": "Benjamin918", "text": "MAI actually has very healthy usage on the chains where it has been onboarded. On Polygon, for example, utilization is at 42%. This is a higher utilization than most borrowable assets on Polygon.\nIt should be noted that both Arbitrum and Optimism markets only started recently, and without e-mode. that has contributed to low usage. As a result, it’s too premature to judge those markets.", "reads": 24, "readers_count": 23, "created": "2023-06-08T11:33:11.770Z"}, {"topic_id": 13147, "post_id": 32347, "post_number": 10, "score": 19.6, "author_username": "Benjamin918", "text": "Following up on the e-mode consideration, MAI has one of the lowest standard volatilities in the stablecoin market. As a result, I would say that it’s a great candidate for e-mode.\nIn Q1 of 2023, MAI saw lower volatility than most decentralized stablecoins (source).\n", "reads": 23, "readers_count": 22, "created": "2023-06-08T11:38:00.051Z"}], [{"topic_id": 13095, "post_id": 31094, "post_number": 2, "score": 37.2, "author_username": "ChaosLabs", "text": "Chaos Labs supports the proposed supply and borrow cap increases in this proposal.\nUtilizing our supply cap methodology, we conducted stress tests encompassing both moderate and severe scenarios.\nFor the moderate stress scenario, we employed the price trajectory of MATIC during the LUNA crash, while for the severe stress scenario, we utilized the price trajectory of LUNA.\nOutlined below are the results of the simulations.\nIn the moderate case, no additional simulated protocol loss is observed,\n\nIn the severe case, the simulated protocol losses amount to ~$80K.\n\n346090512_4438349173046539_3406094080032583133_n2154×1676 54.5 KB\n", "reads": 36, "readers_count": 35, "created": "2023-05-17T21:23:38.569Z"}, {"topic_id": 13095, "post_id": 31122, "post_number": 3, "score": 6.6, "author_username": "Llamaxyz", "text": "Hi Everyone \nA brief update here, Llama will be submitting the payload to @bgdlabs for peer review shortly. The proposal will be submitted for voting upon completion of the review.", "reads": 33, "readers_count": 32, "created": "2023-05-18T17:36:40.656Z"}, {"topic_id": 13095, "post_id": 31163, "post_number": 4, "score": 15.6, "author_username": "tuanyuan2008", "text": "Per Gauntlet’s Borrow and Supply Cap Methodology, we support the supply cap increase to 90M and and borrow cap increase to 50M for wMATIC on Polygon v3.", "reads": 28, "readers_count": 27, "created": "2023-05-19T21:11:58.589Z"}, {"topic_id": 13095, "post_id": 31168, "post_number": 5, "score": 5.2, "author_username": "Saludiego201", "text": "I see it prudent to increase the loan supply for Matic, I support this proposal.", "reads": 26, "readers_count": 25, "created": "2023-05-20T01:40:11.354Z"}, {"topic_id": 13095, "post_id": 31472, "post_number": 6, "score": 3.2, "author_username": "Llamaxyz", "text": "Hi All,\nThis proposal has passed the AIP vote:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - wMATIC Supply & Borrow Cap Increase Polygon v3\n\n  Increase Supply & Borrow Cap wMATIC on Polygon v3\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nAnd the Supply Cap is quickly filling \n", "reads": 16, "readers_count": 15, "created": "2023-05-29T10:23:05.122Z"}], [{"topic_id": 13039, "post_id": 30856, "post_number": 2, "score": 54.4, "author_username": "ChaosLabs", "text": "Thanks for putting forward this proposal @seawolf.\nPlease note there is already a proposal in place to increase the supply cap for WBTC on V3 Polygon - [ARFC] Chaos Labs Supply and Borrow Cap Updates - 04.21.2023 . This proposal has already passed but whas canceled due to the withdrawal of our prop power. We are working on resubmitting the AIP shortly.\nAdditionaly, it is important to clear up some discrepancies in the post to ensure accuracy and clarity:\n\nThe current CAP for WBTC in the table is incorrect, showing 1,170 (the current supply) instead of 1,548 (the current cap).\nThe recommendation for WBTC refers to the supply cap despite the table header indicating “borrow cap.” This is probably a typo but should be corrected to avoid any ongoing confusion.\n", "reads": 22, "readers_count": 21, "created": "2023-05-10T08:32:38.755Z"}, {"topic_id": 13039, "post_id": 30862, "post_number": 3, "score": 24.2, "author_username": "seawolf", "text": "@ChaosLabs Thanks for the clarification on the WBTC supply cap proposal  [ARFC] Chaos Labs Supply and Borrow Cap Updates - 04.21.2023. Since the proposal has passed, we are removing WBTC recommendation from this proposal.", "reads": 21, "readers_count": 20, "created": "2023-05-10T14:25:24.304Z"}, {"topic_id": 13039, "post_id": 30872, "post_number": 4, "score": 4.2, "author_username": "seawolf", "text": "Given the fast-track process for cap changes, we will not publish a Snapshot vote, but rather move directly to AIP on Monday, 5/15.", "reads": 21, "readers_count": 20, "created": "2023-05-10T20:51:01.339Z"}, {"topic_id": 13039, "post_id": 31021, "post_number": 5, "score": 13.8, "author_username": "seawolf", "text": "As an update, the AIP has been published.", "reads": 19, "readers_count": 18, "created": "2023-05-16T14:19:13.028Z"}, {"topic_id": 13039, "post_id": 31264, "post_number": 6, "score": 7.2, "author_username": "Gauntlet", "text": "The proposal has been implemented.", "reads": 11, "readers_count": 10, "created": "2023-05-22T19:40:42.015Z"}], [], [{"topic_id": 12919, "post_id": 30497, "post_number": 2, "score": 5.4, "author_username": "ChaosLabs", "text": "Thanks for putting forward this proposal @seawolf.\nPlease note there is already a proposal in place to increase the supply cap for WBTC on V3 Polygon - [ARFC] Chaos Labs Supply and Borrow Cap Updates - 04.21.2023", "reads": 27, "readers_count": 26, "created": "2023-04-28T14:20:07.049Z"}, {"topic_id": 12919, "post_id": 30501, "post_number": 3, "score": 10.0, "author_username": "seawolf", "text": "Thanks @ChaosLabs, we have edited the recommendation to reduce redundancy.", "reads": 25, "readers_count": 24, "created": "2023-04-28T18:55:54.252Z"}, {"topic_id": 12919, "post_id": 30559, "post_number": 4, "score": 164.8, "author_username": "Pauljlei", "text": "To follow up - we plan on putting up an AIP on Wednesday 5/3/2023.", "reads": 24, "readers_count": 23, "created": "2023-05-01T16:12:27.893Z"}, {"topic_id": 12919, "post_id": 30648, "post_number": 5, "score": 9.6, "author_username": "Pauljlei", "text": "AIP has been published here:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 23, "readers_count": 22, "created": "2023-05-03T22:45:53.964Z"}, {"topic_id": 12919, "post_id": 30940, "post_number": 6, "score": 3.4, "author_username": "Gauntlet", "text": "The parameter changes have been implemented on-chain. We thank the community for their participation.", "reads": 17, "readers_count": 16, "created": "2023-05-12T20:15:33.159Z"}], [], [{"topic_id": 12421, "post_id": 29293, "post_number": 2, "score": 21.6, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on.\nStart Date: Tuesday, Mar 28, 2023, 3:00 PM\nEnd Date: Wednesday, Mar 31, 2023, 3:00 PM\nThank you in advance for your participation in the vote.", "reads": 33, "readers_count": 32, "created": "2023-03-27T19:02:12.265Z"}, {"topic_id": 12421, "post_id": 29939, "post_number": 3, "score": 116.0, "author_username": "Pauljlei", "text": "\nGauntlet Analysis\n\nSimple Summary\nFor conservatism, the community may wish not to move forward with the above DAI LTV and LT increases. We flag several potential risks about increasing the DAI LTV and LT suggested in this forum post.\n\nAnalysis\nUnder extreme conditions, the LT increase makes it potentially cheaper to force a situation in which abnormal and/or cascading liquidations occur. We’ll outline a potential abnormal situation below.\nThe DAI LT increase from 80% to 83% increases the leverage multiplier from 5x to 5.9x for recursive short attacks, potentially making an attack 20% cheaper to execute. The least liquid borrowable token on Aave v3 Optimism is sUSD. In the event there is SNX volatility excess of the market, or idiosyncratic, unquantifiable Synthetix protocol abnormalities, sUSD may experience more difficulty in maintaining its peg.\nIf a bad actor borrows sUSD against DAI and market sells the sUSD, it can shock sUSD. In the event of exogenous, idiosyncratic sUSD volatility, this shock could further affect any existing downwards pressure on sUSD and make it more difficult for the sUSD redemption mechanism to function properly. The increased liquidations can trigger cascading liquidations or lead to similar insolvencies to the USDC non-parity in March.", "reads": 30, "readers_count": 29, "created": "2023-04-11T17:18:24.493Z"}, {"topic_id": 12421, "post_id": 30020, "post_number": 4, "score": 111.0, "author_username": "ChaosLabs", "text": "The risk mentioned in the comment is not limited to the proposed action of increasing the LT for DAI, and the recommendation itself does not pose any new risk to the Optimism deployment. A malicious actor can exercise this vector by utilizing USDC with a higher LT (85%) or E-Mode, which sUSD is a part of, with an LT of 97.5%. A proper mitigation for the risk described could be to minimize the borrow cap for sUSD. However, at this time, dumping the entire borrow cap of sUSD (13M) leads to minimal price impact and we do not recommend an immediate change to the cap.\nChaos Labs considers the potential for these types of attacks in our analyses and maintain our recommendation to increase capital efficiency with no projected increase in VaR and EVar. We plan to publish the AIP for voting early next week.\n\nScreen Shot 2023-04-12 at 12.42.55 PM872×952 57.8 KB\n\nAdditional note: This proposal has been on the forums for 3 weeks, has been approved via a Snapshot vote, and is ready for the on-chain vote. This is not the first time Gauntlet’s concerns have been raised at the last minute. The governance framework purposely incorporates multi-day buffers to facilitate discussions and serve as a feedback period. Ignoring these periods and responding as proposals converge creates confusion and extra work for governance voters and contributors alike. There are cases in which this is warranted, specifically when major circumstance shifts occur between a Snapshot and AIP. However, this has not been the case recently, including here, and concerns, even if unfounded, could have been raised earlier. Our communication channels are open, and we are happy to assist Gauntlet or any other contributors if extra time is needed. We continue to welcome collaboration across risk protocol contributors and a streamlined communication process, using governance frameworks and timelines as a baseline for what is expected to advance the speed and efficiency of Aave’s governance process.", "reads": 30, "readers_count": 29, "created": "2023-04-13T17:46:45.823Z"}, {"topic_id": 12421, "post_id": 30106, "post_number": 5, "score": 85.0, "author_username": "ChaosLabs", "text": "We have published AIP-206  to update risk parameters on V3 Optimism, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 25, "readers_count": 24, "created": "2023-04-17T19:52:47.484Z"}, {"topic_id": 12421, "post_id": 30691, "post_number": 6, "score": 3.0, "author_username": "Aunzaa", "text": "\n\n\n ChaosLabs:\n\nSimple Summary\nA proposal to adjust five (5) total risk parameters, including Loan-to-Value, Liquidation Threshold, and Liquidation Bonus, across two (2) Aave V3 Optimism assets.\nMotivation\nChaos Labs’ Parameter Recommendation Platform runs hundreds of thousands of agent-based off-chain and on-chain simulations to examine how different Aave V3 risk parameters configurations would behave under adverse market conditions - and find the optimal values to maximize protocol borrow usage while minimizing losses from liquidations and bad debt.\nNote: As a general guideline, we limit the proposed changes by ±3% for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters if the optimal configuration is outside this range.\nPlease find more information on the parameter recommendation methodology here.\nYou can also view the simulation results and breakdown for the different assets by clicking on them on this page.\nThe output of our simulations reveals an opportunity to increase LTVs and LTs for WBTC and DAI on V3 Optimism, resulting in improved capital efficiency of the system, with no effect on the projected VaR (95th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours) and EVaR (Extreme VaR, the 99th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours)\nSimulating all changes jointly yields a projected borrow increase of ~$155,000, with no increase in VaR and Extreme VaR compared to simulations with the current parameters.\nUntitled (30)2686×1318 239 KB\nUntitled (31)2688×1334 228 KB\nLiquidity Analysis:\nThe TVL in Aave on Optimism (118.71M$) is concentrated primarily on three blue-chip, high-liquidity assets, which together account for ~75% of the supplied assets in $ values: USDC (34%), WETH (28%), and WBTC (14%). Based on our analysis, we recommend increasing the Loan-To-Value (LTV) and Liquidation Threshold (LT) for WBTC and DAI, as we have determined that there is adequate on-chain liquidity to support significant liquidations. Similarly, we recommend reducing the Liquidation Penalty for WBTC, which is set conservatively at 10% to a lower level (8.5%) closer to that of USDC and Ethereum (5%).\nPositions Analysis\nWe have not identified any outsized positions that are actively affecting our recommendations. However, we should call out that  ~40% of the on-chain supply of WBTC on Optimism is currently held on Aave, which calls for some caution. We have already proposed and implemented an amendment to the supply cap to limit the concentration of liquidity on Aave.\nGiven the blue-chip nature of BTC/WBTC, we expect significant arbitrage buying pressure to offset any slippage that may be created by future liquidations of WBTC and, therefore, recommend reducing the Liquidation Penalty even with the current significant liquidity concentration on Aave. We expect a lower LP to drive liquidators to liquidate positions in smaller portions, pacing the process and allowing the market more time to react.\nRecommendations\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWBTC\nLiquidation Threshold\n75%\n78%\n+3%\n\n\nWBTC\nLoan-to-Value\n70%\n73%\n+3%\n\n\nWBTC\nLiquidation Penalty\n10%\n8.5%\n-1.5%\n\n\nDAI\nLiquidation Threshold\n80%\n83%\n+3%\n\n\nDAI\nLoan-to-Value\n75%\n78%\n+3%\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.\n\n\n** *\n\nemphasized text\n\n", "reads": 15, "readers_count": 14, "created": "2023-05-05T09:40:19.134Z"}], [{"topic_id": 12385, "post_id": 28981, "post_number": 2, "score": 93.2, "author_username": "ChaosLabs", "text": "Thanks for putting forward this proposal @seawolf.\nWe would like to flag that there is a proposal to update supply and borrow caps on V3 Avalanche, which was already approved by the community and will be executed by the Guardians shortly.\nA table with the approved caps highlighted is shared below for visibility\n\nScreen Shot 2023-03-20 at 10.24.15 PM1634×516 64 KB\n\nGiven the changes in on-chain liquidity on Avalanche, we support the update for USDC and DAI.e. In addition, with the current borrow of WAVAX exceeding the approved borrow cap, we support the recommendation for a 3M borrow cap.\nFor all other Avalanche recommendations, we do not believe there is a need for an additional update at this time.", "reads": 41, "readers_count": 40, "created": "2023-03-21T02:35:30.449Z"}, {"topic_id": 12385, "post_id": 29008, "post_number": 3, "score": 272.2, "author_username": "seawolf", "text": "Thanks, we have revised the proposal in the below table in order to avoid overlapping changes for AVAX v3 market. The existing approved recommendations on BTC.B would essentially freeze the supply on the market, and our recommendations on BTC.B further protects the market in case liquidity drops below the cap.\n\nSpecification\n\nETH v3\n\n\n\n\nAsset\nCurrent Supply Cap\nRecommend Supply Cap\nCurrent Supply\n\n\n\n\nCRV\n62,500,000\n51,000,000\n108,000\n\n\n\n\nAVAX v3\n\n\n\n\nAssets\nCurrent Supply Cap\nRecommend Supply Cap\nCurrent Borrow Cap\nRecommend Borrow Cap\n\n\n\n\nBTC.B\n4,620\n3,000\n3,190\n900\n\n\nUSDC\n4,000,000,000\n170,000,000\n-\n90,000,000\n\n\nWAVAX\n\n\n-\n3,000,000\n\n\nDAI.e\n2,000,000,000\n17,000,000\n-\n17,000,000\n\n\n\n", "reads": 36, "readers_count": 35, "created": "2023-03-21T18:41:11.781Z"}, {"topic_id": 12385, "post_id": 29023, "post_number": 4, "score": 26.6, "author_username": "Pauljlei", "text": "\nGauntlet Update\nNext steps for the ETH V3 changes (for CRV) have been posted here.\nWe will initiate a separate Snapshot vote for the AVAX V3 changes shortly, given that AVAX changes cannot be made via AIP.", "reads": 33, "readers_count": 32, "created": "2023-03-21T21:19:23.672Z"}, {"topic_id": 12385, "post_id": 29031, "post_number": 5, "score": 257.0, "author_username": "Pauljlei", "text": "Snapshot vote has been published below. As a reminder, AVAX changes cannot be implemented via AIP, so this Snapshot vote serves as the community’s preference.\nhttps://snapshot.org/#/aave.eth/proposal/0x833eca942053ffcaecbedd6c3b0d5f2392f1ad868e57f1babe9b40a2afedaaa3", "reads": 35, "readers_count": 34, "created": "2023-03-21T21:53:18.857Z"}, {"topic_id": 12385, "post_id": 29332, "post_number": 6, "score": 71.0, "author_username": "Pauljlei", "text": "The Snapshot vote for the AVAX changes has passed.\nAs an update, for AVAX V3, we will not move forward with the WAVAX change given market changes since the Snapshot but will move forward with the other cap changes for AVAX V3.", "reads": 30, "readers_count": 29, "created": "2023-03-28T19:54:09.103Z"}, {"topic_id": 12385, "post_id": 29953, "post_number": 7, "score": 100.6, "author_username": "luigidemeo88", "text": "Thank you for this update. I do not understand the reasoning behind this recommendation for certain assets. LSDs and redeemable assets such as BTC.b cannot be viewed in the same lens as native assets.\nParticularly for BTC.b and WETH.e it makes little sense for assets that can be bridged and arbitraged on demand to have such aggressive supply caps. Particularly, these assets do not require merchants or special fees to redeem and withdraw, they can be easily bridged.\nCreating these arbitrary caps only forces liquidity to other venues who do not place arbitrary caps that need to consistently be raised on a manual basis (creating friction and inefficiencies). In my opinion and specifically in reference to the proposed changes to BTC.b, WETH.e, DAI.e, this is a pretty draconian measure for assets that have very little to do with the USDC depegging event.", "reads": 28, "readers_count": 27, "created": "2023-04-12T12:43:36.270Z"}, {"topic_id": 12385, "post_id": 30041, "post_number": 8, "score": 69.8, "author_username": "Pauljlei", "text": "Thanks for the question, @luigidemeo88.\n\n\n\n luigidemeo88:\n\nParticularly for BTC.b and WETH.e it makes little sense for assets that can be bridged and arbitraged on demand to have such aggressive supply caps. Particularly, these assets do not require merchants or special fees to redeem and withdraw, they can be easily bridged.\n\n\nThis decision was made after Gauntlet’s analysis of the situation and considering various factors, which are detailed below. Extreme price movements can cause insolvencies in the protocol.\nApproximately ~70% of all liquidations on Avalanche immediately trade out of their position. All of the BTC.b liquidations (13 total greater than 1,000 USD) in the last month immediately trade out of their positions. See these examples 1, 2, 3. That is the basis of considering on-chain liquidity for setting borrow and supply caps at this moment. The learning from the USDC price deviation was that DEX liquidity is a NECESSARY condition for liquidations on Aave V3 Avalanche. This condition seems to hold for BTC.b as well. By lowering the caps, we aim to mitigate the risk of price manipulation attacks and protect the protocol’s growth. The cap we set relative to market caps is balanced to defend against attacks while still allowing for revenue generation.\n\nVolume of bridged assets vs non-bridged assets: A significant amount of bridged assets like DAI.e left the ecosystem in comparison to non-bridged assets like USDT and USDC. This indicated a heightened level of risk and warranted a more conservative approach to managing the lending protocol.\nRecall that our borrow and supply caps serve to protect the protocol from price manipulation attacks, with liquidity being a key factor in the calculations. Please note the net outflows in BTC.b below.\n\nAverage time to bridge: The time taken to bridge assets is crucial in times of duress. Per the Avalanche docs, on average, it takes 1 hour to bridge to Avalanche from the Bitcoin network, and 20 minutes from Ethereum. Our aggressive recommendations take into account global liquidity, including liquidity in centralized exchanges. However, for bridged assets, this may hinder healthy liquidations from occuring during black swan events. By lowering the caps, we aim to encourage instantaneous liquidations and improve the stability of the protocol.\n\n\n\n\n luigidemeo88:\n\nIn my opinion and specifically in reference to the proposed changes to BTC.b, WETH.e, DAI.e, this is a pretty draconian measure for assets that have very little to do with the USDC depegging event.\n\n\nLowering DAI.e caps was a pertinent response to the depeg, as during the event, the asset dropped 8% in price and resulted in $324K liquidated on the protocol (and a relatively small amount of insolvencies). As mentioned, in the process, a majority of the DAI.e liquidations instantaneously traded out of their positions. By reducing the caps, we aim to provide a more stable and secure lending environment, ensuring the long-term success and growth of the Avalanche Aave v3 lending protocol.\nPlease refer to our Supply and Borrow Cap Methodology for a detailed explanation of the factors considered in setting these caps. As this is a response to a crisis, we had opted to use conservative caps that reference only on-chain liquidity. Moreover, as outlined in this methodology, we propose slightly higher aggressive caps for some bridged assets in order to promote protocol usage and asset growth; however, this is secondary to protecting the protocol in times of volatility. We will continue to monitor liquidity conditions and make recommendations as they evolve.\nA Note on LSTs\n\n\n\n luigidemeo88:\n\nLSDs and redeemable assets such as BTC.b cannot be viewed in the same lens as native assets.\n\n\nWith respect to LSTs such as sAVAX, we had not recommended changes to sAVAX post-depeg, as the liquidity had widely recovered. We detail our methodology for setting borrow and supply caps for liquid staking tokens here, and welcome further discussion in that ARFC.", "reads": 24, "readers_count": 23, "created": "2023-04-14T15:42:46.114Z"}, {"topic_id": 12385, "post_id": 30710, "post_number": 9, "score": 3.2, "author_username": "Pauljlei", "text": "The above has been implemented. We thank the community for their participation.", "reads": 16, "readers_count": 15, "created": "2023-05-05T16:41:30.330Z"}], [{"topic_id": 12394, "post_id": 29022, "post_number": 2, "score": 777.8, "author_username": "Pauljlei", "text": "\nAIP Update\nIn order to reduce governance fatigue, Gauntlet is bundling several parameter changes given that they are all cap updates. Gauntlet will be bundling parameter changes on ETH V3 and rETH along with these parameter changes in this forum post.\nTo summarize, the AIP will incorporate the following changes:\nV3 Arbitrum:\n\nIncrease WETH’s Supply Cap from 35,280 to 45,000\n\nV3 ETH:\n\nIncrease rETH’s Supply Cap from 10,000 to 20,000\nDecrease CRV’s Supply Cap from 62,500,000 to 51,000,000\n\nIn order to avoid voting on the weekend, we plan on putting up the AIP on Monday 3/27/2023.", "reads": 39, "readers_count": 38, "created": "2023-03-21T21:17:04.066Z"}, {"topic_id": 12394, "post_id": 29303, "post_number": 3, "score": 7.2, "author_username": "Gauntlet", "text": "AIP is up", "reads": 36, "readers_count": 35, "created": "2023-03-28T00:37:40.546Z"}, {"topic_id": 12394, "post_id": 29972, "post_number": 4, "score": 26.0, "author_username": "Pauljlei", "text": "As an update, we are working on incorporating the WETH changes here.", "reads": 30, "readers_count": 29, "created": "2023-04-12T21:24:42.122Z"}, {"topic_id": 12394, "post_id": 30026, "post_number": 5, "score": 65.8, "author_username": "Pauljlei", "text": "The WETH change on Arbitrum (increasing WETH Supply Cap) has not been implemented yet - we plan to implement it in our next batch of updates.", "reads": 29, "readers_count": 28, "created": "2023-04-13T21:39:10.104Z"}, {"topic_id": 12394, "post_id": 30635, "post_number": 6, "score": 13.4, "author_username": "Pauljlei", "text": "The WETH change has now been implemented.", "reads": 17, "readers_count": 16, "created": "2023-05-03T17:16:28.515Z"}], [{"topic_id": 12798, "post_id": 30141, "post_number": 2, "score": 79.4, "author_username": "Pauljlei", "text": "As this recommendation meets the conditions outlined in the community’s V3 Cap Updates Framework, we will go direct to AIP without a Snapshot vote. We target an AIP on 4/21/2023.", "reads": 22, "readers_count": 21, "created": "2023-04-18T17:49:09.801Z"}, {"topic_id": 12798, "post_id": 30364, "post_number": 3, "score": 9.0, "author_username": "Pauljlei", "text": "AIP published:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 20, "readers_count": 19, "created": "2023-04-25T00:53:40.844Z"}, {"topic_id": 12798, "post_id": 30647, "post_number": 4, "score": 13.0, "author_username": "Pauljlei", "text": "This AIP has now been passed and implemented. We thank the community for their participation.", "reads": 15, "readers_count": 14, "created": "2023-05-03T21:47:32.805Z"}], [{"topic_id": 12842, "post_id": 30291, "post_number": 2, "score": 39.8, "author_username": "Llamaxyz", "text": "Hi @ChaosLabs,\nGreat to see the iterative nature of continual improvements and tuning of Supply Caps.\nWould it be possible to get some colour around the 0.1% of the Safety Modules (SM) funds ?\n0.1% is equivalent to one thou of the SM funds. As in the SM can cover 1,000 events equal to 0.1%, $400k, at any single point in time. Given the composition of the assets in the SM, high volatility, is a percentage of the SM the right metric here, or would a nominal % of revenue or allocated $$ amount be a more suitable definition. Perhaps this is how $400k was derived and this is the number that is", "reads": 24, "readers_count": 23, "created": "2023-04-23T13:28:03.761Z"}, {"topic_id": 12842, "post_id": 30387, "post_number": 3, "score": 19.2, "author_username": "ChaosLabs", "text": "As outlined in the methodology above, we use a threshold of $400K as the initial target loss for our recommendations. This figure was chosen as an initial conservative figure for this methodology.\n\n\n\n ChaosLabs:\n\nWe binary search for optimal supply caps, limiting protocol losses to some target loss K. Initially, we propose capping potential protocol losses to 0.1% of the safety module’s funds, which currently equates to $400K U.S. dollars. In case this figure limits future supply cap increases, the community could decide on a different threshold.\n\n\nIf this target loss proves to be limiting in terms of increasing supply caps for certain assets over time, the community can decide to raise the threshold to reflect a higher risk appetite.\nWe value the community’s input on this matter and encourage any suggestions or feedback to enhance our methodology.", "reads": 21, "readers_count": 20, "created": "2023-04-25T18:12:11.498Z"}], [{"topic_id": 11602, "post_id": 30248, "post_number": 2, "score": 7.6, "author_username": "ChaosLabs", "text": "The updated Chaos Labs Supply Cap Methodology can be found here, and will be used for our future recommendations.", "reads": 13, "readers_count": 12, "created": "2023-04-21T14:56:16.646Z"}], [], [], [{"topic_id": 12675, "post_id": 29911, "post_number": 2, "score": 7.2, "author_username": "Pauljlei", "text": "AIP is now live:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 36, "readers_count": 35, "created": "2023-04-11T00:38:59.133Z"}, {"topic_id": 12675, "post_id": 30068, "post_number": 3, "score": 136.2, "author_username": "Nyyls", "text": "\n\n\n Pauljlei:\n\nWe will revisit immediately post-upgrade on April 12th.\n\n\nWhen can we expect some new info here? Especially interested in wsteth supply cap on arbitrum V3", "reads": 31, "readers_count": 30, "created": "2023-04-15T14:44:41.295Z"}, {"topic_id": 12675, "post_id": 30136, "post_number": 4, "score": 34.2, "author_username": "tuanyuan2008", "text": "wstETH is in the Ethereum-correlated eMode pool on Arbitrum Aave v3. Recall the assumptions in Gauntlet’s eMode methodology for LSTs. The supply cap considers liquidity at both abnormal and normal price dislocations:\n\n(abnormal) maximum amount able to be liquidated within a 1-LT drop over a time range if the current liquidity is halved, with no additional liquidity inflow\n(normal) 20x corresponding to a 1% price drop, bounded by 50% of the onchain circulating supply.\n\nWe aim to revisit once the community has aligned on a risk preference as presented in the above forum post.", "reads": 21, "readers_count": 20, "created": "2023-04-18T17:31:28.986Z"}, {"topic_id": 12675, "post_id": 30139, "post_number": 5, "score": 9.6, "author_username": "Pauljlei", "text": "For further clarity, if the community has a conservative preference, as presented in Gauntlet’s eMode methodology for LSTs, then they may not wish to increase caps for wstETH on V3 Arbitrum at this time.", "reads": 23, "readers_count": 22, "created": "2023-04-18T17:43:51.427Z"}, {"topic_id": 12675, "post_id": 30142, "post_number": 6, "score": 24.0, "author_username": "Pauljlei", "text": "The wstETH Borrow Cap increase on V3 Arbitrum has been implemented.", "reads": 20, "readers_count": 19, "created": "2023-04-18T18:09:26.228Z"}], [{"topic_id": 12541, "post_id": 29503, "post_number": 2, "score": 16.8, "author_username": "Pauljlei", "text": "As an update, we will publish a new AIP for this today.", "reads": 34, "readers_count": 33, "created": "2023-04-02T07:13:40.169Z"}, {"topic_id": 12541, "post_id": 29519, "post_number": 3, "score": 16.6, "author_username": "Pauljlei", "text": "AIP below:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 33, "readers_count": 32, "created": "2023-04-02T19:34:39.170Z"}, {"topic_id": 12541, "post_id": 29860, "post_number": 4, "score": 55.6, "author_username": "Pauljlei", "text": "This proposal has been passed and executed. We thank the community for their participation.\nGiven the low level of usage on the AMM V2 market, and the fact that the only unfrozen assets are now majors (DAI, USDC, USDT, WBTC, ETH) that are available on V2 ETH and V3 ETH, we recommend deprecating the AMM V2 market. This would set LTs to 0 for all Uni V2 assets on the AMM V2 market.\nWe aim to move forward with transparency and give ample time for users to adjust their positions. As such, we aim to conduct a Snapshot vote on 4/20/2023 and if this Snapshot passes, move forward with an AIP with advanced notice to users.", "reads": 28, "readers_count": 27, "created": "2023-04-08T06:49:20.520Z"}], [{"topic_id": 12159, "post_id": 28327, "post_number": 2, "score": 39.0, "author_username": "Pauljlei", "text": "\nMaticX and stMATIC Supply Cap Update\nGiven 100% cap usage, we wanted to provide an update on MaticX and stMATIC supply cap recommendations, using the latest market data:\n\nimage (26)1226×228 18.7 KB\n", "reads": 45, "readers_count": 44, "created": "2023-03-04T00:51:26.297Z"}, {"topic_id": 12159, "post_id": 28328, "post_number": 3, "score": 103.0, "author_username": "Pauljlei", "text": "The circulating supply of BTC.b on AVAX is 9,616. Aave currently has 5,800K ($129.6M) on the protocol. Given this concentration, Gauntlet does not recommend increasing BTC.b’s supply cap, as we also mention here.", "reads": 40, "readers_count": 39, "created": "2023-03-04T01:59:30.404Z"}, {"topic_id": 12159, "post_id": 28759, "post_number": 4, "score": 47.4, "author_username": "seawolf", "text": "Gauntlet would like to notify the Aave community of a $748k liquidation on Aave V2. The account was using collateral of USDC to borrow WETH.\nIn particular, no insolvency occurred from this liquidation event.\n\nAddress: 0xd79fe5ca182b112e62d1466068b572493b88cb24\n\n\nTransaction for liquidation.\nLiquidation Amount: 748k USDC\n\n\nCurrent Account Data Position\n\nimage1920×520 25.6 KB\n\n\nSupply Balances since Mar 1st\n\nimage1424×760 113 KB\n", "reads": 37, "readers_count": 36, "created": "2023-03-16T02:58:09.999Z"}, {"topic_id": 12159, "post_id": 28803, "post_number": 5, "score": 46.2, "author_username": "seawolf", "text": "We want to notify the community of a large whale position near liquidation on Aave v2 ETH. This user has a health factor of 1.01 with an outstanding borrow position of $14.3M in WBTC. We notified the community of this account last month via this forum post. We are continuing to monitor, but we wanted to share this information about the client:\n\n\nAddress: 0x60ee8465dc43245c6c2989b1089e476d3a0a717d\n\n\nHealth Factor:1.01\n\nUntitled (35)3712×982 193 KB\n\n\n\nToken Supply Balances since Feb 1st. The user has reduced their position in USDC since the non-parity event.\n\nUntitled (36)1826×924 56.3 KB\n\n\n\nThe user is very active with their position.\n\nUntitled (38)1820×958 60.4 KB\n\n\n", "reads": 31, "readers_count": 30, "created": "2023-03-16T22:04:37.291Z"}, {"topic_id": 12159, "post_id": 28873, "post_number": 6, "score": 65.8, "author_username": "seawolf", "text": "Gauntlet would like to notify the Aave community of a $7.5M liquidation on Aave V2. The account was using stETH collateral to borrow WBTC.\nIn particular, no insolvency occurred from this liquidation event.\n\nAddress: 0x60ee8465dc43245c6c2989b1089e476d3a0a717d\n\n\nTransaction for liquidation.\nLiquidation Amount: $7.5M\nCurrent Health Factor: 1.09\n\n\nCurrent Account Data Position\n\nUntitled (39)1920×519 29.8 KB\n\n\nSupply Balances since Feb 1st\n\nUntitled (40)1920×832 125 KB\n", "reads": 29, "readers_count": 28, "created": "2023-03-18T19:46:45.894Z"}, {"topic_id": 12159, "post_id": 28898, "post_number": 7, "score": 25.2, "author_username": "seawolf", "text": "Gauntlet is notifying the community about the asset EURS having utilization above 95%.\n\nimage1478×142 48.5 KB\n\nGauntlet is analyzing and will let the community know of any next steps.", "reads": 26, "readers_count": 25, "created": "2023-03-19T17:28:24.334Z"}, {"topic_id": 12159, "post_id": 29065, "post_number": 8, "score": 9.8, "author_username": "seawolf", "text": "Gauntlet wants to notify the community that asset SUSHI borrow cap usage is at 76%.\n\nAsset: SUSHI on Polygon V3\nBorrow Cap:  102.4K ($120K)\nBorrow Amount : 78.82K ($92K)\n\n\nimage1006×690 34.8 KB\n\nGauntlet will continue to monitor the market. The cap utilization was recently near full utilization but dropped below the 75% threshold. We continue to recommend no increase in SUSHI’s borrow cap as posted in the forum on March 3rd.", "reads": 24, "readers_count": 23, "created": "2023-03-22T15:26:43.179Z"}, {"topic_id": 12159, "post_id": 29236, "post_number": 9, "score": 49.4, "author_username": "seawolf", "text": "Gauntlet wants to notify the community that asset stMATIC supply cap usage is 77%.\n\nAsset: stMATIC on Polygon V3\nSupply Cap:  11.56M ($13.39M)\nSupply Amount : 15.00M ($17.37M)\n\n\nUntitled (41)1018×690 38.3 KB\n\nThe cap utilization was recently at full utilization but the supply cap was increased to 15M on March 15th. Gauntlet will continue to monitor the market and make further recommendations.", "reads": 22, "readers_count": 21, "created": "2023-03-26T17:17:59.586Z"}, {"topic_id": 12159, "post_id": 29340, "post_number": 10, "score": 24.6, "author_username": "seawolf", "text": "Gauntlet would like to notify the community of a $172k liquidation on Arbitrum v3 market. The account’s LINK collateral was liquidated to repay USDC.\nIn particular, no insolvency occurred from this liquidation event.\n\nAddress: 0x7bdc57a20bea89f99ca021f1cfc8d9ed772d5415\n\n\nTransaction for liquidation.\nLiquidation Amount: $172k\nCurrent Health Factor: 1.10\n\n\nCurrent Account Data Position\n\nUntitled (42)3692×962 185 KB\n", "reads": 23, "readers_count": 22, "created": "2023-03-28T22:27:58.547Z"}, {"topic_id": 12159, "post_id": 29419, "post_number": 11, "score": 189.6, "author_username": "seawolf", "text": "Gauntlet wants to notify the community that asset wstETH supply cap usage is at 75.62%.  Our team is looking into it and will let you know if any next steps.\n\nAsset: wstETH on Ethereum V3\nSupply Cap:  151.24K ($303.38M)\nSupply Amount : 200.00K ($401.18M)\n\nUntitled (43)1018×702 29.4 KB\n\n\n", "reads": 23, "readers_count": 22, "created": "2023-03-30T14:50:54.415Z"}, {"topic_id": 12159, "post_id": 29420, "post_number": 12, "score": 9.6, "author_username": "seawolf", "text": "We would like to inform you that the utilization rates for WAVAX’s supply cap and borrow cap on Avalanche Aave v3 are currently at 78% and 100%, respectively. The assets caps were recently adjusted downward. Our team is looking into it and will let you know if any next steps.\n\nUntitled (44)1016×1412 57.8 KB\n", "reads": 23, "readers_count": 22, "created": "2023-03-30T14:51:48.952Z"}, {"topic_id": 12159, "post_id": 29663, "post_number": 13, "score": 18.4, "author_username": "wfu", "text": "\n\n\n seawolf:\n\nGauntlet wants to notify the community that asset wstETH supply cap usage is at 75.62%. Our team is looking into it and will let you know if any next steps.\n\nAsset: wstETH on Ethereum V3\nSupply Cap: 151.24K ($303.38M)\nSupply Amount : 200.00K ($401.18M)\n\n\n\nAs a follow-up from this notification: we do not recommend increasing the supply cap at this time in light of the Shanghai upgrade. However, given liquidity considerations (namely circulating supply and DEX concentration), we will revisit immediately post-upgrade on April 12th.", "reads": 17, "readers_count": 16, "created": "2023-04-04T17:57:36.905Z"}], [{"topic_id": 11605, "post_id": 27249, "post_number": 2, "score": 47.6, "author_username": "Pauljlei", "text": "Thanks, @ChaosLabs. Gauntlet’s analysis yielded different results (mostly higher caps). In order to reduce governance fatigue, we will not offer another set of options to the community. However, we did want to flag the BAL supply cap increase.\nThe recommended BAL supply cap of 569,200 above represents ~78% of circulating supply on Polygon chain. That represents a meaningful concentration risk for the Aave Polygon v3 market. Under Gauntlet’s borrow and supply cap methodology, even our Aggressive recommendation would set the max amount of BAL at 361k. If Chaos moves forward with recommending an increase to BAL’s supply cap, we recommend no cap larger than 361k.\nWe’d note that there are several assets on this list that Gauntlet would recommend increasing caps for, but only if the community agrees on an Aggressive assumption. The community has not yet decided on a Conservative vs. Aggressive strategy, so we ask that the community provides input on this thread.", "reads": 38, "readers_count": 37, "created": "2023-02-10T16:01:09.433Z"}, {"topic_id": 11605, "post_id": 27270, "post_number": 3, "score": 68.0, "author_username": "ChaosLabs", "text": "We have updated the proposal above to incorporate our recommendations for increased borrow caps for DAI, USDC, and USDT on Polygon. The recommended caps are designed to allow growth on V3 and room for the migration of positions from V2.\n\n\n\n Pauljlei:\n\nIf Chaos moves forward with recommending an increase to BAL’s supply cap, we recommend no cap larger than 361k.\n\n\nIn addition, we updated the recommendation for the BAL supply cap to incorporate the above recommendation and added Gauntlet’s recommendation for an increased borrow cap for EURS (increasing the borrow cap to 947,000).\nWe plan to utilize the fast-track process for increasing borrow caps and will proceed to post an AIP at the beginning of next week, barring any community concerns.", "reads": 40, "readers_count": 39, "created": "2023-02-10T21:59:03.401Z"}, {"topic_id": 11605, "post_id": 27513, "post_number": 4, "score": 26.8, "author_username": "sakulstra", "text": "What’s the rationale behind keeping these massive 2B supply caps?\nI see that it’s like that on pools, but the approach on Ethereum v3 seems more reasonable to me (aka caps, with good margin for growth, without being overly excessive as it’s easy enough to update in a future proposal).", "reads": 34, "readers_count": 33, "created": "2023-02-13T11:42:33.105Z"}, {"topic_id": 11605, "post_id": 27521, "post_number": 5, "score": 61.4, "author_username": "ChaosLabs", "text": "Thanks @sakulstra for the comment.\nIn this proposal, we originally focused on highlighting and updating caps nearing their limits, rather than a wide change of parameters.\nWe support the approach of setting caps “with a good margin for growth, without being overly excessive” and have been implementing it in our proposal.\nTo accommodate this comment in the upcoming proposal, we have updated the recommendations to reduce the supply caps for DAI, USDC, USDT, and EURS such that the new cap can absorb migrating positions from V2 while allowing additional organic growth.", "reads": 32, "readers_count": 31, "created": "2023-02-13T16:03:24.116Z"}, {"topic_id": 11605, "post_id": 27688, "post_number": 6, "score": 41.0, "author_username": "ChaosLabs", "text": "We have published this AIP-155 for community members to vote on, starting in 24h\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 30, "readers_count": 29, "created": "2023-02-15T19:23:27.495Z"}, {"topic_id": 11605, "post_id": 29301, "post_number": 7, "score": 54.4, "author_username": "Gauntlet", "text": "Updated Recommendation for BAL on Polygon V3:\n\n\nNo increase to the Supply Cap. The existing Supply Cap represents 63% of BAL circulating supply on Polygon. Since our last recommendation, the circulating supply of BAL on Polygon has decreased.\n\n\nIncrease the Borrow Cap from 256k to 290k. Increasing the borrow cap is supported by the number of tokens held by top wallet holders and circulating on Polygon.\n\n", "reads": 22, "readers_count": 21, "created": "2023-03-28T00:24:41.706Z"}, {"topic_id": 11605, "post_id": 29304, "post_number": 8, "score": 24.4, "author_username": "WintermuteGovernance", "text": "We’d be interested to know if Gauntlet tracks the behaviour of borrowers for BAL?\nGiven the likes of Aura which offer a high yield on BAL/ETH BPT, is it fair to assume that borrowers are bridging to ETH and depositing to Aura? If so, increasing the borrow cap would likely further reduce the circulating supply on Polygon.", "reads": 22, "readers_count": 21, "created": "2023-03-28T00:49:42.109Z"}, {"topic_id": 11605, "post_id": 29330, "post_number": 9, "score": 24.0, "author_username": "Llamaxyz", "text": "Hi @WintermuteGovernance,\nPlease have a read of this proposal here which seeks to change the BAL interest rate.\n\n  \n    \n    \n    [ARFC] BAL Interest Rate Upgrade Governance\n  \n  \n    title: [ARFC] BAL Interest Rate Upgrade \nAuthor: @Llamaxyz \nDated: 2023-03-22 \n\n\nSummary\nThis publication proposes implementing the next step in the BAL interest rate increase. \n\nAbstract\nPreviously, Aave implemented the first stage of increasing the BAL borrowing rate across all deployments. This was performed with the intention of monitoring the market response and revising the rates higher at a later date. \nThis publication presents the next BAL interest rate increase to Aave for discussions…\n  \n\n\nAn extract applicable to the earlier comment is shown below:\n\n\n\n\n\nDescription\nAPY\nTVL\nNetwork\n\n\n\n\nAura Finance (Aura Gauge)\nB-80BAL-20WETH / auraBAL\n58.21%\n$21,380,000\nEthereum\n\n\nTetu (Balancer Gauge)\nB-80BAL-20WETH / tetuBAL\n88.77%\n$10,220,000\nPolygon\n\n\nStake DAO (Balancer Gauge)\nB-80BAL-20WETH / sdBAL\n18.25% - 45.35%\n$637,221\nEthereum\n\n\n\nWe have also just published this proposal to focus the communities discussion on the BAL reserve on Polygon v3. Let’s pivot the discussion across to the thread linked below.\n\n  \n    \n    \n    [ARFC] Polygon v3 BAL Supply & Borrow Cap Increase Governance\n  \n  \n    title: [ARFC] Polygon v3 BAL Supply & Borrow Cap Increase \nauthor: @Llamaxyz - @TokenLogic \ncreated: 2023-03-28 \n\n\nSummary\nThis publication seeks to increase the BAL Supply and Borrow Caps on Polygon v3 Liquidity Pool. \n\nAbstract\nThe BAL Reserve Supply Cap is 85.00%  and 96.24% utilised on Polygon v3. Both have been trending higher over time. \nThis publication presents a modest increase to the SupplyCap from 361,000 units to 400,000 units, representing an overal increase of 10.8%. \nThe utilisat…\n  \n\n", "reads": 20, "readers_count": 19, "created": "2023-03-28T18:17:31.498Z"}], [{"topic_id": 12349, "post_id": 28900, "post_number": 2, "score": 33.2, "author_username": "Pauljlei", "text": "Given the framework here, Gauntlet plans on publishing an AIP for this set of recommendations next week.", "reads": 41, "readers_count": 40, "created": "2023-03-19T17:36:46.840Z"}, {"topic_id": 12349, "post_id": 28901, "post_number": 3, "score": 14.0, "author_username": "MatthewGraham", "text": "Hi @Pauljlei,\nMay I suggest upgrading the rETH oracle to use the Chainlink Oracle whilst performing this update, link shared below:\nrETH/ETH: 0x536218f9E9Eb48863970252233c8F271f554C2d0\n@bgdlabs - Do you have any thoughts on using this oracle.", "reads": 45, "readers_count": 44, "created": "2023-03-19T17:50:58.829Z"}, {"topic_id": 12349, "post_id": 28902, "post_number": 4, "score": 74.0, "author_username": "bgdlabs", "text": "Currently, rETH on Aave v3 Ethereum uses our sync adapter solution, in this case, composed by the ETH/USD Chainlink feed and the getExchangeRate() function returning the rETH/ETH value, queried directly from the rETH smart contract.\nThis works flawlessly given the “static” nature of the updates of that getExchangeRate() value, not introducing any technical risk to Aave.\nGiven there are other pending updates on oracles regarding LSTs on different networks, we recommend not including this change in this proposal. BGD will submit a proposal batching together all the oracles updates.", "reads": 45, "readers_count": 44, "created": "2023-03-19T18:29:09.805Z"}, {"topic_id": 12349, "post_id": 29014, "post_number": 5, "score": 11.4, "author_username": "Pauljlei", "text": "Update: we plan on publishing an AIP tomorrow, 3/21/2023, for these parameter changes.", "reads": 32, "readers_count": 31, "created": "2023-03-21T20:00:49.747Z"}, {"topic_id": 12349, "post_id": 29017, "post_number": 6, "score": 66.4, "author_username": "ChaosLabs", "text": "We would like to flag that the supply for rETH has reached ~77% of the supply cap.\n\nScreen Shot 2023-03-21 at 4.07.19 PM1644×948 103 KB\n\nWe recommend a 2X increase to the supply cap, per our supply cap methodology. Would it be possible to update this AIP to incorporate this change?", "reads": 32, "readers_count": 31, "created": "2023-03-21T20:13:28.377Z"}, {"topic_id": 12349, "post_id": 29024, "post_number": 7, "score": 30.8, "author_username": "Pauljlei", "text": "Thanks @ChaosLabs - we have already prepared this payload, but will include the rETH changes in our next AIP here.", "reads": 29, "readers_count": 28, "created": "2023-03-21T21:20:21.625Z"}, {"topic_id": 12349, "post_id": 29102, "post_number": 8, "score": 10.2, "author_username": "Gauntlet", "text": "AIP: Aave - Open Source Liquidity Protocol", "reads": 26, "readers_count": 25, "created": "2023-03-23T02:35:03.651Z"}], [], [{"topic_id": 12310, "post_id": 28794, "post_number": 2, "score": 101.6, "author_username": "Llamaxyz", "text": "Hi @ChaosLabs\nThe CRV proposal went live yesterday on Polygon v3 and the Supply Cap is at 100% utilisation within 24hours.\n\nScreenshot 2023-03-16 at 19.18.381694×680 77.2 KB\n\nThe stMATIC Supply Cap was recently increased, a couple of days ago, and during this time the utilisation has increased from 50% to 70% without incentives. LDO rewards are expected to start imminently. If it is possible to increase this cap ahead of the LDO rewards distribution starting, can we do so ?\n\nScreenshot 2023-03-16 at 19.20.552006×994 95.3 KB\n\nIf we can not increase the stMATIC Supply Cap just now and the utilisation continues to increase, then this will discourage LDO incentives from being distributed across the stMATIC reserve and without sufficient deposit capacity, it will likely become a blocker to starting the LDO reward distribution.\nGiven the time it takes to implement an AIP on Polygon, it is best to be early and proactive with this particular change.", "reads": 33, "readers_count": 32, "created": "2023-03-16T19:29:12.101Z"}, {"topic_id": 12310, "post_id": 28830, "post_number": 3, "score": 39.8, "author_username": "ChaosLabs", "text": "thanks @Llamaxyz.\nWe do not recommend increasing the supply cap for CRV in this proposal due to its low on-chain liquidity. We will analyze further and share recommendations outside the “direct to AIP” proposal here.\nRegarding stMATIC, to be proactive and given on-chain liquidity and a total circulating supply of ~45M alongside the redeemability of the token, we recommend doubling the current supply and setting a new supply cap at 21M.\n\nScreen Shot 2023-03-17 at 9.07.51 AM818×1160 52.6 KB\n\nTo summarize, we recommend the following changes to supply/borrow caps on V3 Polygon:\n\n\n\n\nAsset\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nMAI\n1,100,000\n2,200,000\n600,000\n1,200,000\n\n\nstMATIC\n15,000,000\n21,000,000\nN/A\nN/A\n\n\n\n", "reads": 24, "readers_count": 23, "created": "2023-03-17T13:09:22.158Z"}, {"topic_id": 12310, "post_id": 28848, "post_number": 4, "score": 34.2, "author_username": "seawolf", "text": "Here are Gauntlet’s Conservative and Aggressive recommendations for stMATIC via our Methodology. If the community believes it is a strategic asset, they may adopt our Aggressive calculation.\n\n\n\n\nSymbol\nCurrent Supply Cap\nConservative Cap\nAggressive Cap\nChaos Rec\n\n\n\n\nstMATIC\n15,000,000\n13,538,000\n22,563,000\n21,000,000\n\n\n\n", "reads": 21, "readers_count": 20, "created": "2023-03-17T22:06:08.396Z"}, {"topic_id": 12310, "post_id": 28941, "post_number": 5, "score": 3.8, "author_username": "ChaosLabs", "text": "We have published AIP-186 for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 19, "readers_count": 18, "created": "2023-03-20T15:35:15.327Z"}], [{"topic_id": 12309, "post_id": 28908, "post_number": 2, "score": 36.0, "author_username": "ChaosLabs", "text": "Due to the high utilization of the borrow cap, we have updated this proposal to increase the borrow cap by 2X (rounded up) to 400 wstETH\n\nScreen Shot 2023-03-19 at 5.11.48 PM1654×1176 71.7 KB\n", "reads": 30, "readers_count": 29, "created": "2023-03-19T21:12:10.239Z"}, {"topic_id": 12309, "post_id": 28940, "post_number": 3, "score": 24.0, "author_username": "ChaosLabs", "text": "We have published AIP-186  for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 20, "readers_count": 19, "created": "2023-03-20T15:34:14.664Z"}], [{"topic_id": 12099, "post_id": 28390, "post_number": 2, "score": 33.6, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on.\nStart Date: Tuesday, Mar 7, 2023, 12:00 PM\nEnd Date: Wednesday, Mar 10, 2023, 12:00 PM\nThank you in advance for your participation in the vote.", "reads": 18, "readers_count": 17, "created": "2023-03-06T17:19:29.356Z"}, {"topic_id": 12099, "post_id": 28790, "post_number": 3, "score": 32.8, "author_username": "ChaosLabs", "text": "Due to the weekend events and the de-peg of USDC and DAI, we are reevaluating this proposal and will not proceed to an on-chain vote.\nA future proposal for amending the risk parameters will be posted separately and go through the complete governance process.", "reads": 14, "readers_count": 13, "created": "2023-03-16T18:17:48.751Z"}], [{"topic_id": 12289, "post_id": 28749, "post_number": 2, "score": 3.4, "author_username": "ChaosLabs", "text": "We have published AIP-181  for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 17, "readers_count": 16, "created": "2023-03-15T17:47:16.724Z"}], [{"topic_id": 12015, "post_id": 28136, "post_number": 2, "score": 4.8, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on.\nStart Date: Tuesday, Feb 28, 2023, 2:00 PM\nEnd Date: Friday, Mar 3, 2023, 2:00 PM\nThank you in advance for your participation in the vote.", "reads": 24, "readers_count": 23, "created": "2023-02-27T19:00:37.063Z"}, {"topic_id": 12015, "post_id": 28664, "post_number": 3, "score": 17.8, "author_username": "ChaosLabs", "text": "Due to the weekend events and the de-peg of USDC and DAI, we are reevaluating this proposal and will not proceed to an on-chain vote.\nA future proposal for amending the risk parameters will be posted separately and go through the complete governance process.", "reads": 14, "readers_count": 13, "created": "2023-03-13T15:48:00.929Z"}], [{"topic_id": 11948, "post_id": 27956, "post_number": 2, "score": 4.4, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on, starting in 24h.\nThank you in advance for your participation in the vote.", "reads": 22, "readers_count": 21, "created": "2023-02-22T15:23:06.161Z"}, {"topic_id": 11948, "post_id": 28424, "post_number": 3, "score": 8.2, "author_username": "ChaosLabs", "text": "We have published AIP-174 for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 16, "readers_count": 15, "created": "2023-03-07T16:53:41.051Z"}], [{"topic_id": 11986, "post_id": 28047, "post_number": 2, "score": 55.4, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on.\nStart Date: Saturday, Feb 25, 2023, 8:00 PM\nEnd Date: Wednesday, Mar 1, 2023, 10:00 AM\nThank you in advance for your participation in the vote.", "reads": 27, "readers_count": 26, "created": "2023-02-24T22:05:22.189Z"}, {"topic_id": 11986, "post_id": 28090, "post_number": 3, "score": 10.4, "author_username": "Michigan_Blockchain", "text": "Thanks, @ChaosLabs! We appreciate seeing the position analysis in addition to the simulation results. One quick question: how is the \"overall chain trading volume (~$142M) calculated? Is the sum of the trading volumes on all DEXes on Arbitrum?\n\n\n\n ChaosLabs:\n\nGenerally, the TVL in Aave on Arbitrum (98M$) compared to the overall chain trading volume (~$142M /daily over the past three months) should allow on-chain liquidity sources to absorb liquidations across the Arbitrum positions.\n\n\nBest,\nGuangye from Blockchain at Michigan", "reads": 27, "readers_count": 26, "created": "2023-02-26T21:16:08.600Z"}, {"topic_id": 11986, "post_id": 28130, "post_number": 4, "score": 19.4, "author_username": "ChaosLabs", "text": "Hi Guangye! Yes, the overall trading volume was calculated as the sum of trading volumes on all Arbitrum DEXes. We used it here as a high-level measure to compare it to the TVL on Aave.", "reads": 22, "readers_count": 21, "created": "2023-02-27T16:40:03.547Z"}, {"topic_id": 11986, "post_id": 28388, "post_number": 5, "score": 3.8, "author_username": "ChaosLabs", "text": "We have published AIP-171 for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 19, "readers_count": 18, "created": "2023-03-06T15:51:55.627Z"}], [{"topic_id": 12048, "post_id": 28069, "post_number": 2, "score": 99.2, "author_username": "Pauljlei", "text": "Following the community poll on risk preference, Gauntlet is conducting updated analysis on borrow/supply caps. Gauntlet’s recommendations differ from Chaos’s numbers above, but to avoid community confusion, below are a few points:\n\nGauntlet’s recommendations on the stablecoins above differ from Chaos’s numbers. We will follow up with more fine-tuning of the caps, but we do not want to block on these stablecoin recs in the meantime.\nFor Polygon V3, Chaos’s recs for WETH and AAVE are riskier than Gauntlet’s Conservative recommendation but within Gauntlet’s Aggressive calculation. Please see here for Gauntlet’s methodology. Thus, our research shows that if the community has an aggressive (higher-risk) preference, then the community may wish to increase the caps on WETH and AAVE to allow more growth.\n\nThe table below shows Gauntlet’s Conservative and Aggressive supply cap calculations.\n", "reads": 46, "readers_count": 45, "created": "2023-02-25T21:06:35.992Z"}, {"topic_id": 12048, "post_id": 28182, "post_number": 4, "score": 68.0, "author_username": "ChaosLabs", "text": "Following the community vote on risk preferences regarding caps on Aave V3, we have updated our supply and borrow cap methodology to add a Supply Cap upper bound of 50% of the total circulating supply for all assets. This is done to protect from the concentration of on-chain liquidity on Aave.\nTo reduce governance overhead and not create additional proposals, we would like to add the following supply and borrow caps updates to this proposal.\nAccepting these changes will lead to freezing supply for the following assets:\n\nBTC.b, WBTC.e (V3 Avalanche)\nAAVE , WBTC  (V3 Optimism)\nAAVE (V3 Arbitrum)\n\n\n\n\n\nNetwork\nAsset\nCurrent Supply\nCurrent Supply Cap\nTotal Circulating Supply\nRecommended Supply Cap\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nAvalanche\nBTC.b\n3,950\n5,800\n6,984\n3,500\n3,190\n1,900\n\n\nAvalanche\nWBTC.e\n1,340\n5,233\n2,770\n1,400\nNo Cap\n770\n\n\nAvalanche\nWETH\n22,960\n113,000\n75,570\n37,500\n62,150\n20,500\n\n\nOptimism\nAAVE\n61,890\n100,000\n66,150\n33,000\nN/A\nN/A\n\n\nOptimism\nLINK\n93,050\n258,000\n317,900\n159,000\n141,900\n87,500\n\n\nOptimism\nWBTC\n636\n1,100\n1,273\n650\n605\n360\n\n\nArbitrum\nAAVE\n1,910\n2,500\n3,660\n1,850\nN/A\nN/A\n\n\n\n\nNext Steps\nAs this proposal will effectively freeze supply on several assets, we invite community feedback before posting an AIP. We are targeting an AIP in 48 hours, barring community objection.", "reads": 40, "readers_count": 39, "created": "2023-02-28T18:16:27.603Z"}, {"topic_id": 12048, "post_id": 28191, "post_number": 5, "score": 92.6, "author_username": "Pauljlei", "text": "It is nice to see Chaos updating their methodology to incorporate elements that have been included in Gauntlet’s borrow/supply cap methodology, such as 50% of circulating supply.\n\n\n\n ChaosLabs:\n\nwe have updated our supply and borrow cap methodology to add a Supply Cap upper bound of 50% of the total circulating supply for all assets.\n\n\n\n\n\nGauntlet Methodologies - Borrow and Supply Cap\n\nNon-stablecoin: Take the minimum value of\n\nMinimum supplied tokens needed to break even in a long attack\n10 * 2% aggregate liquidity across all centralized and decentralized sources\n50% * average daily volume across all centralized and decentralized sources\n50% of the circulating token supply on-chain\n\n\n\nAs mentioned above, Gauntlet has been working on updated borrow/supply cap recommendations. We posted them here.\nGiven that Chaos’s methodology now incorporates a cap of 50% of circulating supply, several of Chaos recs are similar to Gauntlet’s. However, there are important areas where our recommendations diverge (WBTC, AVAX, etc.).\nAs we mentioned, we are happy to collaborate with Chaos on this set of recommendations. We wish to incorporate our option so that the community may choose transparently. We can provide a summary of the key differences so that the community can have the clarity to make an informed decision.\nAs such, instead of going direct to AIP, it may be best to first do a Snapshot vote (swiftly, of course) to decide between the two options and then fast-follow with an AIP. We are also open to hearing other alternatives from Chaos or the community.", "reads": 38, "readers_count": 37, "created": "2023-03-01T01:39:37.980Z"}, {"topic_id": 12048, "post_id": 28193, "post_number": 6, "score": 77.4, "author_username": "ChaosLabs", "text": "To reduce governance overhead and not delay the implementation of the changes (including the update for Arbitrum and Polygon) any further, we propose the following:\n\nOptimism\nAs both proposals are very similar, we suggest going straight to AIP with a joint proposal, updating Chaos’ original recommendations while incorporating Gauntlet’s recommendations for LINK, WBTC, and AAVE.\n\n\nLINK\n\nBoth proposals have almost the same Supply Cap. We recommend incorporating Gauntlets’ recommendations as their suggested Borrow cap is slightly more conservative while still allowing room for significant borrowing (<10% utilization)\n\n\n\nWBTC\n\nWe recommend incorporating Gauntlets’ recommendations as their suggested Supply and Borrow caps are slightly more conservative while allowing room for significant borrowing (<10% utilization). Both proposals effectively freeze the supply.\n\n\n\nAAVE - both proposals effectively freeze supply.\n\n\nWe will continue monitoring these markets and propose updated supply caps with changing market conditions.\n\nRecommendations:\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nDAI\n2,620,000\n2,000,000,000\n25,000,000\n1,210,000\nN/A\n16,000,000\n\n\nsUSD\n1,510,000\n20,000,000\nNo Change\n783,150\nN/A\n13,000,000\n\n\nUSDC\n48,510,000\n2,000,000,000\n150,000,000\n15,870,000\nN/A\n100,000,000\n\n\nUSDT\n3,880,000\n2,000,000,000\n25,000,000\n3,100,000\nN/A\n16,000,000\n\n\nAAVE\n61,890\n100,000\n45,000\nN/A\nN/A\nN/A\n\n\nLINK\n93,050\n258,000\n160,000\n10,661\n141,900\n84,000\n\n\nWBTC\n636\n1,100\n620\n21\n605\n250\n\n\n\n\nAvalanche\nA deciding Snapshot vote with two options for the community to vote on.\n\n\nBoth options will have the same recommendations for stables (DAI, FRAX, MAI, USDC, and USDT), AAVE, and LINK - as proposed in the original post.\n\n\nWETH - As the supply cap is almost identical, we recommend incorporating Chaos Labs’ borrow cap recommendation as it is more conservative while still allowing room for significant borrowing (~17% utilization).\n\n\nWAVAX - incorporate Gauntlets’ recommendations.\n\n\nLet the community decide between the following options for BTC.b and WBTC.e:\n\nAggressive - the higher supply and borrow cap between the two options.\nConservative - the lower supply and borrow cap between the two options.\n\n\n\nIt is important to note that for BTC.b, both proposals effectively freeze new supply.\n\n\n\nRecommendations :\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nDAI\n12,260,000\n2,000,000,000\n30,000,000\n6,480,000\nN/A\n20,000,000\n\n\nFRAX\n16,260\n50,000,000\n1,500,000\n15,281\n2,000,000\n1,000,000\n\n\nMAI\n113,620\n50,000,000\n700,000\n103,660\n2,000,000\n460,000\n\n\nUSDC\n156,940,000\n4,000,000,000\n250,000,000\n97,960,000\nN/A\n175,000,000\n\n\nUSDT\n52,450,000\n2,000,000,000\n200,000,000\n35,930,000\nN/A\n140,000,000\n\n\nAAVE\n3,860\n4,500\n5,800\nN/A\nN/A\nN/A\n\n\nLINK\n294,870\n353,000\n440,000\n5,750\n220,000\nNo Change\n\n\nWETH\n22,960\n113,000\n38,000\n3,438\n62,150\n20,500\n\n\nWAVAX\n2,890,000\n13,100,000\n3,800,000\n1,040,000\nNo Cap\n1,200,000\n\n\n\n\nOption 1 - Aggressive\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nNotes\n\n\n\n\nBTC.b\n3,950\n5,800\n3,500\n364\n3,190\n1,900\nfreezes supply\n\n\nWBTC.e\n1,340\n5,233\n2,000\n223\nNo Cap\n1,100\n\n\n\n\n\nOption 2- Conservative\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nNotes\n\n\n\n\nBTC.b\n3,950\n5,800\n3,000\n364\n3,190\n900\nfreezes supply\n\n\nWBTC.e\n1,340\n5,233\n1,400\n223\nNo Cap\n770\n\n\n\n\n", "reads": 37, "readers_count": 36, "created": "2023-03-01T05:28:11.610Z"}, {"topic_id": 12048, "post_id": 28196, "post_number": 7, "score": 61.8, "author_username": "Pauljlei", "text": "Thanks, @ChaosLabs.\nFor Optimism recs: given that this updated proposal incorporates Gauntlet’s recommendations on LINK, WBTC, and AAVE as well as the other recommendations we posted here, this plan sounds good to us.\nFor Avalanche recs: given that this incorporates Gauntlet’s rec on WAVAX, and given that both the Aggressive and Conservative options have effectively the same impact (freeze supply), this plan sounds good to us.", "reads": 34, "readers_count": 33, "created": "2023-03-01T05:54:32.904Z"}, {"topic_id": 12048, "post_id": 28244, "post_number": 8, "score": 36.8, "author_username": "ChaosLabs", "text": "Thanks Gauntlet (@Pauljlei), for the collaboration on this proposal.\nWe have published the following Snapshot for the community to vote on the preferred set of updates for V3 Avalanche - conservative or aggressive as shown here.\nStart Date: Thursday, Mar 2, 2023, 3:00 PM\nEnd Date: Sunday, Mar 5, 2023, 3:00 PM\nWe will follow up soon with links for the AIP for the updates of Optimism, Arbitrum and Polygon.", "reads": 34, "readers_count": 33, "created": "2023-03-01T20:30:40.974Z"}, {"topic_id": 12048, "post_id": 28387, "post_number": 9, "score": 10.0, "author_username": "ChaosLabs", "text": "We have published AIP-170 for community members to vote on, starting in 24h.\nThank you in advance for your participation in the vote.\nIn addition, the Snapshot for supply and borrow caps updates on V3 Avalanche has ended with the community choosing the aggressive option. These changes will be implemented via the Aave Guardian process. Thank you to all who participated in the vote.", "reads": 25, "readers_count": 24, "created": "2023-03-06T15:51:13.063Z"}], [{"topic_id": 11603, "post_id": 27615, "post_number": 2, "score": 193.0, "author_username": "Pauljlei", "text": "Thanks, @ChaosLabs. Our risk analysis did not yield a strong view on the proposed LINK or WAVAX changes. However, we did want to flag the changes for BTC.b and WETH.e. Gauntlet cautions against increasing LT/LTV for BTC.b and decreasing the LT/LTV for WETH.e.\n\nGauntlet Recommendations\nGauntlet’s analysis disagrees with increasing LT/LTV for BTC.b and decreasing the LT/LTV for WETH.e. Given that in this instance, the current supply for BTC.b (3700) has considerably exceeded both Gauntlet’s conservative (900) and aggressive caps (2800), increasing the LT for BTC.b and decreasing the LT for WETH.e adds risk to less liquid / whale-concentrated assets, decreases the borrowing power of safer and more liquid assets on Avalanche, and has negligible impact on increased borrows and protocol revenue.\n\nIn the event borrow usage increases disproportionately, the onchain liquidity for these collateral assets may not be able to support their liquidation potential.\nThese assets’ borrow usage suggests these LT changes will have a negligible impact on protocol revenue (~$925).\n\nAnalyzing onchain liquidity provides insight into the risks here. Suppose borrow usage with these assets as collateral actually increases disproportionately (a tail risk that we aim to protect against). Consider the event in which the largest suppliers for each asset decide to maximally borrow against their collateral (which is a possible, permissible action in the protocol). Essentially, we aim to evaluate the ‘potential harm’ this user may cause. Consider the slippage that results from a liquidation sized at this max borrow, adjusted for the initial close factor of 50%.\n\nBTC.b, largest supplier 0xd275e5cb559d6dc236a5f8002a5f0b4c8e610701\n$28.6mm → max borrow, adjusted for close factor is ~$10mm\n(Also note that 60% of BTC.b supply is on Aave)\n\n\n\nWETH, largest supplier $9mm → max borrow, adjusted for close factor is ~$3.3mm\n\n\nAs shown above, the slippage for BTC.b is meaningfully higher than WETH.e for the respective largest suppliers.\nEven though the marginal slippage corresponding to respective LT increases of 3% of the current supply may be acceptably small, BTC.b has the latent potential to become a high VAR asset due to the strong whale presence. Moreover, 60% of the BTC.b circulating supply on Avalanche is supplied in Aave already.\nThe largest historical liquidations on Aave v3 Avalanche have been < $200k in size. Gauntlet is researching the distribution of liquidations that use on-chain liquidity vs. liquidations that use global liquidity. Until we find sufficient evidence to the contrary, we should not assume a larger base of liquidity (global liquidity) for potential large liquidations that have never historically happened before and should rely solely on on-chain liquidity.\nNext, let’s analyze the borrow usage (taken from the Chaos dashboard, as of ~2/12/2023)-\n\nWETH.e has borrow usage of 46%, BTC.b has 37.8%, LINK.e has 26.5%, WAVAX has 13.8%.\n\nAfter adjusting for asset CF -\n\nWETH.e has borrow usage of 47%, BTC.b has 45%, LINK.e has 34%, WAVAX has 15%.\n\nSome of the supplied collateral is unproductive, as in changes to the LT should not rationally impact borrower behavior -\n\nFor instance, roughly 30% of BTC.b borrow is recursive - any additional BTC.b borrow with BTC.b supply is not profitable relative to nonrecursive borrowing. So rationally, this BTC.b supply would not have new associated borrow and is thus non productive.\n\nAssuming users will maintain their (debt / max debt) ratio, where max debt is the maximum debt they can take on with their current supply, we find that the BTC.B LT change could increase borrows by roughly $900k, while the WETH.e LT change decreases borrows by $525k. This is the breakdown by debt (borrow) asset when aggregated together -\n\nwhich is roughly $370k increase in borrows. At current variable borrow rates of roughly 2.5%, with a 10% RF, this amounts to ~$925 in added protocol revenue per year.\n\nTLDR;\nUltimately, increasing LT of BTC.b while decreasing the LT of WETH.e enables excess risk to less liquid / whale-concentrated assets and only has a small potential benefit on protocol revenue.", "reads": 40, "readers_count": 39, "created": "2023-02-14T18:54:08.208Z"}, {"topic_id": 11603, "post_id": 27694, "post_number": 3, "score": 81.4, "author_username": "ChaosLabs", "text": "Thanks, @Pauljlei, for sharing Gauntlet’s detailed analysis.\nThis analysis highlights an important topic: assumptions around future user behavior and risk amongst markets that are “whale-concentrated.”\nWe believe that “whale-centric” liquidity distribution across different networks is common enough to warrant a discussion regarding the community’s appetite for risk.\nWe are proponents of selecting the risk-off approach in any dilemma while driving discussions that solicit community feedback. Therefore, as the proposed changes for BTC.b and WETH.e in this batch of recommendations have a small impact on protocol revenue, we will omit these assets and revisit them after gauging the community’s risk appetite and assumption preferences.\nWe will move forward with a Snapshot vote to update the risk parameters for LINK.e and WAVAX, as presented in the table in the original post.", "reads": 32, "readers_count": 31, "created": "2023-02-16T00:37:47.956Z"}, {"topic_id": 11603, "post_id": 27696, "post_number": 4, "score": 6.4, "author_username": "ChaosLabs", "text": "We have published a Snapshot for the community to vote on, starting in 24h.\nThank you in advance for your participation in the vote.", "reads": 32, "readers_count": 31, "created": "2023-02-16T01:08:49.781Z"}, {"topic_id": 11603, "post_id": 27922, "post_number": 5, "score": 19.6, "author_username": "ChaosLabs", "text": "The Snapshot vote for this proposal has passed with 561K YAE votes.\nAs there is no on-chain vote for V3 Avalanche, this proposal will be executed via the Aave Guardians.", "reads": 23, "readers_count": 22, "created": "2023-02-21T13:37:28.660Z"}], [{"topic_id": 10925, "post_id": 25220, "post_number": 2, "score": 32.6, "author_username": "ghostlyenergy", "text": "Thank you, @ChaosLabs for sharing this methodology. Borrow caps on V3 market assets are a key risk management tool and I am looking forward to their widespread use.\nThis methodology seems reasonable as a first step. I imagine in the future we will also be able to incorporate the liquidity of the asset and its trading pairs when determining borrow (and supply) caps as the V3 markets grow in both maturity and value.", "reads": 63, "readers_count": 62, "created": "2022-12-07T19:51:40.566Z"}, {"topic_id": 10925, "post_id": 25258, "post_number": 3, "score": 16.6, "author_username": "GCao", "text": "Thank you @ChaosLabs for the proposal! This is Guangye from Blockchain at Michigan. We like the overall intuition of the borrow cap methodology. We are wondering how the parameters 0.7 and 0.1 were determined? Were they based on simulations?", "reads": 58, "readers_count": 57, "created": "2022-12-08T16:09:58.008Z"}, {"topic_id": 10925, "post_id": 25262, "post_number": 4, "score": 26.0, "author_username": "ChaosLabs", "text": "Thanks @GCao for the question. The parameters were not determined by simulations but chosen as initial buffers for the following purposes:\n\nThe 0.1 parameter is utilized in the Level 1 cap, where the current supply is relatively low, as a buffer to allow for room for additional borrowing beyond the UOptimal point, in case of high demand and until the supply cap is raised.\nThe 0.7 parameter is utilized in the Level 2 cap, where the current supply (at the time of amending the cap) is close to the supply cap. The buffer is in place to ensure sufficient liquidity for suppliers to withdraw their positions in case of surging demand from borrowers.\n\nWe intend to continuously iterate and refine the methodology based on market research, protocol usage, and community feedback.", "reads": 55, "readers_count": 54, "created": "2022-12-08T17:08:52.466Z"}, {"topic_id": 10925, "post_id": 25593, "post_number": 5, "score": 29.0, "author_username": "miguelmtz", "text": "Thanks for sharing! I believe the community needs to agree on a framework or methodology to set supply and borrow caps asap, so I would love to get input from other contributors!\nTwo questions that came to my mind:\n\nIs a good idea to adjust the borrow cap primarily based on the UOptimal value? It’s the IR’s purpose to drive liquidity of the pool, not the borrow cap imo.\nBorrow cap should be based primarily on market liquidity, contracts risks, asset maturity, bridges risk, etc.\n", "reads": 45, "readers_count": 44, "created": "2022-12-19T17:44:10.023Z"}, {"topic_id": 10925, "post_id": 25771, "post_number": 6, "score": 33.2, "author_username": "Benjamin918", "text": "Great to see this published for the community to see! Should we expect follow up proposals to adjust current markets?", "reads": 41, "readers_count": 40, "created": "2022-12-22T21:52:03.611Z"}, {"topic_id": 10925, "post_id": 25832, "post_number": 7, "score": 33.0, "author_username": "ChaosLabs", "text": "Absolutely. Our first proposals for supply and borrow caps were mainly for uncapped assets. We are constantly monitoring the markets and the utilization on Aave and will propose amendments to the caps accordingly.", "reads": 40, "readers_count": 39, "created": "2022-12-25T13:31:45.381Z"}, {"topic_id": 10925, "post_id": 28276, "post_number": 8, "score": 20.4, "author_username": "jkrivine", "text": "Great topic! Thanks for bringing this up.\nCurrently the inconsistent use of borrow cap prevents us from easily integrating AAVE to our solution (https://www.mangrove.exchange/).\nOur use case is the following: Mangrove is an order book in which liquidity providers can have offers that pull their funds from an arbitrary source, for instance AAVE, whenever matched by a market order. The absence of borrow cap makes it possible for an attacker to make an AAVE based offer fail by drying up the pool using a flashloan (external to aave) + supply + borrow of the whole asset supply. So a borrow cap preventing AAVE insolvency within the block would prevent this.\nThe suggested simple formula above would do the trick in the most realistic cases I believe.", "reads": 27, "readers_count": 26, "created": "2023-03-02T20:11:31.577Z"}], [{"topic_id": 11904, "post_id": 27896, "post_number": 2, "score": 14.2, "author_username": "ChaosLabs", "text": "We have published a Snapshot  for the community to vote on, starting February 21 at 8 pm EST.\nAs there is no on-chain vote for V3 Avalanche, if the Snapshot passes, this proposal will be executed via the Aave Guardians.\nhttps://snapshot.org/#/aave.eth/proposal/0xc4fc70d893c53a28df55fd66264458f1c693770201b4f83cf784bb66ee83044a", "reads": 21, "readers_count": 20, "created": "2023-02-21T05:11:10.179Z"}], [{"topic_id": 11622, "post_id": 27751, "post_number": 2, "score": 46.2, "author_username": "seawolf", "text": "Gauntlet wants to notify the community of a new whale supply position for asset BUSD on Aave v2 ETH that open up yesterday after a forum post to freeze the BUSD market hit the forums. We will continue to monitor, but wanted to share this information about the position:\n\nAddress: 0x542dd5e19d5f044ac0d845b785b4e40f1df67dc4\nSize of Borrow Position (USD): $3.06M\nBorrow Usage: 0\n\nUntitled (20)1838×964 45 KB\n\n\n", "reads": 31, "readers_count": 30, "created": "2023-02-17T00:14:11.033Z"}, {"topic_id": 11622, "post_id": 27877, "post_number": 3, "score": 84.8, "author_username": "seawolf", "text": "We want to notify the community of a large whale position near liquidation on Aave v2 ETH. This user has a health factor of 1.02 with an outstanding borrow position of $17M in WBTC. We notified the community of this account last month via this forum post. We are continuing to monitor, but we wanted to share this information about the client:\n\n\nAddress: 0x60ee8465dc43245c6c2989b1089e476d3a0a717d\n\n\nPosition of User:\n\nUntitled (21)2938×794 154 KB\n\n\n\nBorrow Usage:\n\nUntitled (22)1446×774 38.1 KB\n\n\n\nUser has updated their position over time by increasing their USDC from 2.2M to 3.0M on Feb 16th to counteract market movements.\n\n\n\nUntitled (23)1462×780 64.5 KB\n", "reads": 24, "readers_count": 23, "created": "2023-02-20T17:09:06.977Z"}, {"topic_id": 11622, "post_id": 28064, "post_number": 4, "score": 28.8, "author_username": "seawolf", "text": "Liquidation > $100k on Aave v2 ETH\nGauntlet would like to notify the Aave community of a $114k liquidation on Aave V2. The account was using collateral of USDC/WETH to borrow USDT/WETH/USDC.\nIn particular, no insolvency occurred from this liquidation event.\n\nAddress: 0xe34a3aa2032af0279f8fd024b4930e55c63c4c08\n\n\nTransaction for liquidation.\nLiquidation Amount: 113432.87 USDC\nRepay Amount: 106836.28 USDT\n\nUntitled (24)2892×774 157 KB\n\n\n\n\nUntitled (25)1438×760 37.5 KB\n\nSupply Balances since Feb 1st:\n\nUntitled (26)1426×752 43 KB\n", "reads": 19, "readers_count": 18, "created": "2023-02-25T16:21:37.834Z"}, {"topic_id": 11622, "post_id": 28065, "post_number": 5, "score": 94.6, "author_username": "seawolf", "text": "\nWETH Borrow Whale Position\nGauntlet wants to notify the community of a whale borrow position for asset WETH on Aave v2 ETH. This account’s position represents 51% of WETH borrow balances. The position is highly collateralized with 3.5 health factor. We will continue to monitor, but wanted to share this information about the position:\n\nAddress: 0x777777c9898d384f785ee44acfe945efdff5f3e0\n\nSize of Borrow Position (USD): $73.4M\nHealth Factor/Borrow Usage: 3.50/29%\nWETH Borrow Concentration: 51%\n\nUntitled (27)2892×760 175 KB\n\n\n\n\nUntitled (28)1438×756 38.3 KB\n\nAddress had been increasing their WETH Borrow position since Feb 20th.\n\nUntitled (29)1426×766 49 KB\n", "reads": 23, "readers_count": 22, "created": "2023-02-25T16:23:15.348Z"}, {"topic_id": 11622, "post_id": 28177, "post_number": 6, "score": 64.6, "author_username": "Pauljlei", "text": "\nGauntlet Borrow/Supply Cap Market Update\nGauntlet would like to notify the community that asset BAL supply cap utilization has reached 81% on Polygon V3.\n\nAsset: BAL on Polygon V3\nSupply Cap:  361.00K ($2.6M)\nSupply Amount: 289.56K ($2.08M)\n\n\nGauntlet will continue to monitor the market. The cap was recently increased to 361k on Feb 22nd, and we do not recommend any further increase to the cap at this time, based on the current market supply relative to on-chain circulating supply.", "reads": 23, "readers_count": 22, "created": "2023-02-28T17:35:42.758Z"}, {"topic_id": 11622, "post_id": 28246, "post_number": 7, "score": 49.2, "author_username": "seawolf", "text": "\nGauntlet Borrow/Supply Cap Market Update\nGauntlet wants to notify the community of these assets supply and borrow cap usage:\n\n\nAsset: Aave on Arbitrum V3\n\n\nSupply Cap Usage: 76%\n\n\nSupply Cap:  2.5K ($203.75K)\n\n\nSupply Amount: 1.91K ($156k)\n\nUntitled (30)2256×762 41 KB\n\n\n\nAsset: GHST on Polygon v3\n\n\nSupply Cap Usage: 77%\n\n\nSupply Cap:  5.88M ($8.75M)\n\n\nSupply Amount : 4.58M ($6.1M)\n\nUntitled (31)2262×762 34.5 KB\n\n\n\nAsset: SUSHI Polygon v3\n\n\nSupply Cap Usage: 81%\n\n\nSupply Cap:  226.67K ($301k)\n\n\nSupply Amount : 299.32K ($397k)\n\nUntitled (32)2262×772 36.1 KB\n\n\n\nAsset: SUSHI Polygon v3\n\n\nBorrow Cap Usage: 79%\n\n\nBorrow Cap:  80K ($106k)\n\n\nBorrow Amount : 102.48K ($136k)\n\nUntitled (33)2270×758 50.3 KB\n\n\n\nGauntlet is analyzing and will let the community know of any next steps.", "reads": 21, "readers_count": 20, "created": "2023-03-01T21:44:16.119Z"}], [{"topic_id": 11276, "post_id": 26471, "post_number": 2, "score": 52.2, "author_username": "projection_finance", "text": "Hello, I hope you are well!\nWe open the alpha of https://www.projection.finance this afternoon.\nFor the moment it allows to make projections on Aave v3 Avalanche, soon all v3 and then other protocols!\nWe’ll send an email to all those who registered via the landing typeform, don’t hesitate to mp me if you want more info, there is a test address so even if you don’t have positions on Aave v3 Avalanche you can test", "reads": 11, "readers_count": 10, "created": "2023-01-20T10:37:41.277Z"}], [{"topic_id": 11159, "post_id": 26481, "post_number": 2, "score": 62.6, "author_username": "ccb_roci", "text": "First class breakdown by @ChaosLabs of the key inputs and simulation results that generated their parameter recommendations!\nLayering on an additional piece of analysis for the stETH borrower used as an example for setting a low borrow cap of 3,000 stETH.\nBorrower 0x94269a09c5fcbd5e88f9df13741997bc11735a9c has a strong RociFi credit score - 3.\nKey drivers are historical activity across all of DeFi – not just Aave – include:\n\n68 borrows, all-time\n$588M in total borrows, all-time\nWallet age of 297 days\n$271M in total debt repaid, all-time\n255 repays, all-time\nZero liquidations, all-time\n\nThe borrowers current health factor is 1.15 which could be better, but given their history they seem unlikely to let their position devolve into liquidation; even under bad market conditions. This user level insight could enable a gradual relaxation of supply caps over-time, in theory.", "reads": 38, "readers_count": 37, "created": "2023-01-20T16:16:27.431Z"}], [{"topic_id": 11213, "post_id": 25941, "post_number": 2, "score": 460.6, "author_username": "ChaosLabs", "text": "After reviewing the post, we wanted to share our reservations about the proposed recommendation and share our analysis before Gauntlet moves forward with an AIP.\nMoving forward, we’d appreciate if Gauntlet could share their analysis before posting to avoid community confusion, as already discussed on several threads.\nAfter looking into the state of AAVE token supply on Optimism, we have identified that the current supply of AAVE tokens on the v3 Optimism market (~88K) significantly exceeds the available liquidity on Optimism.\nThe high exposure is mainly due to a single position that accounts for 87% of the supply (~79K of ~88K)\nFollowing our Supply Cap Methodology, we recommend setting the AAVE token on Optimism at 14K,  based on the current liquidity levels on Optimism (detailed analysis below)\nWe are aware that setting a supply cap below the current supply is not the best practice. However, the current state is a market distortion that was caused as a result of there being no cap for AAVE on Optimism. Practically, if this single position highlighted above were to be closed, the recommended supply cap would be around 40% above the current supply, which is very reasonable from a usability perspective.\n\nAnalysis of AAVE token supply on Optimism\nWhen observing the accounts that supply AAVE tokens to AAVE V3 on Optimism we have identified a single account supplied 79k AAVE position, 87% of total supply, at current health of  ~1.6.\n\nAAVEOPT11430×884 146 KB\n\n\nThe approach to setting the supply cap for AAVE tokens on Optimism\nThis amount cannot be liquidated with the current AAVE liquidity on Optimism. While this account is an active, healthy account, it is still a risk for the protocol that should have been avoided had supply caps been in place.  Therefore, the approach we took was to set the supply cap using the methodology according to the distribution of the other accounts, excluding the account with the biggest position. The reasoning behind this is that while this position is open, there is risk exposure that we cannot mitigate without forcing liquidation of the position. Therefore, the best approach would be to set appropriate risk parameters that will secure the protocol if this position is closed.\n\nAAVEOPT21334×816 143 KB\n\n\nUntitled (13)2400×1580 234 KB\n\n\nThe recommended Supply Cap\nBased on the approach described above, our simulations have produced r=0.278, which yields: (currentSupply - supply of 0x36..a8a)/r*marketCapFactor =  10k / 0.278 * 0.39 = 14K.\nOur recommendation is to set the Supply Cap for AAVE tokens on Optimism at 14K.\nWhile this cap effectively pauses AAVE supply, until the position opened by 0x36c4bd54d54dd898c242f5f634f5d0cef3be2a8a is closed, we believe it is the appropriate cap that will secure AAVE V3 on Optimism.", "reads": 53, "readers_count": 52, "created": "2023-01-01T22:46:29.473Z"}, {"topic_id": 11213, "post_id": 25964, "post_number": 3, "score": 49.4, "author_username": "fig", "text": "There are a lot of variances between these two recommendations - 100,000 vs. 14,000\nBefore heading to a vote, I’d love to see further discussions between these two managers to help the community distill which direction is best.\nAnother option is to initiate a modified Snapshot with both options:\n\n\n\nAdjust supply cap to 100,000 AAVE\n\n\nAdjust supply cap to 14,000 AAVE\n\n\nNAY - do not adjust\n\n\nAbstain\n\n\n\nWe want to ensure the proper risk management efforts are achieved promptly and hope to help facilitate this.", "reads": 47, "readers_count": 46, "created": "2023-01-03T15:40:08.813Z"}, {"topic_id": 11213, "post_id": 25969, "post_number": 4, "score": 34.4, "author_username": "ChaosLabs", "text": "Thanks for this response @fig. Effective communication between risk managers is crucial to increase community clarity and a better understanding of proposals. We have been working on a proposed framework for risk manager collaboration which we plan to post later this week for community feedback.\nRegarding the proposals:\nThe main reason for the conservative figure on our proposal is that we did not assume liquidity bridging in our methodology and recommendation - it was based solely on the current liquidity levels in Optimism.\nGiven the assumption of bridging liquidity, the recommendation made by Gauntlet is reasonable. However, the proposal needs to include on-chain data or analyses to support it, leaving us uncomfortable relying on theoretical actor rationality. We urge Gauntlet to share any supporting data used in this analysis, as this will help inform the community about this decision.\nAdditionally, if other chains are indeed considered for liquidations, what methodology or heuristic was used to determine the 100k figure? Aave is a relatively liquid asset and could be more significant than 100k if that is the approach we’re taking as a community.", "reads": 47, "readers_count": 46, "created": "2023-01-03T16:51:00.701Z"}, {"topic_id": 11213, "post_id": 25974, "post_number": 5, "score": 129.2, "author_username": "jmo", "text": "@fig I’m open to publishing a snapshot with both options, I think that will be a reasonable way to let the community weigh in here.\nHowever - as I mention in the first post - we do believe that the supply caps on Optimism could be more conservative. We’d be happy to set a lower supply cap here - our goal with this parameter update was to just limit the risk and we can fast follow with more detailed recommendations.  I don’t think 14k is crazy - though it does freeze the growth of the market as @ChaosLabs points out.\nThe issue here is that if we were to apply the same logic across the board, it would likely more or less freeze all assets on Optimism as there is not great on-chain liquidity for the other assets as well. That is to say - following the logic you delineate here, we would likely have to set lower caps for all of the assets on Optimism.\nOur goal is to propose a set of caps to the community next week that would allow the community to decide “Do we want to bet on cross-chain liquidity here?” If the answer is yes, then we can likely move forward with caps that look more like the current ones, as opposed to caps that instant freeze new deposits for assets. However, if the answer is no, then this amounts to winding down the Optimism market quite a bit, which we know was a market the community was betting on from a growth perspective.\nI’d prefer that we make this decision for the community as easy as possible. Instead of setting a conservative AAVE supply cap as a one-off, our goal was to set one quickly to limit risk increasing in the market and then follow up with conservative supply caps for all assets next week.\nThis path should make the decision making for the community as clear as possible - it’s sometimes hard for people to weigh in on individual parameters like the supply cap for one asset on one market.  Hopefully if we frame the decision more broadly it will help the community make an informed decision here.", "reads": 46, "readers_count": 45, "created": "2023-01-03T19:10:50.604Z"}, {"topic_id": 11213, "post_id": 26033, "post_number": 6, "score": 38.6, "author_username": "ChaosLabs", "text": "\n\n\n jmo:\n\nThe issue here is that if we were to apply the same logic across the board, it would likely more or less freeze all assets on Optimism as there is not great on-chain liquidity for the other assets as well. That is to say - following the logic you delineate here, we would likely have to set lower caps for all of the assets on Optimism.\n\n\nThe supply cap recommendations adopted thus far have not frozen any assets on Optimism. Most supply cap recommendations have room for growth, allowing healthy usage and market participation. Additionally, as stated in the methodology post, we can make several relaxations to enable higher caps, given the community’s desired risk appetite.\n\n\n\n jmo:\n\nI’d prefer that we make this decision for the community as easy as possible. Instead of setting a conservative AAVE supply cap as a one-off, our goal was to set one quickly to limit risk increasing in the market and then follow up with conservative supply caps for all assets next week.\n\n\nIf you plan to recommend conservative caps next week, wouldn’t it make more sense to start with a risk-off “temporary cap” rather than one that relies on the assumption of bridging liquidity? We agree that a cap should be implemented ASAP. However, since Gauntlet has yet to provide a clear framework or supporting data for this proposal, we recommend implementing the 14K supply cap we proposed for the immediate term while the community deliberates on this methodology for higher caps.\n\n\n\n jmo:\n\nOur goal is to propose a set of caps to the community next week that would allow the community to decide “Do we want to bet on cross-chain liquidity here?”\n\n\nWe look forward to your proposal next week. The discussion around setting caps and defining risk parameters should always be data-driven, and we hope to see this incorporated into a defined framework or methodology. We are eager to see your analysis on liquidity bridging, and if the community decides to adopt this concept, we will incorporate it into future versions of our methodology.\nChaos Labs has been operating transparently and sharing the considerations, constraints, and assumptions of our recommendations and methodologies. We expect the same from Gauntlet, as this approach will improve overall protocol risk management while allowing the community to make an apples-to-apples comparison when assessing methodologies and determining risk appetite.", "reads": 43, "readers_count": 42, "created": "2023-01-04T18:02:44.297Z"}, {"topic_id": 11213, "post_id": 26101, "post_number": 7, "score": 62.6, "author_username": "Pauljlei", "text": "We have moved forward with a AIP to add a supply cap to the AAVE token on V3 Optimism in order to immediately reduce tail risk without damaging user experience in the short term. The rationale is straightforward - immediately reduce long tail risk without any impact on user experience. No cap is significantly riskier than having a cap .\nThe forum thread brought up valuable points about assumptions and methodology. We look forward to iterating on that with the community moving forward, which of course, may result in adjusting the 100K cap. But in the meantime, we are biasing towards action to set a cap on a market that currently lacks a cap, while having longer discussions about assumptions in parallel.", "reads": 38, "readers_count": 37, "created": "2023-01-06T01:30:40.432Z"}, {"topic_id": 11213, "post_id": 26102, "post_number": 8, "score": 167.4, "author_username": "PennBlockchain", "text": "We’re reading the reasoning here and agree with the point of having SOME cap vs none. Whether that’s 100k or even less at 14k, whatever it is, starting with ensuring a high cap is immediately passed is critical in our opinion. We believe the 100k high cap that has been proposed is a good start and further decreasing/changes can be discussed with a “hedge” in place.", "reads": 37, "readers_count": 36, "created": "2023-01-06T04:19:39.924Z"}], [{"topic_id": 10927, "post_id": 25182, "post_number": 2, "score": 54.4, "author_username": "ChaosLabs", "text": "Link to Snapshot vote below.\nVoting period is from December 6th, 4 PM EST to December 8th, 4 PM EST.\nhttps://snapshot.org/#/aave.eth/proposal/0x944dd1c247a5a08da6d5bd59571859201fcaee53343a879a789380eeed1971da", "reads": 47, "readers_count": 46, "created": "2022-12-06T16:31:15.581Z"}, {"topic_id": 10927, "post_id": 25204, "post_number": 3, "score": 28.2, "author_username": "EzR3aL", "text": "Thats too early for a snapshot. A forum post should be at least 3 days there to be discussed before creating a snapshot for it. Not going to vote for i now.", "reads": 41, "readers_count": 40, "created": "2022-12-07T07:19:15.506Z"}, {"topic_id": 10927, "post_id": 25209, "post_number": 4, "score": 42.4, "author_username": "OriN", "text": "Hi @EzR3aL, as mentioned above, this proposal follows the Fast-track process for supply and borrow cap proposals, which allows for proposals of this nature to be put up for a Snapshot vote after being in the Governance forum for 24h.  More details on the Fast-track process can be found here.\nChaos Labs has followed the same guidelines in our previous proposal for V3 Supply Cap Recommendations for Uncapped Assets.\nWe’d be happy to answer any questions regarding this proposal and hope you could participate in this vote given this clarification.", "reads": 37, "readers_count": 36, "created": "2022-12-07T14:01:27.903Z"}, {"topic_id": 10927, "post_id": 25210, "post_number": 5, "score": 37.2, "author_username": "EzR3aL", "text": "Hey,\nmy bad i mixed it up.\nJust forget about my comment. ", "reads": 36, "readers_count": 35, "created": "2022-12-07T14:19:56.220Z"}, {"topic_id": 10927, "post_id": 25681, "post_number": 6, "score": 35.6, "author_username": "ChaosLabs", "text": "We have published the AIP to execute the changes voted on in the snapshot:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 28, "readers_count": 27, "created": "2022-12-20T21:55:05.307Z"}, {"topic_id": 10927, "post_id": 25797, "post_number": 7, "score": 25.0, "author_username": "ChaosLabs", "text": "Please note that we have discovered a minor discrepancy between the AIP payload (1,115) and the number presented in the table (1,155) on the original post for WBTC on Arbitrum. As the number in the actual payload is lower (meaning a slightly more conservative cap than originally presented), we do not recommend any further action.\nWe apologize for the honest mistake.", "reads": 25, "readers_count": 24, "created": "2022-12-24T07:06:37.766Z"}, {"topic_id": 10927, "post_id": 25958, "post_number": 8, "score": 4.0, "author_username": "kakagri", "text": "Appreciate your being upfront about it and reacting before it was executed, look forward to a rigorous process for all risk contributors coming out of this.", "reads": 20, "readers_count": 19, "created": "2023-01-03T12:45:24.495Z"}], [{"topic_id": 10926, "post_id": 25226, "post_number": 2, "score": 24.4, "author_username": "ChaosLabs", "text": "Link to Snapshot vote below.\nVoting period is from December 8th, 7 PM EST to December 11th, 7 PM EST.\nhttps://snapshot.org/#/aave.eth/proposal/0xd706dfcb631076d5e835e0640d120b8de333d31ef30f66e3dbb529a380608ea1", "reads": 47, "readers_count": 46, "created": "2022-12-08T03:58:36.644Z"}, {"topic_id": 10926, "post_id": 25322, "post_number": 3, "score": 29.4, "author_username": "Nandy.eth", "text": "Although I wanted Aave risk management act safely and I’m don’t directly subject of these liquidations, I wanted to applause the revue and report of the user possible liquidation. I think taken into account in analysis the consequence of lowering Liquidation Threshold regarding liquidation is a key to keep Aave safe for borrower user. As lowering LTV and freeze is a mechanism who protect lenders and Aave stackers.", "reads": 47, "readers_count": 46, "created": "2022-12-11T01:55:41.075Z"}, {"topic_id": 10926, "post_id": 25323, "post_number": 4, "score": 24.2, "author_username": "Nandy.eth", "text": "By the way series of incremensal decreases prepend by public communication seems good practice", "reads": 46, "readers_count": 45, "created": "2022-12-11T01:58:54.317Z"}, {"topic_id": 10926, "post_id": 25601, "post_number": 5, "score": 42.2, "author_username": "ChaosLabs", "text": "Following the snapshot vote, we plan to submit an AIP in the coming days with the following suggested amendments:\n\n\n\n\nAsset\n\nLT\n\nLTV\n\n\n\n\n$ENS\n\n60% → 57%\n\n50% → 47%\n\n\n$MKR\n\n70% → 67%\n\n65% → 62%\n\n\n$SNX\n\n65% → 62%\n\n49% → 46%\n\n\n$CRV\n\n61% → 58%\n\n55% → 52%\n\n\n\nTo minimize liquidations, we will update this thread daily (until the proposal is executed) with a list of accounts at risk of being liquidated due to the change. Please note that given changes in market prices, the number of accounts on this list may change daily.\nIn addition, we will be utilizing Nansen Connect and Blockscan Chat to message accounts directly.", "reads": 36, "readers_count": 35, "created": "2022-12-19T23:08:15.850Z"}, {"topic_id": 10926, "post_id": 25604, "post_number": 6, "score": 21.4, "author_username": "ChaosLabs", "text": "As of today, 14 total accounts amounting to ~$29K are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.", "reads": 32, "readers_count": 31, "created": "2022-12-19T23:38:54.498Z"}, {"topic_id": 10926, "post_id": 25679, "post_number": 7, "score": 31.0, "author_username": "ChaosLabs", "text": "We have published this AIP for community members to vote on:\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nThank you in advance for your participation in the vote.\nAccounts in risk of liquidation:\nAs of today, 7 total accounts amounting to ~$700 are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.", "reads": 30, "readers_count": 29, "created": "2022-12-20T21:44:32.814Z"}, {"topic_id": 10926, "post_id": 25744, "post_number": 8, "score": 20.2, "author_username": "ChaosLabs", "text": "As of today, 10 total accounts amounting to ~$392K are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.\nThe main account leading to the large amount at risk of liquidation is 0xaecdde1672f3f121b3a6c43a2e0b5dfc28f6224c", "reads": 26, "readers_count": 25, "created": "2022-12-22T01:40:42.421Z"}, {"topic_id": 10926, "post_id": 25776, "post_number": 9, "score": 25.0, "author_username": "ChaosLabs", "text": "As of today, 7 total accounts amounting to ~$5.56K are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.", "reads": 25, "readers_count": 24, "created": "2022-12-23T09:44:21.766Z"}, {"topic_id": 10926, "post_id": 25795, "post_number": 10, "score": 19.6, "author_username": "ChaosLabs", "text": "As of today, 7 total accounts amounting to ~$5.5K are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.", "reads": 23, "readers_count": 22, "created": "2022-12-24T06:50:45.380Z"}, {"topic_id": 10926, "post_id": 25823, "post_number": 11, "score": 4.2, "author_username": "ChaosLabs", "text": "As of today, 7 total accounts amounting to ~$5.45K are at risk of liquidation following the proposed changes.\nThe full list of accounts and their projected health score, given the updated LTs can be found in this sheet.", "reads": 21, "readers_count": 20, "created": "2022-12-25T06:58:25.718Z"}], [], [{"topic_id": 10826, "post_id": 24895, "post_number": 2, "score": 30.8, "author_username": "Llamaxyz", "text": "Hi Everyone \nWe have published this AIP for community members to vote on:\n\n  \n      \n\n      app.aave.com\n  \n\n  \n    \n\nAave - Risk Parameter Updates for Aave v2 Polygon\n\n  Update Polygon v2 Risk Parameters\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nThank you in advance for your participation in the vote.", "reads": 54, "readers_count": 53, "created": "2022-11-27T14:57:34.782Z"}, {"topic_id": 10826, "post_id": 24966, "post_number": 3, "score": 79.4, "author_username": "VonNeumann", "text": "“This proposal is written in an atomic manner that will unfreeze reserves in case AIP-124 gets executed before.”\nThis seems strange that it will unfreeze reserves if people just recently voted for them to be frozen.  I think a solution to this might be that neither Gauntlet nor Chaos should override the other’s passed proposal within at least 30 days…  otherwise, we risk just going back and forth.", "reads": 47, "readers_count": 46, "created": "2022-11-28T20:45:48.419Z"}, {"topic_id": 10826, "post_id": 24969, "post_number": 4, "score": 94.6, "author_username": "fig", "text": "This is something we’d like to see more of - greater communication between Gauntlet & Chaos.\nWhile yes, the two are competitive in nature, the lack of coordination causes confusion in the DAO.\nWe urge both teams (@Pauljlei @OriN et al.) to work together for a unified front.\nIn the meantime, it will lead to more uncertainty and voter apathy, crippling the DAO.", "reads": 48, "readers_count": 47, "created": "2022-11-28T21:44:29.883Z"}, {"topic_id": 10826, "post_id": 24972, "post_number": 5, "score": 45.0, "author_username": "OriN", "text": "Thanks, Fig - we are working to coordinate proposals, analyses, and discussions with all relevant DAO contributors both behind the scenes and publicly in the forums. We do not anticipate having regular contradicting proposals where we “undo” each other’s work prior to community discussion, feedback, and alignment, but last week was a special circumstance. We support the initial decision to act fast and freeze markets until the proper analysis and community discussion could be done to determine which markets could be re-opened and in which way.\nIn the future, we hope something like the Risk Council (as proposed by BGD) would streamline both incremental risk changes as well as emergency actions without requiring a full DAO vote. We’ve shared thoughts on the structure in that thread and would welcome community feedback there, as well.\nAs always, we’re excited to continue to contribute to the betterment of Aave and will tirelessly work with all relevant parties to ensure its security.", "reads": 50, "readers_count": 49, "created": "2022-11-28T22:07:37.173Z"}, {"topic_id": 10826, "post_id": 25000, "post_number": 6, "score": 117.6, "author_username": "ChaosLabs", "text": "After continued conversation and community feedback received around this proposal, and considering the abundance of recommendations from several parties this past week alongside the fact that Polygon markets are available on v3 - we have decided to pull AIP-126 and ask not to vote on this proposal. This will also allow the DAO to begin shifting usage from v2 to v3, where more risk controls are in place.\nWe are in a fluid and changing environment and are committed to keeping the community updated with our analysis and recommendations along the way.", "reads": 38, "readers_count": 37, "created": "2022-11-29T19:12:38.321Z"}], [], [{"topic_id": 10750, "post_id": 24712, "post_number": 2, "score": 27.4, "author_username": "yaron", "text": "\n\n\n OriN:\n\n\n\n\n\nAsset\nSupply\nCap Recommendation\nCurrent Usage / Recommendation\nLiquidation Threshold\nLiquidation Penalty\nDEX Liquidity*\n\n\n\n\nWBTC\n500 WBTC\n2.1K WBTC\n23.8%\n75%\n10%\n$145M pool\n\n\nWETH\n12.6K WETH\n20.3K WETH\n63%\n82.5%\n5%\n$87M pool\n\n\nAAVE\n2.11K AAVE\n2.5K AAVE\n84.4%\n65%\n10%\nN/A\n\n\nLINK\n313.7K LINK\n350K LINK\n89.62%\n75%\n10%\n$355K pool\n\n\n\n*TVL of the deepest pool, captured on 11/22/22\n\n\nIt is somewhat surprising to see that WBTC is more liquid than ETH on Arbitrum. But if this is the case, then why is it proposed to have a bigger liquidation penalty, and lower liquidation threshold for WBTC?", "reads": 62, "readers_count": 61, "created": "2022-11-23T09:42:35.722Z"}, {"topic_id": 10750, "post_id": 24742, "post_number": 3, "score": 36.2, "author_username": "OriN", "text": "Yaron, thank you for your feedback. While writing the forum post, we included the wrong DEX link for WBTC on Arbitrum, which indicated an incorrect TVL - both have now been corrected. The analysis and recommendations are based on the correct underlying data, and therefore the supply cap recommendation holds.\nWe would like to emphasize once again that this proposal focuses solely on Supply Cap recommendations for uncapped assets. The LTV/LP and LTV in the table reflect the values currently deployed on each network. We’ll be following up with additional parameter recommendations soon to reflect the current market conditions and liquidity better.", "reads": 56, "readers_count": 55, "created": "2022-11-23T16:32:56.637Z"}, {"topic_id": 10750, "post_id": 24745, "post_number": 4, "score": 36.0, "author_username": "yaron", "text": "Ah, I see it was now fixed from $145M to $3.39M.\nVery interesting to see that the recommended WBTC cap is higher than the recommended ETH cap, despite reporting over x20 higher dex liquidity for ETH (I assume that for CEX liquidity, ETH liquidity is even much higher than the one of WBTC).", "reads": 55, "readers_count": 54, "created": "2022-11-23T17:23:28.132Z"}, {"topic_id": 10750, "post_id": 24751, "post_number": 5, "score": 159.8, "author_username": "AaveLabs", "text": "We are pleased to see the community taking some important steps to further manage risk by leveraging Aave V3’s embedded risk management features with a robust framework. These conservative initial supply caps appear to be aligned with current market conditions.", "reads": 49, "readers_count": 48, "created": "2022-11-23T21:31:45.076Z"}, {"topic_id": 10750, "post_id": 24752, "post_number": 6, "score": 115.4, "author_username": "OriN", "text": "Agreed, the cap on BTC is larger than ETH. Here are a few things to note here:\n\nThere isn’t a linear relation between pool TVL and supply caps as the liquid pools are in Uni v3, where liquidity is provisioned into specific ranges. What’s important here is the available liquidity within the range, such that the slippage is smaller than the liquidation penalty.\nBecause the liquidation penalty of WBTC is significantly higher than WETH, there is more liquidity available within that range, giving us more flexibility in terms of profitable liquidations for liquidators.\nWhile DEX Liquidity and liquidation penalties are critical factors in determining supply caps, they are not the only consideration. Our analysis shows that the pace of liquidations for ETH is faster than that of BTC (under relevant market conditions); therefore it will be harder for liquidators to liquidate underwater positions over time during adverse market events.\n\nWe’ve validated this model with significant market actors and liquidity providers. Of course, these are all heuristics; but, we choose to over-index on the side of caution.\nSupply caps will be an iterative process that reflects market conditions and overall supply utilization. We believe it’s best to be prudent during these times, as we can quickly raise supply caps moving forward as the market evolves and permits.\nFixed a few more links along the way. Again these don’t affect the supply cap recommendations. We’d like this to be available as a template for anyone recommending supply caps moving forward.", "reads": 52, "readers_count": 51, "created": "2022-11-23T21:35:54.019Z"}, {"topic_id": 10750, "post_id": 24753, "post_number": 7, "score": 55.2, "author_username": "OriN", "text": "Snapshot vote is now live:\nhttps://snapshot.org/#/aave.eth/proposal/0xf40a7b4a6ecd5325553593f0f9fdc8ba04808573fdf76fc277aee52b5396a588", "reads": 51, "readers_count": 50, "created": "2022-11-23T21:49:29.219Z"}, {"topic_id": 10750, "post_id": 24754, "post_number": 8, "score": 50.0, "author_username": "yaron", "text": "\n\n\n OriN:\n\nBecause the liquidation penalty of WBTC is significantly higher than WETH, there is more liquidity available within that range, giving us more flexibility in terms of profitable liquidations for liquidators.\n\n\nThere are snapshot i just took from 1inch (over arbitrum), it seems the liquidity for 5% slippage on ethereum is like x5 bigger than wbtc for 10% slippage. Moreover, almost 70% of the entire recommended ETH cap can be liquidated in a single trade.\n\n", "reads": 50, "readers_count": 49, "created": "2022-11-23T22:34:22.206Z"}, {"topic_id": 10750, "post_id": 24831, "post_number": 9, "score": 22.4, "author_username": "yaron", "text": "I think the community would benefit from more elaborated explanations on how you come up with these numbers.\nYou present very detailed tables, however, the connection between the tables in this post and the final recommendations is pretty lose. I am sure other considerations were taken into account, and this is how you come up with such a conclusion, but the current post does not shed any light on it.\nIn particular, the contrast between the avalanche and arbitrum recommendations. Your recommended supply cap for ETH on avalanche is x5 the one you recommend on arbitrum, despite dex liquidity being x5 higher on arbitrum.\nI can think of multiple considerations that could justify it, but I you don’t specify any of them in your post.\nI think the community would benefit from giving a fuller picture on how this was compiled.", "reads": 37, "readers_count": 36, "created": "2022-11-25T09:28:18.732Z"}, {"topic_id": 10750, "post_id": 24859, "post_number": 10, "score": 32.4, "author_username": "BristolBlockchain", "text": "We support this proposal as it will decrease the risk associated with uncapped assets. The parameters are considered conservative which can be change in the future.", "reads": 37, "readers_count": 36, "created": "2022-11-25T16:39:48.062Z"}], [{"topic_id": 10655, "post_id": 24634, "post_number": 2, "score": 13.4, "author_username": "ccb_roci", "text": "Providing a quick update:\nAave V3 - Arbitrum - Borrower 0x004c718103fed0bf75f2a02c3da7ea2332137fac\nPer RociFi’s credit risk model, this address is rated a 8 out of 10, i.e. a weaker credit score.\n\n6 total borrows, all-time\n$460K in total debt repaid, all-time\nZero liquidations, all-time\n$1.1M debt outstanding to Aave\n\nThe borrower’s weaker credit score (although improved from the last update) coupled with current health factor of 1.19 suggest monitoring of risk. However, the relatively small amount of debt coupled with liquid collateral assets of WBTC and WETH, the overall risk to Aave does not seem significant.\nAave V3 - Avalanche - Borrower 0xcc5b1fef95f632c4a25f95ad88bfe12f928d04cb\nThis address is rated a 7 out of 10, i.e. a weaker credit score.\n\n11 total borrows, all-time\n$3.1M in total debt repaid, all-time\nZero liquidations, all-time\n$4.3M debt outstanding to Aave\n\nThe borrower’s weaker credit score coupled with current health factor of 1.17 suggests monitoring of risk by the protocol.\nAave V3 - Optimism - Borrower 0xd075ca0b40d67db2570ae23936baeb64449dc8ba\nThis address is rated a 5 out of 10, i.e. a good credit score.\n\n50 total borrows, all-time\n$9.7M in total debt repaid, all-time\nZero liquidations, all-time\n$1.2M debt outstanding to Aave\n\nThe borrower’s good credit score coupled with current health factor of 1.30 suggest less risk.\nAave V3 - Polygon - Borrower 0x61a8d768de76361e2538f1d4f490118d881da0cc\nThis address is rated a 4 out of 10, i.e. a good credit score.\n\n14 total borrows, all-time\n$912K in total debt repaid, all-time\nZero liquidations, all-time\n$439K debt outstanding to Aave\n\nThe borrower’s credit score is good but the current health factor of 1.12 continues to make the position riskier. However, the small debt amount coupled with relatively liquid collateral assets of SUSHI and MATIC, reduce overall risk to Aave.", "reads": 17, "readers_count": 16, "created": "2022-11-22T20:33:12.125Z"}], [{"topic_id": 10620, "post_id": 24420, "post_number": 2, "score": 14.6, "author_username": "Tobes", "text": "AAVE Harmony V3 has lots of bad debt.", "reads": 23, "readers_count": 22, "created": "2022-11-16T02:47:24.149Z"}], [{"topic_id": 10196, "post_id": 23319, "post_number": 2, "score": 75.8, "author_username": "Pauljlei", "text": "Thanks very much for the detailed analysis. Gauntlet is continuing to monitor the situation and will keep the community posted. Our current simulation platform captures liquidity and slippage mentioned above.\n\n\n\n nonstopTheo:\n\nWe conclude that in this simplistic framework the attack is not profitable, however further research is needed, and risk managers of lending protocols need to closely monitor slippage levels of collateral tokens and associated LTVs to pre-empt malicious attacks.\n\n\nWe agree that currently, the risk of this attack is low. Also, we’d note that one component that should be added to the model is the market impact decay. The attack strategy would more likely be profitable for long-tail assets versus AVAX at current conditions.", "reads": 29, "readers_count": 28, "created": "2022-10-10T16:15:14.812Z"}, {"topic_id": 10196, "post_id": 23320, "post_number": 3, "score": 35.8, "author_username": "nonstopTheo", "text": "The market impact decay is captured natively in the sublinear scenario.\nOf course more research is needed, especially regarding the choice of asset.", "reads": 29, "readers_count": 28, "created": "2022-10-10T17:15:23.240Z"}, {"topic_id": 10196, "post_id": 23321, "post_number": 4, "score": 135.8, "author_username": "OneTrueKirk", "text": "I’m glad to see this line of inquiry being pursued. Volt Protocol cofounder Elliot Friedman identified a similar category of risk in our security review of Compound Finance which we shared with both Aave and Compound teams.\n\n  \n      \n\n      Compound Community Forum – 2 Sep 22\n  \n\n  \n    \n\nInvestigate Market Manipulation Risk in ZRX and Other Tokens\n\n  In our recent security review of Compound v2, the Volt Protocol team identified a class of market manipulation risks. The full report is available here, but I have quoted the most relevant section below.   In reviewing the security of Compound in...\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nI would be very interested to see the results of a similar analysis applied to tokens with the highest borrowable liquidity : market depth ratio, possibly taking into account borrowable quantities on both Aave and Compound.", "reads": 29, "readers_count": 28, "created": "2022-10-10T20:40:12.872Z"}], [], [], [{"topic_id": 8247, "post_id": 19036, "post_number": 2, "score": 90.8, "author_username": "Tor_GAINS", "text": "Hey man, in case of a black swan event, the safety module is there to limit the damage\n\nimage851×212 21.6 KB\n\nI invite you to read more here: Safety Module - Aavenomics & Migration and Staking - FAQ", "reads": 54, "readers_count": 53, "created": "2022-05-26T14:57:36.337Z"}, {"topic_id": 8247, "post_id": 21112, "post_number": 3, "score": 13.2, "author_username": "Peterstarhunter", "text": "How often has liquidity been a problem where stakers lost up to 30%", "reads": 41, "readers_count": 40, "created": "2022-08-05T16:01:26.906Z"}, {"topic_id": 8247, "post_id": 22252, "post_number": 4, "score": 5.6, "author_username": "EzR3aL", "text": "Not once yet. No slashing has happened.", "reads": 28, "readers_count": 27, "created": "2022-09-09T11:13:33.995Z"}], [{"topic_id": 9317, "post_id": 21365, "post_number": 2, "score": 14.4, "author_username": "majestywwwc", "text": "Hello everyone, I am an AAVE ICO supporter, I have supported AAVE for more than 5 years, when AAVE was still lend , but this morning a very bad thing happened, my AAVE STK’s were stolen by someone else, I don’t know how they did it , but I did have my AAVE STK’s transferred by a strange person. Maybe it’s the latest vulnerability of AAVE? I checked my metamask and there is no record of my transactions in it, which is very strange.\n\n微信图片_202208151309471920×1440 231 KB\n\nThis was a gift from the AAVE community in 2021, because I remember I was one of the top 100 AAVE users.\nI have a twitter account, I have supported AAVE for 5 years, here is the record Please search about lend or AAVE Here is my history about AAVE, I have made a great contribution to the AAVE community in China:\nhttps://weibo.com/6161684829/profile?topnav=1&wvr=6", "reads": 47, "readers_count": 46, "created": "2022-08-15T05:11:48.469Z"}, {"topic_id": 9317, "post_id": 21366, "post_number": 3, "score": 9.6, "author_username": "majestywwwc", "text": "This is the evidence of my participation in ICO\n\nICO 证据1920×2560 219 KB\n\nBut something very bad happened yesterday, my AAVE wallet was suddenly transferred by a stranger! I don’t understand.\nmy metamask Evidence :\n\nMETA1920×2560 367 KB\n\nI found no transaction records or transfer bar records on my computer\nI don’t understand how he did it?！！\n\n币安AAVE 转账证明1920×1440 239 KB\n\n\nmeta1920×1440 153 KB\n\nI didn’t do anything, this stranger transferred 4500X AAVE STk +0.2 ETH that I was mining pooling, he didn’t understand that I still had some BTC and ETH in my uniswap, I found this out about 13 hours later! And transferred to my binance coin wallet .\n\n币安1920×1080 310 KB\n", "reads": 48, "readers_count": 47, "created": "2022-08-15T05:22:09.333Z"}, {"topic_id": 9317, "post_id": 21367, "post_number": 4, "score": 9.8, "author_username": "majestywwwc", "text": "I would like the AAVE community to help me, I would like to freeze this stranger’s wallet and donate it all to the AAVE community if they can， I am one of the AAVE builders and would like the community to vote to permanently block my 4500X AAVE STK if possible", "reads": 49, "readers_count": 48, "created": "2022-08-15T05:34:52.036Z"}, {"topic_id": 9317, "post_id": 21372, "post_number": 5, "score": 84.6, "author_username": "Harry_Feldman", "text": "Your account signed the transaction. Looks like your keys were compromised. I would talk to your insurance agency if you have identity theft coverage, but beyond that, you’re outta luck. My deepest condolences", "reads": 48, "readers_count": 47, "created": "2022-08-15T12:14:36.888Z"}, {"topic_id": 9317, "post_id": 21376, "post_number": 6, "score": 14.6, "author_username": "majestywwwc", "text": "I would like to know how to contact the administrator", "reads": 48, "readers_count": 47, "created": "2022-08-15T13:34:49.674Z"}, {"topic_id": 9317, "post_id": 21386, "post_number": 7, "score": 18.2, "author_username": "EzR3aL", "text": "Hi,\nall transactions have been made by your wallet. So this means you have been hacked somehow, maybe a keylogger or you used a compromised SM or website.\nBut what i can see here (Etherscan Error Page) is, that the hacker is straight sending your funds to Binance. And he was sending large amounts like 50ETH or 11BTC. The only thing you can do now is contact Binance asap and try to get in touch with them. They must have the KYC data from this person and thats how you can find out who hacked you. I would be as fast as possible, because the hacker will probably do the same with your Aave after the cooldown period.\nThe only other thing you can do is set up a correct thread for a snapshot vote in order to get people to vote for you to freeze this account by the guardian. But i would rather stick with the binance approach probably. Also dont use that pc anymore where you made your are trading. This pc is compromised and needs a clean and fresh installation.\nAlso get immediately a hardware wallet!!!\nGood luck", "reads": 41, "readers_count": 40, "created": "2022-08-15T21:37:54.398Z"}, {"topic_id": 9317, "post_id": 21400, "post_number": 8, "score": 12.4, "author_username": "majestywwwc", "text": "Binion’s address is my wallet, hacker he doesn’t know my BTC + ETH at UNISWAP, I transferred my BTC + ETH + NFT, but my 50K$AAVe STK was transferred away by him, so I hope freeze AAVe community can freeze this than transaction,", "reads": 37, "readers_count": 36, "created": "2022-08-16T11:44:00.680Z"}, {"topic_id": 9317, "post_id": 21402, "post_number": 9, "score": 77.6, "author_username": "Harry_Feldman", "text": "It’s not gonna happen. You are ultimately responsible for your keys, not the community. What you’re looking for is a centralized system. If you want things to be reversible, then you have to accept the need for centralized control. The price of decentralization is that you are on your own, for better or for worse", "reads": 38, "readers_count": 37, "created": "2022-08-16T14:12:39.226Z"}, {"topic_id": 9317, "post_id": 21444, "post_number": 10, "score": 7.0, "author_username": "majestywwwc", "text": "First of all this doesn’t happen to you, I can’t believe as you do why this is happening, if it happens to you someday I don’t think you will think so, so I hope the admin freezes the web use of this wallet address at aave.com unless he can provide all proof that this money is legitimate.", "reads": 35, "readers_count": 34, "created": "2022-08-17T12:35:00.459Z"}, {"topic_id": 9317, "post_id": 21450, "post_number": 11, "score": 6.8, "author_username": "majestywwwc", "text": "Yes, decentralization has a cost, you’re just talking out of your ass, I don’t think management would choose to split like ETH + ETC if the AAVE network was destroyed, I’m a supporter and promoter of the community so I think I’m entitled to defend what I’ve done for the community.", "reads": 34, "readers_count": 33, "created": "2022-08-17T12:46:40.895Z"}, {"topic_id": 9317, "post_id": 21455, "post_number": 13, "score": 40.6, "author_username": "Harry_Feldman", "text": "You’re conflating the hacking of your account with the hacking of an entire network. The network was not hacked, you were. What happened to you is no different than if someone broke into your house and stole your computer. If that had happened, do you think the community should pay for that?", "reads": 28, "readers_count": 27, "created": "2022-08-17T16:37:12.763Z"}, {"topic_id": 9317, "post_id": 21463, "post_number": 14, "score": 5.6, "author_username": "majestywwwc", "text": "Your words are ridiculous, ok, the AAVE network is being attacked and everyone should work together to defend it, if individuals in the AAVE community are being attacked then it’s your personal problem, if I didn’t own AAVE then I wouldn’t care, I would be ridiculous and say that decentralization is great, the point is that I am part of the AAVE community and everyone in the community should work together to unite and protect everyone instead of saying ridiculous crap.", "reads": 28, "readers_count": 27, "created": "2022-08-17T20:45:49.996Z"}, {"topic_id": 9317, "post_id": 21464, "post_number": 15, "score": 5.2, "author_username": "majestywwwc", "text": "If AAVE = decentralized, then why does he need a community? Is it OK to be like BTC? Why does it need to be maintained? If a member of the community he has full proof that he is a clean user, why shouldn’t everyone in the community come together to protect him? What is the value of the community’s existence? Can you tell me?", "reads": 26, "readers_count": 25, "created": "2022-08-17T20:48:57.625Z"}, {"topic_id": 9317, "post_id": 21465, "post_number": 16, "score": 50.6, "author_username": "majestywwwc", "text": "I provided enough evidence of my account and where my AAVE came from, but this hacker user did not manage to provide enough evidence of his funds, then he is here to destroy the community, being that the community members are not protected, you go and protect a disgusting hacker and then talk nonsense about “decentralization is great”, are you one of the members of the AAVE community?  Saying some crap", "reads": 28, "readers_count": 27, "created": "2022-08-17T20:54:16.571Z"}, {"topic_id": 9317, "post_id": 21466, "post_number": 17, "score": 10.6, "author_username": "majestywwwc", "text": "Community presence = protecting community members and building a healthy and growing community, I don’t think it’s a good idea to talk some crap here, can you prove your contribution to the AAVE community? How much AAVE do you have and how long have you been promoting AAVE? I don’t think you have because you just know the crap anyone would know about saying decentralization is great.\nI only have one question:\nif the community exists not to protect the people inside the community, but this ridiculous “network”, then I think the existence of the community is an unnecessary one.", "reads": 28, "readers_count": 27, "created": "2022-08-17T20:59:51.454Z"}, {"topic_id": 9317, "post_id": 21472, "post_number": 18, "score": 30.8, "author_username": "Harry_Feldman", "text": "Not talking crap, I offered you my condolences and I meant it. My point is that you probably don’t want to live in a world where, if / when someone becomes the victim of a crime, everyone has to pay for it. If someone burglarized my house and stole my computer, I wouldn’t go asking my neighbors or my business partners to fork over the money that was stolen from me.\n\n\n\n majestywwwc:\n\nCommunity presence = protecting community members\n\n\nProtecting community members from what exactly? Should the AAVE token install an antivirus on all its users computers? Should AAVE invest to protect users from email phishing attacks? It’s not a controversial thing to say that your keys are your responsibility. They are your responsibility – that’s the whole point.", "reads": 29, "readers_count": 28, "created": "2022-08-17T23:21:56.857Z"}, {"topic_id": 9317, "post_id": 21486, "post_number": 19, "score": 10.8, "author_username": "majestywwwc", "text": "I take my losses, I lost $500,000 and I’ve been punished\nBut this hacker stole tokens from AAVE community members, you don’t think he should be restricted or punished?  So protect him? Blame a member of AAVE?\nIs that a healthy community? Or is it full of dumb people?\nI’ve been stressing that members of the community should unite to protect real community members, not to protect a scammer or hacker", "reads": 29, "readers_count": 28, "created": "2022-08-18T08:11:48.278Z"}, {"topic_id": 9317, "post_id": 21487, "post_number": 20, "score": 30.8, "author_username": "majestywwwc", "text": "Kid, I think you just contacted blockchain, you are brainwashed by a term called decentralization, there are many people here who do not think independently, if you have the opportunity, you should be thinking about what is the real decentralization, do not be brainwashed by these ridiculous liars.", "reads": 29, "readers_count": 28, "created": "2022-08-18T08:13:07.985Z"}, {"topic_id": 9317, "post_id": 21495, "post_number": 21, "score": 10.0, "author_username": "sakulstra", "text": "@majestywwwc the DAO can’t do anything in this case even if there was consensus it wanted to.\nIt’s technically not possible.\nThe governance process takes time and stkAAVE $99.97 | Staked Aave (stkAAVE) Token Tracker | Etherscan has no “pause” functionality or similar.\nTherefore the hacker would always be able to react(e.g. transfer to new address) in advance to any action taken by the DAO.", "reads": 25, "readers_count": 24, "created": "2022-08-18T11:02:24.783Z"}, {"topic_id": 9317, "post_id": 21546, "post_number": 22, "score": 9.4, "author_username": "majestywwwc", "text": "I don’t think so, AAve.com is centralised, I think they could act to limit, I mean, just limit, delay the hack, it’s just that the AAVE.com admins don’t want to do that, they could come in and limit the adoption of DAO afterwards in the first place, but does he sit back and do nothing, mouth off, that’s decentralisation? Ridiculous.", "reads": 22, "readers_count": 21, "created": "2022-08-19T23:17:23.959Z"}, {"topic_id": 9317, "post_id": 21551, "post_number": 23, "score": 34.6, "author_username": "sakulstra", "text": "aave.com is the website owned and operated by the aave companies. It is not related to your issue at all.\napp.aave.com is just a enslink.\nYou can access the website via any ipfs gateway:\n\nAave - Open Source Liquidity Protocol\nAave - Open Source Liquidity Protocol\nhttps://bafybeihmp4yzkh4ezrcj4cozzvh45pmdqq3ffxeby3ie4vu7ubybnq2oci.ipfs.cf-ipfs.com/\n…\n\nWhich are not controlled by the aave companies, but the ipfs network / the respective gateway providers. There’s no way to turn sth off or forbid a certain address the interaction. Even if there was there are various other UIs like e.g. etherscan that you can use. Besides that you don’t need a ui, but can just unstake via vanilla rpc calls(the attacker wouldn’t even need to unstake to sell btw).\nThe only thing DAO can do is onchain via a governance proposal that has to pass the vote - which does not make any sense as there’s no way to help you as pointed out in my last answer.", "reads": 23, "readers_count": 22, "created": "2022-08-20T09:20:45.192Z"}], [{"topic_id": 9288, "post_id": 21340, "post_number": 2, "score": 12.4, "author_username": "o_O", "text": "If no action is taken, collateralize USDC and take out loans in DAI and buy USDC\nCan you link to the publication?", "reads": 37, "readers_count": 36, "created": "2022-08-14T08:27:57.574Z"}, {"topic_id": 9288, "post_id": 21341, "post_number": 3, "score": 12.2, "author_username": "P5555A", "text": "\n  \n\n      twitter.com\n  \n\n  \n    \n\n@\n\n\n  1/26\n\nI was curious of what a doomsday scenario attack would look like for DAI.\n\nSo I thought through an unlikely, but not impossible attack that could be pulled off in the current structure, and look at what should be done to address such risks.\n\n\n\n  \n\n\n\n\n  \n\n  \n    \n    \n  \n\n  \n", "reads": 36, "readers_count": 35, "created": "2022-08-14T10:40:05.435Z"}, {"topic_id": 9288, "post_id": 21433, "post_number": 4, "score": 4.8, "author_username": "noliquidityxbt", "text": "I’d like to see more discussion on this from delegates or contributors. Although unlikely, it is a systemic risk. A negative entity is able carry out this attack with enough capital.\nIn the thread, Adam provides a solution telling other to reduce the collateral factor of DAI. This isn’t a big change and should be carried out as insurance when compared to the fallout of a DAI depegging.\nBetter early than late. If there’s going to panic, better to panic first.", "reads": 24, "readers_count": 23, "created": "2022-08-17T09:17:22.230Z"}, {"topic_id": 9288, "post_id": 21468, "post_number": 5, "score": 19.4, "author_username": "monet-supply", "text": "Full disclosure, I’m somewhat biased as a Maker risk contributor. But, I don’t think Adam laid out a feasible attack. For example, his attack plan seems to assume that PSM would be frozen (and not available as buy side liquidity to keep dai around peg), but then implies that an attacker could use PSM liquidity to acquire DAI which is obviously inconsistent.\nOverall, I think this is just Adam threadoooring and not a serious risk to the Aave protocol. DAI maximum LTV and optimal utilization are also already below USDC which provides a significant additional margin of safety.", "reads": 22, "readers_count": 21, "created": "2022-08-17T22:09:31.575Z"}, {"topic_id": 9288, "post_id": 21491, "post_number": 6, "score": 3.8, "author_username": "noliquidityxbt", "text": "Thanks for the clarification. Reading into it more, I think Rune also stated in the comments of the thread that the proposed attack was not feasible. Good to have a Maker risk contributor confirm though.\nOn another note, pretty sure there was an attempted bank run on Maker following the misunderstood news that the PSM was going to be used to market buy eth. While attacks will happen in the future, this instance speaks to the stability of DAI for now.", "reads": 19, "readers_count": 18, "created": "2022-08-18T08:57:37.024Z"}], [{"topic_id": 7286, "post_id": 16690, "post_number": 2, "score": 39.8, "author_username": "Pauljlei", "text": "Snapshot link below:\nhttps://snapshot.org/#/aave.eth/proposal/QmWGjPM2DfZU3pgxucmE2v4j7vY8hWUrcNYXMsiDSexVDh", "reads": 24, "readers_count": 23, "created": "2022-02-11T03:10:16.534Z"}, {"topic_id": 7286, "post_id": 16727, "post_number": 3, "score": 44.4, "author_username": "yjoe", "text": "@Pauljlei Any chance you can post the link to the transaction? I’d like to track these updates but was never able to find the transactions onchain.", "reads": 22, "readers_count": 21, "created": "2022-02-13T03:29:13.113Z"}, {"topic_id": 7286, "post_id": 16753, "post_number": 4, "score": 254.0, "author_username": "Pauljlei", "text": "Thanks @yjoe - we have not published the on-chain proposal yet, but are happy to post the transaction links here after the proposal is up. We plan on publishing the on-chain proposal tomorrow Pacific Time.", "reads": 20, "readers_count": 19, "created": "2022-02-14T19:12:39.856Z"}, {"topic_id": 7286, "post_id": 16839, "post_number": 5, "score": 22.8, "author_username": "Pauljlei", "text": "AIP is live for voting now:\n\n  \n      \n\n      Aave app\n  \n\n  \n    \n\nAave - Open Source Liquidity Protocol\n\n  Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on deposits and borrow assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 14, "readers_count": 13, "created": "2022-02-17T00:42:29.907Z"}, {"topic_id": 7286, "post_id": 16904, "post_number": 6, "score": 12.0, "author_username": "yjoe", "text": "I see that the proposal was executed. But I can’t find the transaction. Could you post a link? Thanks.", "reads": 10, "readers_count": 9, "created": "2022-02-22T15:38:47.516Z"}, {"topic_id": 7286, "post_id": 16907, "post_number": 7, "score": 6.6, "author_username": "Pauljlei", "text": "@yjoe please see below for the proposal execution transaction:\n\n  \n      \n\n      Ethereum (ETH) Blockchain Explorer\n  \n\n  \n    \n\nEthereum Transaction Hash (Txhash) Details | Etherscan\n\n  Ethereum (ETH) detailed transaction info for txhash 0xb6edc1d5bb85a9f1bbec21cdd6296ba540a83fd41b65cdd9ca8d4ec420741a41. The transaction status, block confirmation, gas fee, Ether (ETH), and token transfer are shown.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 8, "readers_count": 7, "created": "2022-02-22T18:38:08.964Z"}], [{"topic_id": 6942, "post_id": 15954, "post_number": 2, "score": 28.6, "author_username": "Pauljlei", "text": "Link to the Snapshot vote below:\nhttps://snapshot.org/#/aave.eth/proposal/QmahWfPSdrFpxHDMU39F17wAuB44cVoJvUd4Hi6aYknmdD", "reads": 43, "readers_count": 42, "created": "2022-01-14T17:43:37.070Z"}, {"topic_id": 6942, "post_id": 15956, "post_number": 3, "score": 48.2, "author_username": "fig", "text": "@Pauljlei notice that most of these assets have been subjects of recent hype and sector trends.\nDeFi, Curve Wars, and the Metaverse are all represented in this list.\nIs this coincidental or reflective of a surge in demand by users?", "reads": 41, "readers_count": 40, "created": "2022-01-14T20:59:46.704Z"}, {"topic_id": 6942, "post_id": 15964, "post_number": 4, "score": 31.6, "author_username": "supahjoe", "text": "I don’t know if there’s any precedent to it, but it doesn’t feel right to include upgrading an asset to collateral in the risk parameter updates. It seems like it ought to be done in a separate proposal, when the asset was initially onboarded as borrow only.\nIt gives off the feeling of shoving a potentially controversial change into a bill that’s generally, for better or worse rubber stamped.", "reads": 33, "readers_count": 32, "created": "2022-01-15T06:55:53.603Z"}, {"topic_id": 6942, "post_id": 15987, "post_number": 6, "score": 16.4, "author_username": "JeremyKeating", "text": "\n\n\n supahjoe:\n\nIt seems like it ought to be done in a separate proposal\n\n\nThat is a really good point", "reads": 32, "readers_count": 31, "created": "2022-01-16T14:24:04.540Z"}, {"topic_id": 6942, "post_id": 15994, "post_number": 7, "score": 46.2, "author_username": "Pauljlei", "text": "Thank you for your thoughts, @supahjoe  and @JeremyKeating . For context, there has been no precedent for this, but following community feedback and internal discussion, we have decided to split into separate proposals moving forward in order to allow the community to make more granular decisions. We will put up an on-chain proposal to upgrade Fei to a collateral asset on Tuesday, January 18th. Following this proposal, we will make a separate proposal for our regular set of parameter recommendations. As always, we will cancel/revise our regular set of parameter recommendations should market conditions change significantly and our simulations dictate it necessary.", "reads": 31, "readers_count": 30, "created": "2022-01-17T05:25:55.656Z"}, {"topic_id": 6942, "post_id": 15995, "post_number": 8, "score": 51.2, "author_username": "Pauljlei", "text": "Thanks @fig - while we do not make the parameter updates in response to the “hype”, there have been increased market liquidity and trading volume in these assets. These parameter recommendations reflect the market data (which includes increased user demand, as you suggested) which has indicated that market conditions including volatility and liquidity of assets have improved, making it safe to update these risk parameters to increase capital efficiency.", "reads": 31, "readers_count": 30, "created": "2022-01-17T05:30:29.684Z"}, {"topic_id": 6942, "post_id": 16079, "post_number": 9, "score": 90.8, "author_username": "eboado", "text": "Were the minting permissions and other potential technical risks of FEI thoroughly analysed before the decision for activation as collateral @Pauljlei ?\nIt is pretty important to have a good overview of them before this critical decision.", "reads": 29, "readers_count": 28, "created": "2022-01-19T17:22:47.508Z"}, {"topic_id": 6942, "post_id": 16081, "post_number": 10, "score": 55.8, "author_username": "JeremyKeating", "text": "\n\n\n eboado:\n\npotential technical risks of FEI\n\n\nIt is another good point @Pauljlei. Has there been any assessment of the governance and smart contract risks? I know it is the sort of thing the risk DAO would be good for. These risks are more important if the assets is going to be used for collateral\nDo you have stats on FEI’s deviation from the USD? I think I remember something about it being fairly volatile - maybe that was early on", "reads": 29, "readers_count": 28, "created": "2022-01-19T18:59:48.911Z"}, {"topic_id": 6942, "post_id": 16096, "post_number": 11, "score": 79.8, "author_username": "Joey-fei", "text": "Hey all! Thanks @eboado for asking about the more technical risks of FEI here. I think FEI’s financial risks have been well covered by @Pauljlei and others on other threads.\nThe FEI stablecoin is a vanilla ERC20 with one additional functionality for minting to any address which is controlled by the MINTER_ROLE. fei-protocol-core/permissions.ts at develop · fei-protocol/fei-protocol-core · GitHub is a list of all the access roles in the system. The Minter contracts are all battle tested and audited, and used for peg stability and PCV management. The GOVERN_ROLE is capable of granting new minters, which is held by our DAO timelock. This means that the DAO could in theory mint arbitrary FEI, but this needs to be passed by a majority of token holders. If a malicious proposal were enacted, the security guardian would be able to veto and prevent it from going live. The Security Guardian is a 3/7 multisig with members comprised by Fei Labs core team.\nOf note, FEI used to be able to burn FEI from any address via the BURNER_ROLE but this was deprecated in FIP-54.\nAlso, since June the stability mechanism is 1:1 redeemability of FEI for PCV (with a fee/spread). PCV is diversified and 225% collateralized: Fei Protocol", "reads": 24, "readers_count": 23, "created": "2022-01-20T20:05:05.069Z"}, {"topic_id": 6942, "post_id": 16100, "post_number": 12, "score": 64.8, "author_username": "eboado", "text": "Thanks for the information @Joey-fei .\nIn my opinion, then it is reasonable to have FEI as a collateral asset, given the good synergies between Aave and the FEI ecosystem during these last months. I would say that in case of the proposal passing, it is pretty important for people associated with FEI to keep the Aave community updated here in the forum (or through any other channel) about all new decisions happening affecting monetary policies, like for example addition of new minters by the GOVERN_ROLE.\nAs a piece of feedback for the opener of the thread (@Pauljlei representing Gauntlet), in my opinion it is completely mandatory in case of proposing any activation as collateral (or in general anything affecting non-quantitative configurations of assets) to include a technical analysis, including detailed risks like those described by @Joey-fei . For what I understand, it is not the expertise of Gauntlet, so in that case I would suggest to engage since the start the team associated with the asset.", "reads": 24, "readers_count": 23, "created": "2022-01-20T23:18:01.661Z"}, {"topic_id": 6942, "post_id": 16101, "post_number": 13, "score": 24.6, "author_username": "Joey-fei", "text": "\n\n\n eboado:\n\nI would say that in case of the proposal passing, it is pretty important for people associated with FEI to keep the Aave community updated here in the forum (or through any other channel) about all new decisions happening affecting monetary policies, like for example addition of new minters by the GOVERN_ROLE.\n\n\nWill be sure to keep the aave community in the loop! We circulate all major protocol upgrades broadly through out various comms channels and with our partners. Hope to see this proposal pass!", "reads": 23, "readers_count": 22, "created": "2022-01-20T23:40:03.881Z"}, {"topic_id": 6942, "post_id": 16149, "post_number": 14, "score": 19.0, "author_username": "Pauljlei", "text": "Thank you, @eboado . We appreciate the feedback and moving forward, will coordinate with the team associated with the asset to provide the Aave community with a technical analysis ahead of voting.\nExcited to see this proposal pass to strengthen the FEI and Aave ecosystems, and looking forward to collaborating on future proposals that drive growth for the protocol.", "reads": 20, "readers_count": 19, "created": "2022-01-24T20:37:19.981Z"}, {"topic_id": 6942, "post_id": 43113, "post_number": 15, "score": 1.0, "author_username": "EzR3aL", "text": "", "reads": 5, "readers_count": 4, "created": "2024-04-02T11:16:45.484Z"}], [{"topic_id": 6742, "post_id": 15536, "post_number": 2, "score": 56.0, "author_username": "Pauljlei", "text": "Link to the Snapshot vote below:\nhttps://snapshot.org/#/aave.eth/proposal/QmUyyCjuNkKPJbTVpzpAQcXCEPRyLqEdzhgPvL1KSvHrE2", "reads": 30, "readers_count": 29, "created": "2021-12-30T00:02:47.424Z"}], [{"topic_id": 6646, "post_id": 15349, "post_number": 2, "score": 76.4, "author_username": "fig", "text": "@Pauljlei thanks for taking the time to update the community on some of these changes.\nA few thoughts and questions.\nFirst - I will examine a few rows in the chart above. This $SUSHI parameter change sticks out in particular:\n\n\n\n Pauljlei:\n\n|SUSHI Liquidation Bonus|10.0%|8.5%\n\n\nBy lowering the liquidation bonus across a few assets, does this suggest Gauntlet expects more liquidations in the near future / upcoming quarter?\nSecond  - I enjoy your “Collateral Safety” analysis and tags in your report. They are simple yet powerful when applied in context to a collateral asset. See a screenshot for reference below:\n\nIs it possible to add this to the Aave Protocol UI to better inform users of the risks in borrowing?", "reads": 32, "readers_count": 31, "created": "2021-12-17T16:35:29.464Z"}, {"topic_id": 6646, "post_id": 15350, "post_number": 3, "score": 40.2, "author_username": "Pauljlei", "text": "Snapshot vote can be found here:\nhttps://snapshot.org/#/aave.eth/proposal/QmfQB37YNrWFzJEVrwY17qHv9LWXR895PnZgfdHKR62eXR", "reads": 26, "readers_count": 25, "created": "2021-12-17T23:06:29.708Z"}, {"topic_id": 6646, "post_id": 15378, "post_number": 4, "score": 44.4, "author_username": "Pauljlei", "text": "Thanks for your feedback, @fig ! The lowering of liquidation bonuses is not reflective of liquidation frequency. It is dependent on the ability of liquidators to safely trade out liquidated collateral in extreme market conditions. Lowering liquidation bonuses is a result of our analysis showing that liquidators can safely trade out liquidated collateral even with lower bonuses.\nWe are glad to hear that you find the “Collateral Safety” analysis and tags useful. We would be happy to integrate with the Aave Protocol UI and would welcome the collaboration from the Aave developer team.", "reads": 22, "readers_count": 21, "created": "2021-12-21T03:42:27.267Z"}, {"topic_id": 6646, "post_id": 15446, "post_number": 5, "score": 43.8, "author_username": "Pauljlei", "text": "In addition, we wanted to notify the community that we resolved a bug with our dashboard data aggregation that attributed the liquidated amount to the borrowed assets instead of to the collateral assets. This caused the dashboard to show a different Value at Risk (VaR) distribution than intended, since the VaR calculation factors both liquidation volume and insolvencies into the calculation. To clarify, this bug was already fixed before this ARC was posted, but we want to keep the community informed.\nThis did not affect the parameter recommendations we have delivered, and it did not affect our parameter recommendation methodology.\nThis bug only affected dashboard metrics and not model inputs that drive recommendations. We wanted to give this heads up that the VaR distribution on the dashboard will be different now, but the overall VaR level remains unchanged.", "reads": 19, "readers_count": 18, "created": "2021-12-24T03:30:22.793Z"}], [], [{"topic_id": 5370, "post_id": 12674, "post_number": 2, "score": 38.8, "author_username": "inkyamze", "text": "Tracking nicely here. More details and insight coming next week.", "reads": 19, "readers_count": 18, "created": "2021-09-08T21:51:36.919Z"}], [], [], [], [{"topic_id": 3814, "post_id": 9639, "post_number": 2, "score": 109.4, "author_username": "JeremyKeating", "text": "I have read through the report from Gauntlet and I must commend them on the work that they have done. Clearly it is a good start in assessing one part of the risks that Aave is exposed to. I also see that there has been tremendous and impressive work by the Risk Community in Aave. I have read what I have been able to find in this risk documentation and other areas. It is clear that this is a topic genuinely considered and taken seriously.\nI do have some questions about the overall risks and it would be really helpful if someone knows the answers. I am from a background in money and risk (I am an actuary) but I am fairly new to Blockchain so I am sorry if I am asking anything silly.\n\n\nIs there an overall Aave Risk Register that records the risks that have been identified with their likely occurrence and impact and the approach taken to mitigate, avoid, accept or transfer? Both in terms of the protocol and our customers.\n\n\nThe report lists four categories of risk: Security risk, Governance risk, Oracle risk, and Market risk and others are mentioned elsewhere. But are there others that are not covered by these categories? For example Regulatory risk, Reputation risk (both for Aave and for Crypto in general), Ethical risk, Operational risk, etc. I can also see other categories have been considered by the Risk Community too. Has any work been done to create a list of all the risk categories and thought given to how to manage the categories?\n\n\nWhat levers have been identified for controlling risks? Are these documented and who has control over them? What is the consensus mechanism for moving these levers?\n\n\nIs the Gauntlet software open source so that others can check their findings and perform peer reviews on their results? Using open source software tools encourages decentralization and promotes trust.\n\n\nThere are types of risks borne by customers that are not borne by Aave for example Insurance Risk if they stake in the Insurance Pool. Should we consider if we have a duty of care towards customers to identify, manage, and communicate these risk and if so how do we approach their risks? For example has there been any modelling to understand the expected Insurance Pool return? How much do returns vary? Is this positive in the long-run? If so do we know what this is and should it be communicated to customers? If it is negative what needs to change? What is the probability of large losses? Do customers understand what they are investing into and can they cope with possible losses?\n\n\nDoes the Aave Community know what its acceptable risk tolerances are both in terms of the Protocol and in terms of customer outcomes? What level of liquidations in terms of numbers and amounts, over say a one year time horizon is acceptable? Has this been communicated to customers so they know what risk they are taking on? There seems to be focus on ensuring the protocol survives – which is obviously a good outcome and completely the right place to start. But it is kind of the minimum to achieve as a foundation.\n\n\nHas any consideration been given to varying the Risk Thresholds by size of the customer’s deposit? Perhaps it should start high and reduce as the size of the deposit increases?\n\n\nHas any thought been given to vulnerable customers? For example people who are in difficult personal circumstances and or who do not know what they are doing and could lose money that they need. Or customers who may suffer from personal, mental or addiction issues? Is Aave producing good outcomes for these customers and their families?\n\n\nThank you very much for taking time to read my questions and hopefully there are answers to at least some of them. There has been a lot of impressive work by the Aave Risk Community and it is clear that you take this area seriously and want to provide good outcomes. I am more than willing to help with finding answers if needed and if there is any scope to do so.", "reads": 47, "readers_count": 46, "created": "2021-05-30T18:35:04.112Z"}, {"topic_id": 3814, "post_id": 10099, "post_number": 3, "score": 67.4, "author_username": "AcceleratedCapital", "text": "Excellent report, @wfu! Thank you for putting this together for the community. It is great to see that the simulated stress tests showed protocol resilience toward insolvency. Here are some questions I had:\n\n\nWithin the correlation analysis, did you take into account the shift higher in correlation that typically occurs with periods of heightened market volatility?\n\n\nIn the report, you used correlation metrics and trailing volatility to estimate the price trajectories for assets that were either not liquid or not created during the historical Black Thursday market event. Given new information from the most recent drawdown we just had, did the assets you simulated in this way line up with what actually occurred?\n\n\nIn the conclusion of the report, you suggested that ongoing monitoring/adjustment of protocol parameters is crucial for reducing risk. Have you considered what an appropriate program or methodology for monitoring and adjustment would look like? What guardrails or triggers would you suggest putting in place to ensure that we are optimizing parameters during periods of high volatility/increased correlation?\n\n\nAgain, thank you for the report. I look forward to your continued involvement in the Aave community.", "reads": 37, "readers_count": 36, "created": "2021-06-05T18:36:51.294Z"}], [{"topic_id": 2322, "post_id": 8873, "post_number": 2, "score": 25.4, "author_username": "Josef", "text": "Very interesting points. Haven’t fully read this yet, but I wanted to give this attention. Will add more profound reply late (maybe)", "reads": 27, "readers_count": 26, "created": "2021-05-04T16:54:36.858Z"}, {"topic_id": 2322, "post_id": 9176, "post_number": 3, "score": 34.8, "author_username": "Michael_Padilla", "text": "I understand not all but this I think:\n\ncreate a new Market\nList new coins\nSet deposit and borrow fees to 0%\nafter a while when a high load is reached, increase the fees and earnings\n\nMy brainstorming:\n\n\nlet the project decide to set fees to minus, like a reward for testing new projects\n\n\nadd a second market for those projects before getting worthy to climb into main market.\n\n\nthis will give new projects a chance to make use of AAVE protocol\n\n", "reads": 24, "readers_count": 23, "created": "2021-05-13T22:01:37.169Z"}, {"topic_id": 2322, "post_id": 10513, "post_number": 4, "score": 53.4, "author_username": "A5burger", "text": "Yes, more eloquently put than I could. Pretty much the RAI proposal going through right now. Also a step towards the 1st part of my post, uncoupling from usd backed stables. Very cool.", "reads": 17, "readers_count": 16, "created": "2021-06-17T18:24:43.548Z"}], [{"topic_id": 2097, "post_id": 6873, "post_number": 2, "score": 33.2, "author_username": "haave", "text": "\n\n\n wfu:\n\nThe report analyzing the protocol will be published in the near future\n\n\nHas it been published anywhere?", "reads": 66, "readers_count": 65, "created": "2021-03-03T18:02:37.647Z"}, {"topic_id": 2097, "post_id": 6874, "post_number": 3, "score": 37.6, "author_username": "wfu", "text": "Not yet, the previous analysis was done for V1 contracts; we are currently wrapping up analysis for the V2 contracts as well.", "reads": 63, "readers_count": 62, "created": "2021-03-03T18:20:16.400Z"}, {"topic_id": 2097, "post_id": 8489, "post_number": 4, "score": 110.8, "author_username": "inkyamze", "text": "Now published: https://twitter.com/gauntletnetwork/status/1384180565855768584?s=20", "reads": 54, "readers_count": 53, "created": "2021-04-19T17:25:19.512Z"}, {"topic_id": 2097, "post_id": 43043, "post_number": 5, "score": 0.6, "author_username": "EzR3aL", "text": "", "reads": 3, "readers_count": 2, "created": "2024-03-31T15:19:40.510Z"}], [{"topic_id": 1879, "post_id": 7215, "post_number": 2, "score": 47.4, "author_username": "Emilio", "text": "Update on this front:\n\n\nThe design of the new IR strategy has been completed and an implementation is in progress.\n\n\nIn the meantime, the demand for stablecoins increased further, requiring an adjustment of the Lending rate oracle. As a consequence of that, the rate oracle will increase of 2 points (from 7%  to 9%) for USDC and 3 points (from 7% to 10%) for DAI, TUSD and USDT\n\n", "reads": 37, "readers_count": 36, "created": "2021-03-18T13:04:23.979Z"}, {"topic_id": 1879, "post_id": 7772, "post_number": 3, "score": 31.2, "author_username": "carlsagin22", "text": "I think this approach endangers the protocol.\nIf you remove stable borrow, you give competitors a massive point of differentiation which, quite frankly, I would leave the protocol to obtain.\nAs it stands currently, borrow rates are beginning to make the protocol differentiated against competition - for a second time - in a negative way. While there may be technical reasons why “something would achieve X,” I am concerned there is not a long term consumer lens involved in the considerations.\nBoth of these add easily targeted points of differentiation for any competitor to exploit. At the existing stable borrow rates, I have begun to utilize competitive products.\nI urge you to stop this path so I dont have to choose somewhere else. This protocol doesnt exist in a vacuum. It is easily better than competitors in many ways. Don’t make the main product offering uncompetitive.", "reads": 31, "readers_count": 30, "created": "2021-04-05T07:45:36.176Z"}], [], [{"topic_id": 776, "post_id": 1830, "post_number": 2, "score": 29.4, "author_username": "defidude", "text": "Hey! There is no decided migration deadline as suggested if you’re referring to the LEND<>AAVE migration. You’re actually in the perfect place to follow it in the event a deadline is voted on, there’s a thread about it going on here: Migration Deadline\nAs for Cream Finance pausing their LEND market, this is something I would think you would have to reach out to them about. Aave doesn’t have any control or say in how LEND or AAVE is used in their project, so if they are preventing you from withdrawing I would definitely get in touch with them.\nI am going to lock this thread as it doesn’t seem directly related to protocol risk, or something the governance is involved in, but rather a user-focused issue. However you can always get support from the Aave Discord (https://aave.com/discord), the live chat directly on the website, or by e-mailing wecare@aave.com - otherwise just shoot me a DM and I’m also happy to help!", "reads": 47, "readers_count": 46, "created": "2020-10-09T18:12:32.063Z"}, {"topic_id": 776, "post_id": 1831, "post_number": 3, "score": 9.0, "author_username": "defidude", "text": "", "reads": 45, "readers_count": 44, "created": "2020-10-09T18:12:40.555Z"}]]