[{"url": "https://governance.aave.com//t/arfc-deprecate-aave-v2-amm-market", "topic_id": 12830, "title": "[ARFC] Deprecate Aave V2 AMM Market", "posts_count": 20, "views": 3399, "like_count": 6, "author_username": "Pauljlei", "created": "2023-04-21T00:51:29.795Z", "text": "\nSimple Summary\nFor clarity, we are starting a separate forum thread to follow up on the conversation here two weeks ago.\nGiven the low usage of the V2 AMM market and its risk/reward profile, this is a temperature check for deprecating the Aave V2 AMM market. Forum discussion can be found here.\nSpecifically, to\n\nSet Liquidation Threshold to 0 for all LP Tokens\nFreeze all other assets (DAI, USDC, Tether, WBTC, ETH)\n\n\nMotivation\nGiven the low level of usage on the AMM V2 market, and the fact that the only unfrozen assets are now majors (DAI, USDC, USDT, WBTC, ETH) that are available on V2 ETH and V3 ETH, we recommend deprecating the AMM V2 market. This includes setting LTs to zero for all LP tokens, and freezing all other assets (DAI, USDC, Tether, WBTC, ETH).\nFreezing assets does not liquidate positions. Setting LTs to zero can liquidate affected accounts (users who borrow against LP token collateral). There are currently ~$150k deposits of LP tokens in the market.\n\nNext Steps\n\nIf the Snapshot vote passes, publish AIP with ample notice time for users to adjust their positions as needed.\n", "reads": 81, "readers_count": 80, "score": 1655.6, "word_count": 908, "category_id": 7}, {"url": "https://governance.aave.com//t/suspicious-transactions-during-aave-borrowing", "topic_id": 17424, "title": "Suspicious transactions during Aave borrowing", "posts_count": 7, "views": 264, "like_count": 1, "author_username": "soundbytec", "created": "2024-04-20T05:31:19.091Z", "text": "Hi,\nit seems there is a suspicious transaction, which moved some of the aEthWETH (created during borrowing at Aave) from my account to a different account. Is this something Aave related?\nTransaction hash: 0x09f8446f2cd2bbd5ed12edddc8d38988d7e9fd5f3ffdb86e1c0d113ce106b28d\nThanks for looking into it.\nBest,\nsounbytec", "reads": 31, "readers_count": 30, "score": 68.6, "word_count": 405, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-market-alert-high-price-volatility-and-liquidations-04-13-2024", "topic_id": 17360, "title": "Chaos Labs Market Alert - High Price Volatility and Liquidations - 04/13/2024", "posts_count": 2, "views": 338, "like_count": 11, "author_username": "ChaosLabs", "created": "2024-04-13T21:17:18.613Z", "text": "Markets are experiencing high volatility, which is leading to higher-than-usual liquidations across Aave deployments. We are closely monitoring the markets and will continue updating the community as necessary.", "reads": 43, "readers_count": 42, "score": 228.4, "word_count": 742, "category_id": 7}, {"url": "https://governance.aave.com//t/temp-check-onboard-llamarisk-as-aave-risk-service-provider", "topic_id": 17053, "title": "[TEMP CHECK] Onboard LlamaRisk as Aave Risk Service Provider", "posts_count": 13, "views": 1583, "like_count": 48, "author_username": "LlamaRisk", "created": "2024-03-20T14:57:55.661Z", "text": "Summary\nLlamaRisk proposes to support Aave as a risk management service provider, reinforcing the DAO’s reputation for prioritizing protocol resiliency and user assurances. With a proven track record of thorough risk analysis, an unbiased approach, and an unwavering commitment to the success of our partner protocols, we have earned the trust and endorsement of those we work with.\nLlamaRisk was established in 2021 as a service to Curve DAO and its LPs, providing risk transparency analyses of assets listed on Curve, including stablecoins, RWAs (Real World Assets), LSTs (Liquid Staking Tokens), and LRTs (Liquid Restaking Tokens). In 2023, we partnered with Prisma Finance to develop a comprehensive framework for assessing LST collateral risk, which we have used to produce detailed analyses for onboarding assets onto the protocol. We have since expanded our suite of risk management solutions with agent-based simulations and DeFi strategy management.\nMotivation\nLlamaRisk is a DeFi-native risk firm that understands the delicate balance protocols face to remain competitive in a rapidly evolving landscape without sacrificing responsible, sustainable practices.\nOur core values are transparency and accountability. When armed with reliable and objective information, DAOs and their users are equipped to take action in their best interest. Therefore, our duty is to consistently demonstrate sound reasoning based on thorough analysis that our partners have come to depend on.\nLlamaRisk has distinguished itself through:\n\nLong-form Comprehensive Risk Analysis: Over the last two years, we have published over 70 long-form risk assessments in the public domain. Our procedures and QA/QC processes ensure we present clear, unbiased information.\nGovernance & Parameterization Recommendation: We have a longstanding history of providing consultation for our risk analyses. Our detailed reports, along with a hands-on approach, have informed critical decisions within our partner DAOs.\nDiversity of DeFi Knowledge: Our team understands many protocol architectures, especially concerning stablecoins, liquid staking derivatives, and pegged assets generally. This knowledge comes from extensive research, development, and hands-on experience with various DeFi protocols, enabling us to anticipate and mitigate risks effectively.\nCommitment to Innovation: At LlamaRisk, we continually evolve our methodologies and tools to stay at the forefront of DeFi research and risk management, ensuring our strategies are effective.\n\nSpecification\nRecognizing the significance of a dual risk provider model, LlamaRisk’s proposal is designed to complement Chaos Labs’ risk services, with whom we plan to collaborate extensively.\nThe initial 6-month engagement, which may be extended pending DAO approval, involves the following scope:\n\nOn-demand Risk Assessments: LlamaRisk will deliver prompt and in-depth risk assessments for assets listed or considered to be listed on Aave with particular emphasis on the collateral types comprising the GHO stablecoin. This will involve developing a custom framework tailored specifically to the categories of relevant assets and Aave’s needs, which will standardize the assessment process.\nCollaborative Engagement with Chaos Labs: We plan to collaborate extensively with Chaos Labs, combining our expertise to provide Aave with comprehensive and nuanced risk analysis, enhancing the protocol’s risk management capacity.\nActive Involvement in DAO Governance: LlamaRisk will actively participate in Aave’s DAO governance, offering informed insights and strategic recommendations on risk management practices for principal stakeholders and the community.\nLegal Regulatory Advisory and Policy Work: We will offer specialized legal research and regulatory guidance, including a thorough analysis of evolving legal frameworks and regulatory policies, and equip Aave with the necessary foresight to navigate the regulatory landscape of the DeFi sector effectively.\n\nRisk vectors are diverse and cannot be fully managed by qualitative risk tools. That is why we specialize in comprehensive risk assessment of tokenized assets and DeFi protocols. Our work supports our partners in making informed decisions that mitigate potential threats and promote a culture of transparency and sustainability. Our team of experts meticulously evaluate various risk factors, including but not limited to:\n\nProtocol design and architecture\nTokenomics and economic incentives\nSmart contract security\nGovernance mechanisms\nRegulatory compliance\n\nLlamaRisk leverages advanced simulation techniques, including statistical and agent-based modeling, to test and validate DeFi protocols and their collateral assets under various stress scenarios. Our simulations provide valuable insights into potential risks, allowing our partner protocols to set competitive parameters resilient to adverse market conditions.\nOur DeFi strategy managers employ data analytics and risk monitoring tools that allow us to maintain high efficiency and safety standards. We support our partners with publications and dashboards that give users the information they need to interact with the protocol responsibly.\nOur advisory services cater to the unique needs of DeFi projects, providing strategic guidance and support throughout their lifecycle. From ideation to implementation, our experienced advisors offer expert advice on protocol design, tokenomics, governance, and risk management strategies, ensuring optimal outcomes for our partners.\nComment\nTraversing the complex regulatory landscape is crucial for DeFi protocols and projects. Our team of legal experts provides in-depth analysis and guidance to ensure compliance with applicable laws and regulations. We evaluate legal risks, assist with regulatory filings, and help clients develop robust strategies for operating within the evolving regulatory framework.\nWe actively engage in policy development and legislative processes related to crypto and blockchain at national, supranational, and international levels. This includes participating in specialized working groups, contributing opinions to public discussions on regulatory developments, and involvement in policymaking dialogues. We aim to ensure that DeFi stakeholders are represented and protected in the evolving regulatory landscape, facilitating informed and proactive responses to legislative changes.\nDuration & Proposed Budget\nWe propose a flexible retainer model for our collaboration, with an initial 6-month commitment. This model is designed to ensure maximum efficiency in resource utilization, with a commitment to transparency and responsible financial management.\nThe budget request is $250,000 for a 6-month engagement.\nDetailed quarterly reports on our spending will be provided, with any unused funds either carried over to the next quarter or returned to the Aave DAO, as preferred.\nOverall, this proposed scope is an opportunity for LlamaRisk to demonstrate its ability to make an appreciable improvement in Aave’s risk management, which is a pragmatic and cost-effective onboarding strategy. It also serves as an introduction to building a working relationship with Chaos Labs and DAO stakeholders. We intend to demonstrate our value throughout a 6-month engagement and expand our suite of services as pain points are identified.\nWe are a flexible and agile team ready to work together to provide risk management solutions that will suit Aave’s specific needs within the wider organization of service providers and stakeholders making up the DAO.\nUseful Links\nYou can find in this section links to our work:\n\nCurve Gauge Risk Substack (CryptoRisk Assessments): We publicize research related to assets with Curve pools (mostly stablecoins and RWAs) with attention to risks to the Curve gauge and governance system\nPrismaRisk Hackmd: We publicize comprehensive collateral risk assessments for proposed collateral assets on Prisma Finance (LSTs and LRTs)\nLlamaRisk Hackmd: We publicize comprehensive collateral risk assessments for potential collateral assets for Curve crvUSD\nArcadiaSim: Update 1,  Update 2, Update 3, Update 4 & Update 5\nSturdy Finance crvUSD Aggregator: Sturdy V2 app of the aggregator managed by LlamaRisk\nAggregator Dune Dash: LlamaRisk dashboard monitoring the aggregator and underlying assets\nAggregator Oracle Explainer: Publication on Sturdy silos Oracle design\nResponse to FCA Discussion Paper DP23/4: Our response to the UK Financial Conduct Authority’s Discussion Paper on Regulating Cryptoassets Phase 1: Stablecoins\nDeFi Yield Optimizers: The legal status of DeFi yield optimizers under the EU crypto regulatory framework\nSubDAO Legal Entity Formation: Llama Risk resources for DAO sub-orgs in search of suitable legal structures\n\nDisclaimer\nThis proposal is powered by Skywards. The Aave Chan Initiative is not directly affiliated with LlamaRisk and did not receive compensation for creating this proposal.\nNext Steps\n\nIf consensus is reached on this [TEMP CHECK], escalate this proposal to the Snapshot stage.\nIf the Snapshot outcome is YAE, this proposal will be escalated to ARFC stage\nPublication of a standard ARFC, collect community & service providers’ feedback before escalating the proposal to the ARFC snapshot stage\nIf the ARFC snapshot outcome is YAE, publish an AIP vote for final confirmation and enforcement of the proposal\n\nCopyright\nCopyright and related rights waived under CC0", "reads": 108, "readers_count": 107, "score": 635.6, "word_count": 4290, "category_id": 7}, {"url": "https://governance.aave.com//t/can-ausdt-ausdc-be-blocked", "topic_id": 16705, "title": "Can AUSDT/AUSDC be blocked?", "posts_count": 3, "views": 437, "like_count": 2, "author_username": "maokah", "created": "2024-02-21T20:55:45.042Z", "text": "Hello,\nim living in a totalitarian country and I always have the fear that my USDC/USDT can be blocked. Yes I know that holding your keys with ETH/BTC is the best way but lets say you need to stable out your balance from risks.\nNow, since USDC/USDT can be banned if owned myself in my own wallet. What happens if I deposit/lend it on Aave and receive AUSDT/AUSDC. Can that still be banned since its within a smart contract? Or what happens if the USDC/USDT is getting banned?\nBest Regards", "reads": 35, "readers_count": 34, "score": 92.0, "word_count": 199, "category_id": 7}, {"url": "https://governance.aave.com//t/phishing-attack-please-help", "topic_id": 15934, "title": "Phishing attack - Please help", "posts_count": 3, "views": 784, "like_count": 2, "author_username": "Spiraklas", "created": "2023-12-25T18:10:43.511Z", "text": "Hi there,\nI just noticed that I lost all my AAVE at eth and polygon chain. Is there something we can do to inform others ? Are the rest coins in danger? To whom should I talk to start an investigation or blacklist the contract address that the stolen AAVE was been sent to?\nTxn 0x2eb153a8ebd0d01bac82cedf7f0db318dae6f40010faa95c020bc852f94d69cc\nThis is the Phishing address at Polygon 0x0000db5c8B030ae20308ac975898E09741e70000\nSome of my aave sent here 0x53d0E4dAb3E125dd25EcfB24Ca610075Fa9bC8e1\nand some other here 0xF230aa03B9ada2da105Cc938479B78b27DF44e7C\nMy AAVE end up to 3 wallets . They have hundres of AAVE each.\n0x2aCeda63B5e958c45bd27d916ba701BC1DC08F7a\n0xa236278beC0e0677A48527340cfB567b4E6e9AdC\n0xa9077cDB3D13F45B8B9d87C43E11bCe0e73d8631\nPlease reply with any info u think might help.\nThanks", "reads": 23, "readers_count": 22, "score": 464.6, "word_count": 170, "category_id": 7}, {"url": "https://governance.aave.com//t/whats-next-for-usdc-e-on-arb", "topic_id": 15405, "title": "What's next for USDC.e on ARB?", "posts_count": 3, "views": 1046, "like_count": 1, "author_username": "TooSweetTooPotato", "created": "2023-11-07T23:47:13.114Z", "text": "I have recently taken out a loan for USDC.e on Arbitrum V3.\nSince then stable borrowing was disabled and USDC.e removed from AAVE.\nNow the USDC.e position is frozen and I can’t even repay the loan if I wanted to ?\nI hope this situation will be resolved quickly and I want to keep my loan open for a longer period of time than just a couple days. What are the next proposals/Solutions for this ?\nI can’t find it anywhere. Ps, I hope this is not next Anchor Protocol. I have been monitoring AAVe for years actively but just recntly I decided to use it and already this problem occured… Thanks", "reads": 39, "readers_count": 38, "score": 242.8, "word_count": 177, "category_id": 7}, {"url": "https://governance.aave.com//t/gho-depeg-and-liquidity-analysis", "topic_id": 15250, "title": "GHO Depeg and Liquidity Analysis", "posts_count": 7, "views": 1467, "like_count": 19, "author_username": "ChaosLabs", "created": "2023-10-27T08:56:43.015Z", "text": "Summary of Events\nOn October 26th, between 9:15 AM and 10:15 AM UTC, a significant de-peg of GHO occurred, dropping its price from $0.962 to $0.946. This event represents the most substantial de-pegging observed since the token’s inception. The decline is attributed to a liquidity drain from the main pool, Uni V3 GHO/USDC. Although prices have since rebounded, the issue of liquidity inadequacy necessitates careful consideration.\nPrice Analysis\nAt 9:15 AM UTC, the GHO token encountered an abrupt price decline, reaching a low of $0.946. Subsequently, it has rebounded to its pre-drop price level.\n\nSince its inception, GHO has generally traded below its peg, though consistently above $0.96. The recent price dip has led to an unprecedented low for GHO, well below its previous trading levels.\n\nLiquidity Analysis\nThe primary liquidity pools for GHO are Uniswap V3 and Balancer. However, due to the pool’s composition on Balancer compared to the higher liquidity concentration on Uni V3, the primary source of liquidity has been the Uniswap pool.\n\nBalancer pool composition\n\nUniswap GHO/USDC pool liquidity concentration on 26.10\nUntil September 23rd, over $2.7 million worth of USDC tokens were locked in the GHO/USDC pool. However, in the subsequent two weeks (between September 23rd and October 6th), approximately $2.5 million in USDC tokens were withdrawn from the pool, primarily through a combination of liquidity removal from LP positions and GHO-to-USDC swaps. This trend of decreasing liquidity persisted over the following weeks, and by October 17th, it had fallen below 100,000 USDC. This period was marked by heightened price volatility, culminating in today’s significant price drop.\n\nUniswap V3 GHO/USDC pool\n\n\nConclusion\nThe consistent withdrawal of USDC from the Uniswap V3 pool has led to a significant decline in GHO’s price, reaching its lowest point since its inception. Maintaining a stable peg is critical for accepting stablecoins, so we want to emphasize to the Aave community that the current liquidity levels may jeopardize GHO’s stability. We will collaborate with community members to propose proactive measures to enhance liquidity, reinforcing GHO’s peg and instilling confidence in its widespread adoption. This concerted effort will contribute to the steadfastness and trustworthiness of the GHO peg.", "reads": 89, "readers_count": 88, "score": 452.8, "word_count": 1746, "category_id": 7}, {"url": "https://governance.aave.com//t/lending-market-improvements-irm-automation", "topic_id": 14070, "title": "Lending Market Improvements: IRM Automation", "posts_count": 7, "views": 1430, "like_count": 23, "author_username": "BlockAnalitica", "created": "2023-07-20T06:49:42.158Z", "text": "Background\nThe dominant DeFi lending markets use a peer to pool model, where lenders supply assets into a pool which can then be utilized by borrowers. Supply and demand for liquidity are balanced dynamically via utilization based interest rate models (IRMs), where the cost of borrowing (and return on lending) increase as more liquidity is withdrawn from the pools. This helps ensure that lenders have adequate liquidity to be able to withdraw their funds on demand, by incentivizing borrower repayments and new deposit inflows in cases where liquidity falls to low levels.\nMost IRM mechanisms use a “jump rate model”, where borrowing rates rise slowly up to an optimal utilization level, and then increase rapidly as utilization increases above the optimal point towards 100%. In normal conditions changes in utilization have a limited impact on borrow rate volatility, while the steep “slope” of borrow rates over the optimal point offer strong assurance against illiquidity risk.\nHistorically, these rate models have remained mostly static despite significant changes in market conditions. For example, in the height of the bull market, borrow rates frequently found equilibrium at high levels above the optimal utilization point, while in the bear market they have settled far below the optimal utilization point.\nLenders earn a return proportionally to both the interest rate paid by borrowers and utilization rate of the pool as a whole, meaning that the overall efficiency of peer to pool lending markets is maximized when utilization is at relatively high levels, typically around the optimal utilization point. The lack of adaptive updates to rate models therefore represents a missed opportunity to improve money market efficiency and welfare of borrowers, lenders, and the protocol as a whole.\nDesign Goals\nAs discussed above, static utilization based IRMs have significant drawbacks in terms of market inefficiency and user welfare. A mechanism design solution to these drawbacks should fulfill the following criteria:\n\nMaintain market safety by mitigating illiquidity risk\nImprove market efficiency, as measured by the spread between supply and borrow rates\nLimit governance workload and requirements for active management\nMinimize interest rate volatility\n\nBelow we describe one solution to optimize IRMs which addresses the key weaknesses of existing static models, while minimizing ongoing management and governance complexity.\nMechanism\nThe proposed mechanism adds a simple controller to the traditional utilization based IRMs. This allows for borrow rates to be adjusted to target the market utilization around the optimal level, automatically adapting to changes in equilibrium borrow rates without requiring active governance. Over time this should result in better market efficiency and narrower spreads between supply and borrow rates.\nThe core utilization based IRM remains broadly unchanged from existing lending protocols. Borrower interest rates are determined by a two part linear function, with interest rates at 0% utilization starting at a low base value, scaling up slowly towards an optimal interest rate at a selected optimal level of utilization, and then increasing rapidly to a high maximum interest rate as utilization increases beyond optimal levels towards 100%.\n\nA controller adjusts the interest rate at optimal utilization, and potentially also the base interest rate, depending on realized utilization levels over the prior period. Utilization levels can be determined implicitly based on past period realized borrow rates, which in turn are measured by comparing current supplier token (hereafter called cToken) exchange rate to its underlying asset versus the exchange rate at the beginning of the period.\nIn cases where utilization is higher than target, interest rates are increased to encourage additional deposits or loan repayments. If utilization is below target, borrow rates are reduced to encourage additional borrowing or withdrawals of excess liquidity. Over time this should lead to utilization more closely adhering towards the optimal point, leading to improvements in market efficiency without compromising on liquidity risk.\n\nEfficiency score noted above is a composite value determined based on the relative and absolute spreads between supply and borrow rate at a given utilization, and recognizes that users benefit from each of these values being minimized as much as possible. The score is calculated as supply rate as a share of borrow rate (1 minus the relative spread), divided by the absolute spread. We can see that this measure of efficiency is maximized at or slightly below the optimal utilization rate of a market.\nController Parameters\nThe controller has several parameters that must be selected by protocol governance. This includes the time period where past rates are evaluated and IRM adjustments are made, and the degree of rate adjustments when utilization is above or below target.\nBecause the maximum borrow rate at 100% utilization is intended to be high enough to ensure that markets don’t remain illiquid for prolonged periods, it generally should not be necessary to adjust this rate via the controller. However, in cases where it is technically simpler to have the maximum rate shift on a one for one basis with optimal borrow rate (eg. due to the max rate being calculated based on a premium vs the optimal borrow rate), this should not cause any negative impacts.\nFor many peer to pool money markets, the base rate at 0% utilization is set as 0% borrowing cost, and in these cases it should not be necessary to adjust base rate via the controller as utilization should trend towards optimal rates regardless. For markets with non-zero base rate, it may be necessary to make controller adjustments to this rate to ensure there is sufficient slope between the base and optimal borrow rates to allow for price discovery.\nThe controller has the following parameters:\n\nUpdate frequency: determines length of time where interest rate and utilization levels are evaluated, as well as the frequency of adjustments to the interest rate model (minimum time period that must elapse between updates)\nMax target utilization: the maximum targeted level of market utilization, above which interest rates are progressively increased to encourage deposits or repayments\nMin target utilization: the minimum targeted level of market utilization, below which interest rates are progressively reduced to encourage additional borrowing\nOverutilization adjustment: degree of increase to interest rates when utilization exceeds maximum target\nUnderutilization adjustment: degree of reduction to interest rates when utilization falls below minimum target\nRate floor: absolute minimum rate(s) able to be set by the controller\n\nWhile exact settings for the controller are open to refinement, the below reference parameters should fulfill the overall design goals for the mechanism.\n\nUpdate frequency: 1 day\nMax target utilization: equal to optimal utilization ratio of the market\nMin target utilization: optimal utilization ratio minus 20% (eg, 60% min target utilization if market has optimal utilization ratio of 80%, or 25% min target utilization for markets with optimal utilization ratio of 45%)\nOverutilization adjustment: increase interest rates by 0.2%\nUnderutilization adjustment: reduce interest rates by 0.1%\nRate floor: 50% of initial optimal borrow rate determined by governance (eg 2% for Aave stablecoins)\n\nIn effect, if the increase in value of cTokens over the preceding period indicates a weighted average utilization outside the min or max target utilization rates, then the interest rate model is updated according to the underutilization or overutilization adjustment parameter.\nWhenever a rate adjustment is made, the controller must recalculate the supply rate that corresponds to optimal utilization levels to ensure that future period adjustments accurately reflect market conditions.\nDerivation and Examples\nWe denote the exchange rate of supplier tokens to underlying assets at time t as V(t). The supplier interest rate Rs over a given time period p can be calculated based on the length of time in the period, and relative exchange rate of lending tokens to underlying at times t-p and t.\nRs(t) = (V(t) / V(t-p)) ^ (1 year / p)\nIf p is 1 day, and the exchange rate of supplier token to underlying has increased from 1 to 1.0001 over the period, then the equation would be filled in as follows:\nRs(t) = (1.0001 / 1) ^ (365 / 1) ≈ 1.037 = 3.7%\nGiven a realized geometric mean supply rate over the period, we must determine whether it corresponds to a utilization ratio above the max target utilization, below the min target utilization, or within the target utilization range. We can do this by referencing the supply rate against market parameters set at the beginning of the sample period.\nLet the borrow rate at time t equal Rb(t), utilization rate of the pool equal U, and reserve factor equal F. This yields the following equation relating supply rate to utilization.\nRs(t) = Rb(t) * (1 - F) * U\nNow, we simply calculate the supply rate at the min and max target utilization ratios based on market parameters at the beginning of the period. For example, if a market has a reserve factor of 10%, optimal utilization ratio of 80%, base borrow rate of 0%, and optimal borrow rate of 4%, then using the example controller parameters from the previous section we would need to calculate supply rate at 60% utilization (min target) and 80% utilization (max target).\nMax target utilization: Rs = [(0.04 - 0) * (0.8 / 0.8)] * (1 - 0.1) * 0.8 = 0.0288 = 2.88%\nMin target utilization: Rs = [(0.04 - 0) * (0.6/0.8)] * (1 - 0.1) * 0.6 = 0.0162 = 1.62%\nSo, if the realized geometric mean supply rate is below 1.62% over the period, the interest rate model would be adjusted according to the underutilization adjustment parameter, and if mean supply rate is above 2.88% the rate model would be adjusted according to the overutilization adjustment parameter.\nContinuing the above example, let’s assume that realized geometric mean supply rate was 3%, indicating utilization above target. The rate model would be adjusted to increase optimal borrow rate by 0.2% to 4.2%. New supply rates corresponding to min and max target utilization ratios would now be calculated based on the updated rate model.\nMax target utilization: Rs = [(0.042 - 0) * (0.8 / 0.8)] * (1 - 0.1) * 0.8 = 0.03024 = 3.024%\nMin target utilization: Rs = [(0.042 - 0) * (0.6/0.8)] * (1 - 0.1) * 0.6 = 0.01701 = 1.701%\nAt the end of the next period, these updated supply rate values would be used to determine whether utilization was above or below target.\nImplementation\nOwnership of or permissions over the relevant interest rate model(s) would be granted to a controller, which itself would be owned by the protocol governance. The controller would store values for supply rates corresponding to min and max target utilization ratios, as well as the exchange rate between cToken and underlying token, and time the last update was triggered.\nAfter at least as much time as the selected period has elapsed since the last controller update, anyone would be permitted to call the controller contract to trigger an update. The controller would record the current time and new cToken to underlying exchange rate, and then compare against the previous stored time and exchange rate to calculate the geometric mean supply rate over the period. It would then compare this realized supply rate against the stored supply rates corresponding to min and max utilization ratios to see whether it is within or outside of the target range.\nIf the realized supply rate indicates utilization is within the target range, no further action is needed. The controller would store the new timestamp while retaining the previously stored min and max supply rates. This would reset the countdown before a new update becomes possible, after the given period time frame has elapsed.\nIf realized supply rate indicates utilization is outside of the target range, then the controller would trigger an update to the interest rate model according to the relevant underutilization or overutilization adjustments. Based on the resulting rate model parameters, the controller would recalculate the supply rates corresponding to min and max target utilization ratios, and store these values along with the new timestamp.\nGovernance would have the ability to update controller parameters to optimize the rate model automation scheme based on growing familiarity with the mechanism or changing market conditions. Alternatively, governance could deauthorize the controller and return to a manual rate model parameter setting framework.\nGeneral Notes\nTo maintain gas efficiency and avoid burdening users with additional state updates, controller updates would be handled separately from standard market interactions. In some cases this could result in the controller not being updated for an extended time frame far longer than the given minimum update period. If the utilization ratio has been within the target range for a long period of time, then deviations from the range may not be immediately recognized until the controller has undergone a new update cycle. Because market liquidity is primarily ensured via the steep slope between optimal and maximum borrow rates, this should cause minimal disruption or reduction in the mechanism’s efficacy. Protocols could consider engaging with an in house or decentralized keeper network to encourage more regular controller updates.\nUse of geometric mean of realized supply rates to assess utilization, alongside a “jump rate” style interest rate model with high maximum borrow rate, results in asymmetric adjustments to deviation from target utilization range. This can be demonstrated via an example: consider a market with 0% base rate, 4% optimal borrow rate at 80% utilization, and 50% maximum borrow rate. If the market reached 100% utilization for at least 6.5% of the given period, this would ensure an overutilization adjustment in the controller regardless of how low utilization (and supply rate) were for the remainder of the period. In a slightly less extreme example, utilization reaching 85% for as little as 25% of a given period would ensure an overutilization adjustment even if utilization was 0% for the remainder of the period. This is arguably a feature and not a bug, as conservative management of optimal rates to ensure market liquidity also has the beneficial side effect of strongly curtailing interest rate volatility. Over time this can be expected to improve borrower user experience.\nThis paper discusses rate model controllers in the context of standard interest rate models with explicit borrow rate curves and implied supply rates, used in Aave v2 and v3 as well as Compound v2. In principle it could also be easily adapted to markets with explicit supply rate curves such as Compound v3. In this case supply rate could be directly related to utilization, rather than via calculations as is the case with classical borrow rate models.\nConclusion\nThe above mechanism is able to achieve the stated design goals with minimal technical complexity or governance workload. This will allow liquidity protocols to improve market efficiency while freeing up governance and service provider workflows to address more complex, higher value goals. It offers a path towards greater automation of liquidity protocols, which in the long run can bring the benefits of greater decentralization and resilience.\nWe at Block Analitica look forward to sharing more on this and other mechanism design improvements for liquidity markets in the coming months. If your protocol is interested in implementing deeper automation, feel free to get in touch and we’ll be happy to discuss how we can help.", "reads": 80, "readers_count": 79, "score": 2076.0, "word_count": 3573, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-market-alert-high-price-volatility-and-liquidations-08-17-2023", "topic_id": 14529, "title": "Chaos Labs Market Alert - High Price Volatility and Liquidations - 08/17/2023", "posts_count": 1, "views": 547, "like_count": 3, "author_username": "ChaosLabs", "created": "2023-08-17T22:15:11.283Z", "text": "Markets are experiencing high volatility leading to higher-than-usual liquidations across Aave deployments.\nWe are closely monitoring the markets and will continue updating the community as necessary.\nLiquidation data can be found on the Chaos Labs Risk Monitoring Platform.\n", "reads": 31, "readers_count": 30, "score": 181.0, "word_count": 52, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-gauntlet-supply-cap-updates-for-wmatic-on-polygon-aave-v3-2023-07-28", "topic_id": 14181, "title": "ARFC: Gauntlet Supply Cap Updates for WMATIC on Polygon Aave V3 2023-07-28", "posts_count": 6, "views": 815, "like_count": 2, "author_username": "Gauntlet", "created": "2023-07-28T22:40:21.018Z", "text": "Summary\nGauntlet recommends supply cap changes for one asset on Polygon Aave V3.\nPer Gauntlet’s supply and borrow cap methodology, we recommend increasing WMATIC supply cap to 120,000,000.\nMotivation\nThe supply cap for WMATIC surpassed the 75% threshold to 76% usage on Polygon Aave V3. Based on the asset’s market ADV and liquidity depth, our Methodology supports increasing the cap to 120M ($85M).\n\nSpecifications\nPolygon Aave V3\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nWMATIC Supply Cap\n105,000,000\n120,000,000\n\n\n\n\nNext Steps\nOnce we receive feedback from @ChaosLabs on the above recommendations, we will move forward with Risk Steward actions.", "reads": 42, "readers_count": 41, "score": 138.2, "word_count": 238, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-recommendation-to-lower-crv-lt-on-v3-ethereum-and-polygon", "topic_id": 14302, "title": "Gauntlet recommendation to lower CRV LT on v3 Ethereum and Polygon", "posts_count": 6, "views": 1013, "like_count": 12, "author_username": "Gauntlet", "created": "2023-08-04T01:14:16.251Z", "text": "Summary\nGiven the declines in DEX liquidity for CRV and other associated risk factors for CRV, Gauntlet recommends reducing the LT and debt ceiling for CRV on Ethereum v3.\n\n\nWe recommend reducing CRV LT from 61% to 41% and the LTV from 55% to 35%.\n\nAs of 8/3, this does not cause accounts to become liquidatable.\n\n\n\nWith expediency in mind, we recommend to also reduce debt ceiling from $20m to $5m due to low usage.\n\nCurrently, there is $65k / $20m of the debt ceiling used.\n\n\n\nNext steps\nDue to various risk factors associated with CRV, we recommend moving directly to AIP on August 4th.\nWe welcome community feedback.", "reads": 53, "readers_count": 52, "score": 565.6, "word_count": 462, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-gauntlet-supply-cap-updates-for-usdt-on-eth-aave-v3-2023-08-01", "topic_id": 14226, "title": "ARFC: Gauntlet Supply Cap Updates for USDT on ETH Aave V3 2023-08-01", "posts_count": 4, "views": 760, "like_count": 1, "author_username": "Gauntlet", "created": "2023-08-02T02:00:28.112Z", "text": "Summary\nGauntlet recommends supply cap changes for one asset on ETH Aave V3.\nPer Gauntlet’s supply and borrow cap methodology, we recommend increasing USDT supply cap to 320,000,000.\nMotivation\n\nUSDT supply cap is at (80%) usage on Ethereum Aave V3 .\nSpecifications\n\nEthereum Aave V3\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nUSDT Supply Cap\n200,000,000\n320,000,000\n\n\n\n\n\nNext Steps\nOnce we receive feedback from @ChaosLabs on the above recommendations, we will move forward with Risk Steward or AIP actions.", "reads": 34, "readers_count": 33, "score": 86.8, "word_count": 159, "category_id": 7}, {"url": "https://governance.aave.com//t/fraxlend-risk-management-model", "topic_id": 14213, "title": "FraxLend risk management model", "posts_count": 3, "views": 615, "like_count": 4, "author_username": "ProfitMaxi", "created": "2023-08-01T11:10:15.017Z", "text": "Why doesn’t Aave have a similar risk management model to FraxLend, where all the parameters are triggered automatically and do not depend on slow governance procedures? If AAVE has an automated model, a bad CRV scenario will probably never be allowed. I’m trying to digest why the AAVE model is better than FRAX, and I can’t find a good reason—the less human intervention for market reactions, the better, imho.", "reads": 44, "readers_count": 43, "score": 183.8, "word_count": 116, "category_id": 7}, {"url": "https://governance.aave.com//t/mkr-position-move-from-v2-to-v3", "topic_id": 14398, "title": "MKR position move from v2 to v3", "posts_count": 3, "views": 607, "like_count": 5, "author_username": "Leritu", "created": "2023-08-09T13:54:43.975Z", "text": "Hello Aave community. I’ve been a loyal user of the Aave platform – but I currently have an issue. I currently have a position where I have supplied about 5,500 MKR to v2 Aave and have then borrowed a little over $1.4 million DAI against my MKR supply on V2. I would like to use DeFi Saver to “loan shift” my position from v2 to v3… but the shift would breach the supply cap of MKR on v3… since v3 only has room for about 2300 MKR as of this writing.\nIs there a willingness to create a higher supply cap at v3 on MKR so that I can migrate my position over? Otherwise…I’m really stuck on v2.", "reads": 41, "readers_count": 40, "score": 98.2, "word_count": 198, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-market-update-7-30-2023", "topic_id": 14194, "title": "Gauntlet Market Update - 7/30/2023", "posts_count": 4, "views": 902, "like_count": 6, "author_username": "Gauntlet", "created": "2023-07-30T20:41:40.782Z", "text": "Gauntlet is looking into recent changes in CRV liquidity, as well as monitoring user positions for CRV.\nThe HF of DeBank | The Web3 Messenger & Best Web3 Portfolio Tracker is 1.64, meaning CRV needs to go to 0.37 to trigger liquidation at the moment.\nWith the upcoming AIP, the LT is being lowered to 0.49, so the price at which a liquidation occurs is 0.415\nWe are looking into it and will let the community know of next steps. We welcome any thoughts from the community.", "reads": 53, "readers_count": 52, "score": 435.6, "word_count": 154, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-gauntlet-risk-parameter-updates-for-ethereum-v3-arbitrum-v3-ethereum-v2-2023-06-26", "topic_id": 13825, "title": "ARFC: Gauntlet Risk Parameter Updates for Ethereum v3, Arbitrum v3, Ethereum v2 2023-06-26", "posts_count": 7, "views": 3375, "like_count": 9, "author_username": "Gauntlet", "created": "2023-06-27T05:08:41.528Z", "text": "Simple Summary\nA proposal to adjust risk parameters, including Loan To Value, Liquidation Threshold, and Liquidation Bonus across 6 assets on Ethereum v3, Arbitrum v3 and Ethereum v2.\nAbstract\nThese parameter updates are a continuation of Gauntlet’s regular parameter recommendations. Our simulation engine has ingested the latest market data (outlined below) to recalibrate parameters for the Ethereum v3, Ethereum v2, and Arbitrum Aave v3 protocols.  regarding lowering liquidation thresholds.\nEthereum Aave v3 Parameter Changes Specification\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nDAI Loan To Value\n67%\n77%\n\n\nUSDC Liquidation Threshold\n79%\n80%\n\n\nWSTETH Liquidation Bonus\n7%\n6%\n\n\n\nWe recommend to raise the DAI LTV by 10% to make the LTV/LT spread more in line with other stablecoins across Aave v3, as currently the spread of 13% is an outlier across all v3 markets that inhibits user experience.\nArbitrum Aave v3 Parameter Changes Specification\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nLINK Liquidation Threshold\n75%\n77.5%\n\n\n\nEthereum Aave v2 Parameter Changes Specification\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nCRV Loan to Value\n52%\n0%\n\n\nSNX Liquidation Threshold\n62%\n59%\n\n\n\nGauntlet continues to recommend freezing CRV and setting the CRV LTV to 0, despite the AIP failing to pass.\nLowering SNX LT by 3% will force 2 liquidations totalling $20 of supply.\n\nRisk Dashboard\nThe community should use Gauntlet’s Risk Dashboard to understand better the updated parameter suggestions and general market risk.\nEthereum v3 Dashboard\n\nArbitrum v3 Dashboard\nimage2222×2254 232 KB\nEthereum v2 Dashboard\n\nOur simulations show there is room to increase capital efficiency without materially impacting insolvency risk.\nNext Steps\n\nInitiate Snapshot vote on 2023-07-03.\n\n\nAppendix\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\nGauntlet’s parameter recommendations are driven by an optimization function that balances 3 core metrics: insolvencies, liquidations, and borrow usage. Parameter recommendations seek to optimize for this objective function. Our agent-based simulations use a wide array of varied input data that changes on a daily basis (including but not limited to asset volatility, asset correlation, asset collateral usage, DEX / CEX liquidity, trading volume, expected market impact of trades, and liquidator behavior). Gauntlet’s simulations tease out complex relationships between these inputs that cannot be simply expressed as heuristics. As such, the input metrics we show below can help understand why some of the param recs have been made but should not be taken as the only reason for recommendation. The individual collateral pages on the Gauntlet Ethereum Aave V3 Risk Dashboard cover other key statistics and outputs from our simulations that can help with understanding interesting inputs and results related to our simulations.\nFor more details, please see Gauntlet’s Parameter Recommendation Methodology and Gauntlet’s Model Methodology.\nSupporting Data on Ethereum Aave V3\nTop 30 non-recursive and partially-recursive aggregate positions on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire supply on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire borrow on 2023-06-25\n\n\nTop 10 non-recursive suppliers of DAI on 2023-06-25\n\nTop 10 non-recursive suppliers of USDC on 2023-06-25\n\nTop 10 non-recursive suppliers of WSTETH on 2023-06-25\n\nSupporting Data on Arbitrum Aave V3\nTop 30 non-recursive and partially-recursive aggregate positions on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire supply on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire borrow on 2023-06-25\n\n\nTop 10 non-recursive suppliers of LINK on 2023-06-25\n\nSupporting Data on Aave V2\nTop 30 non-recursive and partially-recursive aggregate positions on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire supply on 2023-06-25\n\nTop 30 non-recursive and partially-recursive borrowers’ entire borrow on 2023-06-25\n\n\nTop 10 non-recursive suppliers of CRV on 2023-06-25\n\nTop 10 non-recursive suppliers of SNX on 2023-06-25\n\n\n\nQuick Links\nRisk Dashboard\nGauntlet Parameter Recommendation Methodology\nGauntlet Model Methodology\nBy approving this proposal, you agree that any services provided by Gauntlet shall be governed by the terms of service available at gauntlet.network/tos.", "reads": 61, "readers_count": 60, "score": 3232.2, "word_count": 1682, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-mai-depeg-update", "topic_id": 14108, "title": "Chaos Labs - MAI Depeg Update", "posts_count": 1, "views": 1271, "like_count": 3, "author_username": "ChaosLabs", "created": "2023-07-23T19:48:36.178Z", "text": "Overview\nOver the past 24 hours, MAI has experienced high volatility, with prices reaching a low of nearly 0.91$. This turbulence is most likely attributed to the ongoing repercussions from the Multi Chain Fantom Bridge incident, where Fantom collateral assets used for minting MAI were compromised.\n\nGiven the current composition of MAI backing and Aave’s exposure to MAI, we did not recommend any immediate emergency actions.\nHowever, as the market continues to evolve, we propose a cautious strategy of limiting Aave’s exposure to MAI. This can be achieved by implementing temporary actions such as reducing supply caps and debt ceilings across the various deployments. This approach could provide a safeguard against further potential disruptions while maintaining a balanced ecosystem. We will follow up with a separate ARFC with the proposed parameter updates.\nMAI Exposure on Aave\nMAI is listed in isolation mode on Aave V3 on Polygon, Arbitrum, Avalanche, and Optimism.\nThe following table provides a breakdown of the MAI parameters and their utilization across these deployments (please note that the data is accurate as of the time of this post)\n\n\n\n\nChain\nCurrent supplied\nSupply Cap\nCurrent borrows\nBorrow Cap\nUtilization\nBorrowed Against ($)\nDebt Ceiling ($)\nLT\nEmode LT\n\n\n\n\nArbitrum\n324,040\n4,800,000\n255,330\n2,400,000\n78%\n88,350\n1,200,000\n80%\nnot in emode\n\n\nAvalanche\n17,750\n700,000\n8,776\n460,000\n49%\n132\n2,000,000\n80%\n97.5%\n\n\nOptimism\n643,670\n7,600,000\n525,360\n2,500,000\n82%\n38,650\n1,900,000\n80%\nnot in emode\n\n\nPolygon\n906,240\n2,200,000\n699,660\n1,200,000\n77%\n430,000\n2,000,000\n80%\n95%\n\n\nOverall\n1,891,700\n15,300,000\n1,489,100\n6,560,000\n\n557,132\n7,100,000\n\n\n\n\n\nLiquidations\nAt this time, Aave experienced a total of 46 liquidation events, exclusively on Polygon, with a total value of ~$48,000. All positions which were liquidated were E-Mode positions of MAI - USDC with no bad debt observed.\n", "reads": 48, "readers_count": 47, "score": 2079.6, "word_count": 354, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-gauntlet-recommendation-on-tusd-for-aave-v2-ethereum", "topic_id": 13727, "title": "[ARFC] Gauntlet recommendation on TUSD for Aave v2 Ethereum", "posts_count": 17, "views": 2682, "like_count": 23, "author_username": "Gauntlet", "created": "2023-06-16T20:37:13.774Z", "text": "Simple Summary\nGauntlet cannot quantify risk associated with centralized stablecoins and regulatory concerns. In light of this, we provide a couple options to the community to gauge preference and thoughts around TUSD. If the community views TUSD as having excess counterparty risk, we recommend iteratively lowering LT, LTV and/or freezing TUSD supply to begin offboarding TUSD.\n\nGauntlet has observed unusual borrowing behavior for TUSD on Aave v2 the past week. Utilization has hit 98% on multiple occasions and has remained constant over 90% from June 9 - June 15, coming down to 74% as of today June 16.\n\nScreen Shot 2023-06-16 at 1.35.53 PM2442×888 106 KB\n\n\nOn June 10, TUSD traded down to $0.996, it was announced that TUSD has paused minting via Prime Trust.\nShould TUSD lose its peg, $0.96 is the first TUSD price at which we see small amount of liquidations (so -4%), and roughly $700k liquidations at $0.90. Data can be found on Gauntlet’s dashboard here.\n\nTUSD has 22M supplied and 20M borrowed, with the majority of the supply having > 1.15 collateral ratio. The majority of the TUSD collateral with HF < 1.5 support stablecoin borrowing, with one account borrowing ~$500k WETH at a 1.35 HF.\n\nimage2864×1518 81.3 KB\n\n\nAgain, to reiterate, Gauntlet cannot quantify risk associated with centralized stablecoins and regulatory concerns. In light of this, we wanted to gauge preference and thoughts around TUSD, and if necessary, provide some options on how the community can derisk TUSD should they view the centralization risk to be excessive.\nOption 1: iteratively lowering the LT of TUSD to 77.5%, LTV to 75%. This will begin removing debt that TUSD collateral supports, which can help reduce risk of insolvencies if TUSD depeg occurs. However, this may impact user experience, as roughly $1500 in supply would be liquidated.\nOption 2: Freeze TUSD supply. This will immediately upper bound the borrowing power of TUSD collateral, which can help reduce insolvency risk during depeg, but will impact users looking to enter the TUSD market to gain interest.\n\nNext steps\nWelcome community feedback and initiate Snapshot vote.", "reads": 83, "readers_count": 82, "score": 2051.6, "word_count": 1509, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-recommendation-to-freeze-crv-and-set-crv-ltv-0-on-aave-v2", "topic_id": 13644, "title": "Gauntlet recommendation to freeze CRV and set CRV LTV -> 0 on Aave v2", "posts_count": 31, "views": 11705, "like_count": 107, "author_username": "Gauntlet", "created": "2023-06-12T19:49:46.369Z", "text": "\nGauntlet recommendation to freeze CRV and set CRV LTV → 0 on Aave v2\nGauntlet has been looking into the risk profile of 0x7a16ff8270133f063aab6c9977183d9e72835428. This account borrows roughly $67.7m of stablecoins ($67m USDT, $700k USDC) against $185m of CRV and $4m of TUSD.\nThe position has an HF of 1.66 and does not represent an immediate risk to Aave v2. However, we recommend to 1. freeze CRV collateral and 2. set Curve LTV to 0, to prevent the account from continuing to add CRV and increasing concentration risk, due to the decrease in CRV liquidity over the past few months.\nCRV token liquidity has been decreased 50% over the past couple of months, both on chain and globally. This can cause future risk, especially if the CRV used as collateral by this account continues to grow.\n\nimage2952×1010 200 KB\n\nThe account has been continuously adding CRV collateral as CRV price decreases, and increasing its stablecoin borrowing over the past couple months. Given the account is actively managed and frequently maintains its health, freezing CRV will incentivize the account to reduce its borrow or add other forms of collateral.\n\nimage3766×990 236 KB\n\n\nNext Steps\n\nPublish AIP to implement the above.\n", "reads": 163, "readers_count": 162, "score": 17142.6, "word_count": 7081, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-alert-new-whale-position-v3-ethereum", "topic_id": 13663, "title": "Chaos Labs Alert - New Whale Position V3 Ethereum", "posts_count": 1, "views": 755, "like_count": 1, "author_username": "ChaosLabs", "created": "2023-06-14T03:10:10.146Z", "text": "The Chaos Labs Risk Monitoring and Alerting platform has identified a new whale position, with the user recently supplying 85,079,259 USDT on Aave V3 Ethereum.\nAs USDT is a non-collateral asset on V3 Ethereum, it currently poses no additional risk to the protocol.\nIt is important to note there is an ongoing proposal to enable USDT as collateral.\nFollowing this deposit, the supply cap of USDT has reached ~93% utilization. We are closely monitoring this position and will offer further recommendations as required.", "reads": 34, "readers_count": 33, "score": 216.8, "word_count": 106, "category_id": 7}, {"url": "https://governance.aave.com//t/temp-check-freeze-mai-from-aave", "topic_id": 13147, "title": "[TEMP CHECK] Freeze MAI from Aave", "posts_count": 10, "views": 1615, "like_count": 9, "author_username": "IncentiveLord", "created": "2023-05-20T13:49:28.921Z", "text": "\nSimple Summary\nA proposal to completely remove MAI from Aave V3 Optimism and Arbitrum over centralisation risks.\n\nMotivation\nThe objective of this proposal is to improve the quality of decentralised collateral on Aave by removing MAI, even from the isolation mode.\n\nBelow is the explanation and the data for the same:\nAs per this ARFC, MAI is a decentralized stablecoin minted by the Qidao Protocol. However, MAI seems to be controlled by a 2 of 4 multi-sig completely in the control of the team.\n\nSpecification\nLooking at MAI contract, it can be minted by OnlyOwner here:\n\nand, the owner is a multi-sig\n\nwhich is controlled by these four addresses, under the 2 of 4 scheme\n\nOut of these four addresses, only one of them seems to be publicly admitted DAO address.\n\nPotential Loss\nAt combined debt ceiling of $3.1mil, under the hands of only 2 signers, this presents a big risk to the DAO.\nIf these two actors act not in the best interests of the DAO, Aave can lose upto $3.1mil.\n\nDisclaimer\nI am not associated to QiDAO or any other competing DAO. I am doing this to add value to the community.\n\nNext Steps\n\nDiscuss over possible flaws in the proposal.\nDiscuss other ways to mitigate this risk.\nDevelop a long term strategy to prevent this in the future.\n\n\nEdits\n\nChanged from ARC to Temp Check\nChanged Remove to Freeze\n", "reads": 46, "readers_count": 45, "score": 234.2, "word_count": 1616, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-wmatic-supply-borrow-cap-increase-polygon-v3-16-05-2023", "topic_id": 13095, "title": "[ARFC] wMATIC Supply & Borrow Cap Increase Polygon v3 16.05.2023", "posts_count": 6, "views": 1297, "like_count": 2, "author_username": "Llamaxyz", "created": "2023-05-16T20:24:53.915Z", "text": "\ntitle: [ARFC] wMATIC Supply & Borrow Cap Increase Polygon v3\ndiscussions:\nshortDescription: Increase Supply & Borrow Cap wMATIC on Polygon v3\nauthor: @llama - @TokenLogic\ncreated: 2023-05-16\n\n\nSummary\nThis publication proposes increasing the wMATIC Supply and Borrow Cap on Polygon v3. This will enable Balancer linear pools to deposit wMATIC into Aave Protocol.\n\nAbstract\nWith strong deposit flows from the Balancer bb-a-wMATIC integration and the continual growth of the yield maximising strategy, the Supply and Borrow Cap of wMATIC are both experiencing strong utilised.\nThis publication enables the continued growth of wMATIC deposits as Balancer Liquidity Providers migrate to the new gauges and users continue to migrate from Aave v2 to v3. As wMATIC deposits grow so does the demand for borrowing wMATIC. Subsidised borrowing costs of wMATIC has lead to significant demand for wMATIC and TVL growth for Aave.\nIncreasing the Supply and Borrow Caps as outlined in this publication will continue to provide confidence to builders who are providing tooling to automate the management of yield maximising strategies.\n\nMotivation\nWith several Balancer liquidity pools depositing wMATIC into Aave v3 on Polygon, the utilisation of the Supply Cap has increased to 100%. This is currently preventing the Balancer linear pools from depositing into the wMATIC reserve.\nCurrently, there is around 5,294,939 and 1,228,487 units of wMATIC not yet migrated to the new gauges. The wMATIC Supply Cap is at 100% utilisation. This prevents the Balancer Linear Pools from depositing into wMATIC Reserve.\nThere is also 15.13M units of wMATIC on Aave v2 that has not yet migrated to v3.\nCollectively, this represents around 21.65M units of wMATIC relative to a Supply Cap. This publication intends to provide sufficent capacity for the 21.65M units to be deposited into the wMATIC reserve by increasing the Supply Cap from 66M units to 90M units, a 24M unit increase. The utilisation of the pool will be 73.33% after the Supply Cap is implemented.\n\nWith several teams offering yield maximising strategies, despite the large inflow of wMATIC deposits, demand for wMATIC has continued to grow. The current Borrow Cap has reached 74.50% utilisation. The newly proposed Borrow Cap 50M units is equivalent to 25% increase and represents 62.5% of the Supply Cap.\n\nWith reference to the new ARFC Aave V3 Caps update Framework it is possible to ship several upgrades to gradually increasing Aave’s exposure to wMATIC over time.\n\nSpecification\nThe following risk parameters have been proposed by @Llamaxyz for the community to review and discuss in the comments section.\nTicker: wMATIC\nContract: polygon: 0x0d500b1d8e8ef31e21c99d1db9a6444d3adf1270\n\n\n\n\nParameter\nCurrent Value\nProposed Value\n\n\n\n\nSupplyCap\n66.00M units\n90M units\n\n\nBorrowCap\n39.95M units\n50M units\n\n\n\n\nCopyright\nCopyright and related rights waived via CC0.", "reads": 40, "readers_count": 39, "score": 293.0, "word_count": 742, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-recommendations-for-lusd-eth-v3", "topic_id": 13039, "title": "[ARC] Gauntlet Recommendations for LUSD ETH v3", "posts_count": 6, "views": 1096, "like_count": 1, "author_username": "seawolf", "created": "2023-05-10T03:42:39.817Z", "text": "\nSimple Summary\nThe supply and borrow caps have been exceeded by the following asset, surpassing the 75% threshold.\n\nLUSD borrow cap (79%) on ETH v3.\n\nIn accordance with our Borrow and Supply Cap Methodology, Gauntlet would like to raise the cap of the above asset to the following:\n\nIncrease LUSD Borrow Cap to 4M on ETH v3.\n\n\nSpecifications\n\nETH v3\n\n\n\n\nAsset\nCurrent Cap\nBorrow Cap Recommendation\n\n\n\n\nLUSD\n2.4M\n4M\n\n\n\n", "reads": 23, "readers_count": 22, "score": 174.6, "word_count": 343, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-risk-parameter-updates-for-aave-v3-avax-2023-05-11", "topic_id": 13059, "title": "[ARFC] Risk Parameter Updates for Aave V3 AVAX 2023-05-11", "posts_count": 1, "views": 972, "like_count": 0, "author_username": "tuanyuan2008", "created": "2023-05-12T04:44:45.443Z", "text": "\nSimple Summary\nA proposal to adjust one (1) total risk parameters, including Liquidation Bonus, across one (1) Aave V3 AVAX assets.\n\nDecrease WBTC.e Liquidation Bonus from 106.25% to 105.9%.\n\nGiven that these changes above are relatively minor, we will not move forward with these changes in order to reduce governance overhead, unless the community voices otherwise. However, we did want to publish this post so that the community has transparency into the results of our simulation engine.\n\nAbstract\nThese parameter updates are a continuation of Gauntlet’s regular parameter recommendations. Our simulation engine has ingested the latest market data (outlined below) to recalibrate parameters for the Aave protocol. The community has aligned on a Risk Off Framework regarding lowering liquidation thresholds.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\nGauntlet’s parameter recommendations are driven by an optimization function that balances 3 core metrics: insolvencies, liquidations, and borrow usage. Parameter recommendations seek to optimize for this objective function. Our agent-based simulations use a wide array of varied input data that changes on a daily basis (including but not limited to asset volatility, asset correlation, asset collateral usage, DEX / CEX liquidity, trading volume, expected market impact of trades, and liquidator behavior). Gauntlet’s simulations tease out complex relationships between these inputs that cannot be simply expressed as heuristics. As such, the input metrics we show below can help understand why some of the param recs have been made but should not be taken as the only reason for recommendation. The individual collateral pages on the Gauntlet Risk Dashboard cover other key statistics and outputs from our simulations that can help with understanding interesting inputs and results related to our simulations.\nFor more details, please see Gauntlet’s Parameter Recommendation Methodology and Gauntlet’s Model Methodology.\n\nSupporting Data on Aave V3 AVAX\nTop 30 non-recursive and partially-recursive aggregate positions\n\nimage3442×1302 399 KB\n\nTop 30 non-recursive and partially-recursive borrowers’ entire supply\n\nimage3440×1294 307 KB\n\nTop 30 non-recursive and partially-recursive borrowers’ entire borrows\n\nimage3438×1298 294 KB\n\nTop WBTC.e non-recursive supplies and collateralization ratios:\n\nimage3450×1296 282 KB\n\n\nAave V3 AVAX Parameter Changes Specification\nGauntlet’s simulation engine is continuously adjusting risk parameters to strike an optimal balance between maintaining market risk for the protocol and enhancing capital efficiency for users of the Aave V3 AVAX protocol.\nOur models have recently indicated that it’s possible to lower the liquidation bonus for WBTC.e without elevating the protocol’s exposure to market risk.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nWBTC.e Liquidation Bonus\n106.25%\n105.9%\n\n\n\nAs stated in the Simple Summary, we will not move forward with these parameter changes. The below aims to provide transparency to the community on the risk simulation results.\n\n\n\nRisk Dashboard\nThe community should use Gauntlet’s Aave V3 Risk Dashboard to understand better the updated parameter suggestions and general market risk in Aave V3.\nValue at Risk represents the 95th percentile insolvency value that occurs from simulations we run over a range of volatilities to approximate a tail event.\nLiquidations at Risk represents the 95th percentile liquidation volume that occurs from simulations we run over a range of volatilities to approximate a tail event.\n\nNext Steps\n\nAs stated in the Simple Summary, we will not move forward with these parameter changes in order to reduce governance overhead, unless the community voices otherwise.\n\n\nQuick Links\nRisk Dashboard\nGauntlet Parameter Recommendation Methodology\nGauntlet Model Methodology\nBy approving this proposal, you agree that any services provided by Gauntlet shall be governed by the terms of service available at gauntlet.network/tos.", "reads": 16, "readers_count": 15, "score": 3008.2, "word_count": 696, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-risk-parameter-updates-for-aave-v3-arbitrum-2023-05-11", "topic_id": 13060, "title": "[ARFC] Risk Parameter Updates for Aave V3 Arbitrum 2023-05-11", "posts_count": 1, "views": 906, "like_count": 0, "author_username": "tuanyuan2008", "created": "2023-05-12T04:58:44.981Z", "text": "\nSimple Summary\nA proposal to adjust two (2) total risk parameters, including Loan-to-Value and Liquidation Threshold, across one (1) Aave V3 Arbitrum asset.\n\nIncrease WBTC LTV from 73% to 74%.\nIncrease WBTC Liquidation Threshold from 78% to 79%.\n\nGiven that these changes above are relatively minor, we will not move forward with these changes in order to reduce governance overhead, unless the community voices otherwise. However, we did want to publish this post so that the community has transparency into the results of our simulation engine.\n\nAbstract\nThese parameter updates are a continuation of Gauntlet’s regular parameter recommendations. Our simulation engine has ingested the latest market data (outlined below) to recalibrate parameters for the Aave protocol. The community has aligned on a Risk Off Framework regarding lowering liquidation thresholds.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\nGauntlet’s parameter recommendations are driven by an optimization function that balances 3 core metrics: insolvencies, liquidations, and borrow usage. Parameter recommendations seek to optimize for this objective function. Our agent-based simulations use a wide array of varied input data that changes on a daily basis (including but not limited to asset volatility, asset correlation, asset collateral usage, DEX / CEX liquidity, trading volume, expected market impact of trades, and liquidator behavior). Gauntlet’s simulations tease out complex relationships between these inputs that cannot be simply expressed as heuristics. As such, the input metrics we show below can help understand why some of the param recs have been made but should not be taken as the only reason for recommendation. The individual collateral pages on the Gauntlet Risk Dashboard cover other key statistics and outputs from our simulations that can help with understanding interesting inputs and results related to our simulations.\nFor more details, please see Gauntlet’s Parameter Recommendation Methodology and Gauntlet’s Model Methodology.\n\nSupporting Data on Aave V3 Arbitrum\nTop 30 non-recursive and partially-recursive aggregate positions\n\nimage3450×1300 400 KB\n\nTop 30 non-recursive and partially-recursive borrowers’ entire supply\n\nimage3446×1294 301 KB\n\nTop 30 non-recursive and partially-recursive borrowers’ entire borrows\n\nimage3438×1298 294 KB\n\nTop WBTC non-recursive supplies and collateralization ratios:\n\nimage3442×1300 286 KB\n\n\nAave V3 Arbitrum Parameter Changes Specification\nGauntlet’s advanced simulation engine is designed to dynamically adjust risk parameters. This ongoing process is crucial to ensure that the protocol’s market risk is kept within acceptable boundaries, while at the same time promoting optimal capital efficiency.\nBased on our latest simulations, we’ve identified an opportunity to enhance capital efficiency specifically for WBTC. Our proposed adjustments are designed to achieve this goal without introducing an excessive level of market risk to the protocol.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nWBTC LTV\n73%\n74%\n\n\nWBTC Liquidation Threshold\n78%\n79%\n\n\n\nAs stated in the Simple Summary, we will not move forward with these parameter changes. The below aims to provide transparency to the community on the risk simulation results.\n\n\n\nRisk Dashboard\nThe community should use Gauntlet’s Aave V3 Risk Dashboard to understand better the updated parameter suggestions and general market risk in Aave V3.\nValue at Risk represents the 95th percentile insolvency value that occurs from simulations we run over a range of volatilities to approximate a tail event.\nLiquidations at Risk represents the 95th percentile liquidation volume that occurs from simulations we run over a range of volatilities to approximate a tail event.\n\nNext Steps\n\nAs stated in the Simple Summary, we will not move forward with these parameter changes in order to reduce governance overhead, unless the community voices otherwise.\n\n\nQuick Links\nRisk Dashboard\nGauntlet Parameter Recommendation Methodology\nGauntlet Model Methodology\nBy approving this proposal, you agree that any services provided by Gauntlet shall be governed by the terms of service available at gauntlet.network/tos.", "reads": 18, "readers_count": 17, "score": 2928.6, "word_count": 721, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-risk-parameter-recommendations-2023-03-20", "topic_id": 12385, "title": "[ARC] Gauntlet Risk Parameter Recommendations (2023-03-20)", "posts_count": 9, "views": 2682, "like_count": 9, "author_username": "seawolf", "created": "2023-03-20T23:34:50.821Z", "text": "\n[ARC] Gauntlet Risk Parameter Recommendations (2023-03-20)\n\nSimple Summary\nAfter closely monitoring liquidity conditions across the markets following the USDC nonparity event, Gauntlet recommends the following parameter changes to mitigate risk to the protocol. These parameter changes aim to proactively manage risk following changes in liqudity.\n\nAVAX v3\nGauntlet Recommends decreasing the following caps AVAX v3:\n\nFRAX supply cap from 50M to 1.5M.\nFRAX borrow cap from 2M to 400k.\nMAI supply cap from 50M to 1.5M.\nMAI borrow cap from 2M to 500k.\nBTC.b supply cap from 4.62k to 3k.\nBTC.b borrow cap from 3.19k to 900.\nUSDC supply cap from 4B to 170M.\nUSDT supply cap from 2B to 260M.\nWAVAX supply cap from 13.1M to 3.8M.\nWETH supply cap from 113k to 40k.\nWETH borrow cap from 62.1k to 11k.\nDAI.e supply cap from 2B to 17M.\n\nGauntlet recommends adding the following caps AVAX v3:\n\nAdd 90M borrow cap to USDC.\nAdd 120M borrow cap to USDT.\nAdd 17M borrow cap to DAI.e.\nAdd 3M borrow cap to WAVAX.\n\n\nETH v3\n\nDecrease CRV supply cap from 62.5M to 51M.\n\n\nOur borrow and supply cap recommendations utilizes the methodology outlined in our borrow and supply cap methodology.\n\n\nSpecification\n\nETH v3\n\n\n\n\nAsset\nCurrent Supply Cap\nRecommend Supply Cap\nCurrent Supply\n\n\n\n\nCRV\n62,500,000\n51,000,000\n108,000\n\n\n\n\nAVAX v3\n\n\n\n\nAssets\nCurrent Supply Cap\nRecommend Supply Cap\nCurrent Supply\nCurrent Borrow Cap\nRecommend Borrow Cap\nCurrent Borrow\n\n\n\n\nFRAX\n50,000,000\n1,500,000\n15,340\n2,000,000\n400,000\n10,230\n\n\nMAI\n50,000,000\n1,500,000\n7,870\n2,000,000\n500,000\n5,717\n\n\nBTC.B\n4,620\n3,000\n4,620\n3,190\n900\n373\n\n\nUSDC\n4,000,000,000\n170,000,000\n51,670,000\n-\n90,000,000\n33,030,000\n\n\nUSDT\n2,000,000,000\n260,000,000\n28,090,000\n-\n120,000,000\n21,310,000\n\n\nWAVAX\n13,100,000\n3,800,000\n2,970,000\n-\n3,000,000\n1,230,000\n\n\nWETH\n113,000\n40,000\n18,290\n62,150\n11,000\n3,368\n\n\nDAI.e\n2,000,000,000\n17,000,000\n7,010,000\n-\n17,000,000\n4,350,000\n\n\n\nGauntlet’s Supply Cap recommendations would result in the effective freezing of supply on BTC.b market.\n\nNext Steps\n\nWelcome community feedback\nTargeting AIP vote on 3/27/2023\n", "reads": 51, "readers_count": 50, "score": 390.2, "word_count": 1705, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-recommendations-for-polygon-v3-and-arbitrum-v3", "topic_id": 12919, "title": "[ARC] Gauntlet Recommendations for Polygon V3 and Arbitrum V3", "posts_count": 6, "views": 1341, "like_count": 1, "author_username": "seawolf", "created": "2023-04-27T23:37:38.489Z", "text": "\nSimple Summary\n\nThe supply and borrow caps have been exceeded by the following assets, surpassing the 75% threshold.\n\nBAL supply (92.4%) and borrow (76%) caps on Polygon v3.\nEURS supply (78.4%) and borrow (78%) on Arbitrum v3.\n\nIn accordance to our Borrow and Supply Cap methodology, Gauntlet would like to raise the caps of the above assets to the following.\n\nArbitrum v3\n\n\n\n\n\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nEURS\n60,000\n65,000\n45,000\n65,000\n\n\n\nOur conservative methodology thresholds the caps for EURS to be 40% of the circulating supply for EURS on Arbitrum. The community can decide whether to adopt the aggressive methodology for EURS supply cap and threshold at 60% of the circulating supply, upon which the supply and the borrow caps will be raised to 100k.\nWe do not recommend changing the borrow and supply caps for BAL due to the low circulating supply (~525k) of BAL on Polygon, and to prevent excess concentration risk for the protocol (currently ~70%)\n\nSpecifications\n\n\nEURS Arbitrum v3\n\n\n\n", "reads": 31, "readers_count": 30, "score": 251.2, "word_count": 297, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-chaos-labs-risk-parameter-updates-aave-v3-optimism-2023-03-22", "topic_id": 12421, "title": "[ARFC] - Chaos Labs Risk Parameter Updates - Aave V3 Optimism - 2023.03.22", "posts_count": 6, "views": 2521, "like_count": 6, "author_username": "ChaosLabs", "created": "2023-03-22T18:41:21.732Z", "text": "\nSimple Summary\nA proposal to adjust five (5) total risk parameters, including Loan-to-Value, Liquidation Threshold, and Liquidation Bonus, across two (2) Aave V3 Optimism assets.\n\nMotivation\nChaos Labs’ Parameter Recommendation Platform runs hundreds of thousands of agent-based off-chain and on-chain simulations to examine how different Aave V3 risk parameters configurations would behave under adverse market conditions - and find the optimal values to maximize protocol borrow usage while minimizing losses from liquidations and bad debt.\nNote: As a general guideline, we limit the proposed changes by ±3% for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters if the optimal configuration is outside this range.\nPlease find more information on the parameter recommendation methodology here.\nYou can also view the simulation results and breakdown for the different assets by clicking on them on this page.\nThe output of our simulations reveals an opportunity to increase LTVs and LTs for WBTC and DAI on V3 Optimism, resulting in improved capital efficiency of the system, with no effect on the projected VaR (95th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours) and EVaR (Extreme VaR, the 99th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours)\nSimulating all changes jointly yields a projected borrow increase of ~$155,000, with no increase in VaR and Extreme VaR compared to simulations with the current parameters.\n\nUntitled (30)2686×1318 239 KB\n\n\nUntitled (31)2688×1334 228 KB\n\n\nLiquidity Analysis:\nThe TVL in Aave on Optimism (118.71M$) is concentrated primarily on three blue-chip, high-liquidity assets, which together account for ~75% of the supplied assets in $ values: USDC (34%), WETH (28%), and WBTC (14%). Based on our analysis, we recommend increasing the Loan-To-Value (LTV) and Liquidation Threshold (LT) for WBTC and DAI, as we have determined that there is adequate on-chain liquidity to support significant liquidations. Similarly, we recommend reducing the Liquidation Penalty for WBTC, which is set conservatively at 10% to a lower level (8.5%) closer to that of USDC and Ethereum (5%).\n\nPositions Analysis\nWe have not identified any outsized positions that are actively affecting our recommendations. However, we should call out that  ~40% of the on-chain supply of WBTC on Optimism is currently held on Aave, which calls for some caution. We have already proposed and implemented an amendment to the supply cap to limit the concentration of liquidity on Aave.\nGiven the blue-chip nature of BTC/WBTC, we expect significant arbitrage buying pressure to offset any slippage that may be created by future liquidations of WBTC and, therefore, recommend reducing the Liquidation Penalty even with the current significant liquidity concentration on Aave. We expect a lower LP to drive liquidators to liquidate positions in smaller portions, pacing the process and allowing the market more time to react.\n\nRecommendations\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWBTC\nLiquidation Threshold\n75%\n78%\n+3%\n\n\nWBTC\nLoan-to-Value\n70%\n73%\n+3%\n\n\nWBTC\nLiquidation Penalty\n10%\n8.5%\n-1.5%\n\n\nDAI\nLiquidation Threshold\n80%\n83%\n+3%\n\n\nDAI\nLoan-to-Value\n75%\n78%\n+3%\n\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.", "reads": 50, "readers_count": 49, "score": 430.0, "word_count": 1887, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-recommendations-for-eurs-on-v3-polygon", "topic_id": 12798, "title": "Gauntlet Recommendations for EURS on V3 Polygon", "posts_count": 4, "views": 1221, "like_count": 0, "author_username": "seawolf", "created": "2023-04-18T00:19:38.415Z", "text": "\nGauntlet Recommendations for EURS on V3 Polygon\n\nSimple Summary\nAsset EURS borrow cap usage is at 89%. As per our Methodology, Gauntlet would support increasing the borrow cap for this stablecoin to 1.5M.\n\nSpecifications\n\n\n\n\nAsset\nCurrent Cap\nBorrow Cap Recommendation\n\n\n\n\nEURS\n947,000\n1,500,000\n\n\n\nEURs circulating supply on the Polygon Chain is approximately 2.5M. The proposed borrow cap recommendation will represent 60% of circulating supply.\n", "reads": 26, "readers_count": 25, "score": 145.2, "word_count": 159, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-recommendations-for-aave-link-and-weth-on-v3-arbitrum-2023-03-21", "topic_id": 12394, "title": "[ARC] Gauntlet Recommendations for AAVE, LINK, and WETH on V3 Arbitrum - 2023.03.21", "posts_count": 6, "views": 1822, "like_count": 4, "author_username": "seawolf", "created": "2023-03-21T20:05:00.193Z", "text": "\nSimple Summary\nGauntlet would like to flag that assets AAVE, LINK, and WETH supply caps are above the 75% threshold. As per our Methodology, Gauntlet would recommend the following proactive changes:\n\nIncrease WETH’s Supply Cap from 35,280 to 45,000\nNo Increase to AAVE Supply Cap\nNo Increase to LINK Supply Cap\n\nGauntlet will continue to monitor the on-chain liquidity of these assets, especially AAVE and LINK, and make recommendations if required.\n\nSpecification\n\n\n\n\nAsset\nCurren Supply Cap\nCurrent Supply\nConservative Supply Cap\nAggressive Supply Cap\nGauntlet Recommendation\n\n\n\n\nLINK\n677,000\n536,000.00\n590,741\n984,568\nNo Increase\n\n\nAAVE\n1,850\n1,530\n1,122\n1,871\nNo Increase\n\n\nWETH\n35,280\n27,470\n45,000\n161,112\n45,000\n\n\n\nIf the community believes in strategically pushing growth over on-chain liquidity risk management, the community may elect to increase the LINK supply cap.\nWETH\n\nLINK\n\nAAVE\n", "reads": 47, "readers_count": 46, "score": 239.4, "word_count": 381, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-updated-supply-and-borrow-cap-methodology", "topic_id": 11602, "title": "Chaos Labs Updated Supply and Borrow Cap Methodology", "posts_count": 2, "views": 2174, "like_count": 3, "author_username": "ChaosLabs", "created": "2023-02-07T19:52:56.137Z", "text": "Overview\nWe have previously posted our supply and borrow cap methodologies devised to accommodate Aave V3 assets with no supply or borrow caps.\nWe are formalizing a more robust supply and borrow cap methodology to serve the future needs of Aave V3, which we will complete in the coming weeks.\nHowever, given the need to update several assets’ supply and borrow caps across different V3 deployments, we have updated it to address the current needs. While this method is conservative, it will increase supply and borrow caps across most assets where the cap is close to its full usage.\nSupply Caps\nDefinitions:\n\nCurrentSupplyCap - the current supply cap configured for the asset\nExtremeLiquidationAmount -  the amount eligible for liquidation given an extreme drop in the asset price using Chaos Labs’ Risk Explorer. We define the “extreme drop” for different market cap classes as follows:\n\nSmall Cap (<$2B) - 50% drop\nMedium Cap ($2B-$20B) - 35% drop\nLarge Cap (>$20B) and Stables- 15% drop\n\n\nMaxAmountLiquidated  - the maximum amount that can be liquidated while keeping the slippage below the Liquidation Penalty\n\nFramework:\n\nEvaluate the ExtremeProfitableLiquidationRatio:\n\n\nThis ratio represents how many times the ExtremeLiquidationAmount can be profitably liquidated had it all been liquidated at once. Requiring 90% of an asset’s liquidated amount will be liquidated at once is a defensive approach and can be set differently given changing risk appetites.\n\n\nSet R = min(ExtremeProfitableLiquidationRatio, 2)\n\n\nRecommendedSupplyCap = CurrentSupplyCap * R\n\n\nNotes:\n\n\nThe above assumes that additional supply and borrow amounts will be distributed similarly to the current supply and borrowing activity.\n\n\nTo accommodate for unexpected borrower and market behavior, we provide an upper bound of  2*CurrentSupplyCap on the increase in supply caps.\n\n\nTo prevent over-concentration of a token’s on-chain liquidity on Aave, we cap the supply of each token at 50% of its total circulating supply on a given network.\n\n\nWe recommend waiting at least two weeks between consecutive recommendations for a single asset to analyze suppliers’ and borrowers’ behavior.\n\n\nFor simplicity, we will round the recommended numbers to the nearest round number.\n\n\nBorrow Caps\nOur initial borrow cap methodology suggested setting the borrowing cap to allow utilization beyond the UOptimal point even when the supply cap is at full utilization. From experience and usability aspects, this serves as a proper benchmark. However, this may not be the case for higher UOptimal values (>.45), and a different approach is required.\n\n\n\nAAVE V3 Borrow Caps Methodology\n\nMethodology\nTo determine initial borrow caps, we’re looking at several factors:\n\nThe optimal utilization rate  (UOptimal)\nThe current supply of the asset (CurrentSupply)\nThe supply cap of the asset (SupplyCap)\n\nNote: UOptimal is a static 0.45 based on the interest rate curves currently approved. Several reviews are already underway to modify and enhance these curves, which will require further research and likely amended Borrow Cap proposals.\n\n\nGiven recent proposals on the forums to amend IR curves and respective UOptimal points, we recommend that new proposed borrow caps be set up to 0.55 * SupplyCap until our new methodology is published.", "reads": 59, "readers_count": 58, "score": 506.8, "word_count": 621, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-supply-cap-methodology", "topic_id": 12842, "title": "Chaos Labs - Supply Cap Methodology", "posts_count": 3, "views": 1427, "like_count": 4, "author_username": "ChaosLabs", "created": "2023-04-21T14:53:23.622Z", "text": "\nExecutive Summary\nSupply caps were introduced in Aave V3 to mitigate the exposure to any particular token. Leveraging Chaos Labs’ agent-based simulation environment, we introduce a new stress-testing framework for setting the supply cap for each token.\nStress testing is a technique used to evaluate the performance and resilience of a system under extreme or adverse conditions. Its objective is to identify potential weaknesses or vulnerabilities that may not be apparent under normal operating conditions. It is widely used by traditional financial institutions to stress test risk capital requirements: refer to pages 46 & 47 of the Basel III publication.\nAave’s supply cap determines how much a token can be supplied to the protocol and, therefore, how much of it can be used as collateral. As the amount of debt collateralized by this token increases, the liquidity risk associated with this token increases. That is, in the event of a severe token devaluation, liquidators must sell the collateral token in exchange for the debt token. If liquidations are not profitable - e.g., due to large slippage on DEXes - liquidators might be unwilling to liquidate the underlying position, and the protocol may accrue bad debt.\nOur goal with stress testing is to leverage Chaos Labs’ agent-based simulation environment to measure the potential accrual of bad debt in these situations. As we increase the amount supplied as collateral in our simulations, the slippage incurred by liquidators increases monotonically. Accordingly, the protocol’s potential bad debt also increases monotonically:\n\nScreen Shot 2023-04-21 at 10.46.48 AM1380×1048 94.4 KB\n\nWe stress-test each token against appropriate stress scenarios based on historical data, which are described below. We binary search for optimal supply caps, limiting protocol losses to some target loss K. Initially, we propose capping potential protocol losses to 0.1% of the safety module’s funds, which currently equates to $400K U.S. dollars. In case this figure limits future supply cap increases, the community could decide on a different threshold.\nWe find that a comprehensive and transparent stress testing suite provides a valuable resource for the Aave protocol. We may continue to leverage these stress tests for other protocol risk parameters, using them in conjunction with our existing Value at Risk simulations.\nAs we continue to iterate on this stress testing framework by designing more comprehensive stress scenarios such as governance token auctions (i.e., MKR’s black Thursday) or short-seller attacks (i.e., CRV’s exploit in November of 2022), we will ensure Aave is more and more resilient to any hypothetical stress event.\n\nStress Scenarios\nOur stress scenarios are motivated by the various severe devaluations observed in 2022. As discussed in our paper, we bias our stress scenarios in favor of more recent events, given that price and liquidity trajectories within Crypto evolve rapidly.\nSimilar to the Dodd-Frank Act Stress Testing framework, we define Moderate and Severe stress scenarios. We further distinguish between stablecoins and non-stablecoins, given their unique price and liquidity profiles. The price and liquidity trajectories used in our simulations are gleaned from Reference Events: historical examples of the stress scenario we are testing for. These are outlined below, with some example tokens. Notice that the example tokens in the Severe category below are just illustrative examples.\n\nScreenshot 2023-04-17 at 10.28.09 AM3092×940 226 KB\n\nWe first define the lookback window for the reference event - e.g., May 7th to May 15th for the LUNA crash. We gather liquidity trajectories by considering all major on-chain liquidity venues for the referenced token:\n\nScreenshot 2023-04-17 at 10.32.42 AM1812×476 73.4 KB\n\nGiven the price and liquidity trajectories of these referenced tokens, we then scale the current price and liquidity of the test token:\n\nScreen Shot 2023-04-21 at 10.50.49 AM1442×408 58.3 KB\n\nWe simulate liquidations under these prices and liquidities given the current borrow and supply of the test token. We then set supply caps such that protocol losses are capped at K.\n\nSensitivity Analysis\nWe further perform some sensitivity analyses on the price and liquidity trajectories. Specifically, we subject each token to a stress test against a predefined reference price and liquidity trajectory. We then simulate protocol losses against scaled price and liquidity trajectories to examine the sensitivity of protocol losses to the speed of price and liquidity depreciation. This allows us to distinguish between riskier and safer assets and allows the community to express its risk appetite for different tokens.\nSuppose governance considers FRAX and CRV to be riskier assets, whereas USDC and LINK are safer. That is, we are willing to take more liquidity risk on USDC and LINK, given their expected utility to the protocol. We may then simulate protocol losses using each token’s respective stress scenario and select the supply caps accordingly\n\nTokens with no Collateral\nTokens that are not used as collateral have negligible liquidity risk since they will not experience liquidations under duress. To ensure we still set sensible supply caps, we simulate protocol losses as if 25% of the token’s supply is used as collateral, although this is not strictly necessary. In fact, we floor the “collateral usage” of all tokens at 25%, to ensure that we do not set overly liberal supply caps for tokens that aren’t yet used as collateral - given that collateral usage may fluctuate significantly over time.\n\nNew Asset Listings\nTo set supply caps for new listings, we plan to use the supply and borrow distribution from a similar asset or set of assets as a starting point for our simulations. Given a similar supply and borrow distribution, we then use the target asset’s on-chain price and liquidity to run our stress tests.\n\nAdditional Considerations\n\nLSDs\nFor LSDs, two primary scenarios are distinguished when running simulations for supply caps:\n\nFor LSDs with calculated price feed (e.g., MaticX), only the positions of LSD collateral against non-underlying asset borrows are considered, as no risk exists in the LSD/underlying asset positions. In this case, it is still recommended to set an upper bound on the supply cap at 50% of the total circulating supply of the LSD to prevent extreme counter-party exposure, even when no explicit risk is identified.\nFor LSDs bearing counter-party risk, for which oracles are calculated with market price, a depeg scenario including E-Mode positions is simulated (e.g., cbETH).\n\nFor more information, please refer to the Chaos Labs - LSD Methodology Update\nConcentration Risk Mitigation\nTo prevent over-concentration of a token’s on-chain liquidity on Aave, we recommend capping the supply of each token at 50% of its total circulating supply on a given network.\nPrice Manipulation\nFor every asset, we measure the cost and feasibility of price manipulation attacks which are considered in our recommendations for setting supply and borrow caps.\nFor more information, please refer to the Chaos Asset Protection Tool post\n\nConclusion\nChaos Labs has developed a generalized stress testing framework for setting Aave’s supply cap, which may be extended to other stress scenarios (e.g. specific LSD de-pegs, short-seller attacks, etc.) and used for other risk parameters.\nWe will continue to update the community on new additions to the stress testing suite to ensure the community that the protocol is resilient to a variety of adverse conditions.", "reads": 34, "readers_count": 33, "score": 3346.8, "word_count": 1535, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-market-alerts-april-2023", "topic_id": 12581, "title": "Gauntlet Market Alerts (April 2023)", "posts_count": 1, "views": 1025, "like_count": 3, "author_username": "seawolf", "created": "2023-04-03T01:27:23.164Z", "text": "\nwstETH Borrow and Supply Cap Notification\nGauntlet would like to inform the community that the usage rates for wstETH’s supply and borrow cap on Arbitrum v3 are at 100% and 77.61%, respectively. The asset’s caps were recently increased on March 28th. Our team is looking into it and will let you know if any next steps.\n\nUntitled (46)900×1246 57.4 KB\n", "reads": 15, "readers_count": 14, "score": 83.0, "word_count": 65, "category_id": 7}, {"url": "https://governance.aave.com//t/potential-risk-from-cbeth-after-aip-192-gauntlets-analysis", "topic_id": 12644, "title": "Potential risk from cbETH after AIP-192: Gauntlet's Analysis", "posts_count": 1, "views": 1729, "like_count": 4, "author_username": "Pauljlei", "created": "2023-04-04T22:35:53.889Z", "text": "Gauntlet would like to alert the Aave community of a potential source of risk that has emerged following the passage of AIP-192.\nAIP-192 raised the supply cap of cbETH from 30k to 60k. Shortly after its implementation, a single large account, 0xccfa0, used nearly all of the new supply capacity, borrowing 20,824.73 ETH against 24,169.87 cbETH of collateral. See the following graph for the change in cbETH suppliers over time:\n\nThe account in question is in e-mode, meaning its liquidation threshold is 93%. Currently, it is borrowing $38M of ETH against $45M of cbETH, resulting in a collateral ratio of 85%. This poses a significant risk to the protocol due to the low on-chain liquidity of cbETH relative to the size of this account. Presently, the 25% depth of cbETH liquidity stands at only 17,300 tokens.\nTo illustrate the potential risk posed by 0xccfa0’s position, consider the following scenario:\nShould the value of cbETH temporarily fall in price against ETH by 9%, 0xccfa0 would become liquidatable. A liquidator would then have the opportunity to repay half of 0xccfa0’s debt (10.4k ETH) in exchange for just under half of its collateral (11.4k cbETH). Currently, a sale of 11.5k cbETH would have a price impact of over 7% (likely higher in a depeg scenario due to concentrated liquidity near the current price ratio). Importantly, an additional 7% price drop could trigger a cascade effect, not only making 0xccfa0 insolvent but also putting many non-e-mode users at risk of liquidation or even insolvency.\nGauntlet’s analysis shows that it would have been prudent to make the supply cap increase after the upcoming Shanghai upgrade, which is expected to improve liquidity for liquid staking derivatives like cbETH. To err on the side of caution, we would not recommend further supply cap raises until after the upgrade occurs. Moreover, it is important to note that the cbETH redemption mechanism is different from stETH, lacking a native buffering system for quicker withdrawals (see Gauntlet’s previous analysis of stETH withdrawals). Based on Coinbase documentation, cbETH withdrawals may take weeks to months, which could lead to differences in liquidity immediately following the upgrade.\n\nNext Steps\nWith the supply cap currently at 100% usage, Gauntlet strongly recommends against any further cap increases. We will continue to monitor the position and asset, providing updates and recommendations as necessary. In light of the stETH depeg in June 2022, when the price of stETH fell by 7% against ETH before recovering, it is crucial to acknowledge that a 9% cbETH depeg, even if temporary, could trigger cascading liquidations with potentially severe consequences.", "reads": 44, "readers_count": 43, "score": 1228.8, "word_count": 497, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-recommendations-for-wsteth-on-aave-v3-arbitrum", "topic_id": 12675, "title": "[ARC] Gauntlet Recommendations for wstETH on Aave V3 Arbitrum", "posts_count": 6, "views": 1682, "like_count": 1, "author_username": "Pauljlei", "created": "2023-04-06T01:27:45.404Z", "text": "\nSimple Summary\nPer our Methodology, Gauntlet would recommend the following changes to the caps:\n\nIncrease wstETH Borrow Cap from 400 to 800.\n\nWhile our conservative rec is 2,800, we are limiting the change to 800, per community guidelines on increasing caps.\n\n\n\nAs previously mentioned, we do not recommend increasing the supply cap for wstETH and recommend a more conservative borrow cap increase at this time due to the impending Shanghai Upgrade. We will revisit immediately post-upgrade on April 12th.\n\nSpecification\n\n\n\n\nAsset\nCap\nCurrent Cap\nConservative Cap Rec\nAggressive Cap Rec\n\n\n\n\nwstETH\nBorrow\n400\n2,800\n5,456\n\n\n\n\nwstETH\n\n\nNext Steps:\n\nTargeting AIP on 4/11/2023\n", "reads": 45, "readers_count": 44, "score": 389.0, "word_count": 352, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-freeze-g-uni-dai-usdc-and-g-uni-usdc-usdt-in-aave-v2-amm-market", "topic_id": 12541, "title": "[ARFC] Freeze G-UNI DAI/USDC and G-UNI USDC/USDT in Aave V2 AMM Market", "posts_count": 4, "views": 1475, "like_count": 4, "author_username": "Pauljlei", "created": "2023-03-31T14:48:21.893Z", "text": "Author: Joint Recommendation - Gauntlet, BGD Labs, Chaos Labs, and Aave Companies\nDate: 2023-03-31\n\nSummary:\nThis ARFC proposes to make parameter changes on the Aave V2 AMM (Automated Market Maker) market, specifically to freeze G-UNI DAI/USDC and G-UNI USDC/USDT reserves, in order to balance risk.\n\nAbstract:\nThe proposed parameter updates aim to freeze G-UNI DAI/USDC and G-UNI USDC/USDT reserves in the Aave V2 AMM market, given their low liquidity levels and limited activity.\n\nMotivation:\nThis joint recommendation from Gauntlet, BGD Labs, Chaos Labs, and Aave Companies is motivated by the low usage and relatively low liquidity levels of G-UNI DAI/USDC and G-UNI USDC/USDT in the Aave V2 AMM market. The proposers note that the pool is not particularly active or highly utilized, and out of an abundance of caution, they recommend freezing these assets.\n\nSpecification:\nThis ARFC proposes the following actions for the Aave V2 AMM market:\n\nFreeze G-UNI DAI/USDC reserves\nFreeze G-UNI USDC/USDT reserves\n\n\nImplementation:\nUpon approval, the freezeReserve method will be called on the AMM Pool Configurator to freeze the specified reserves: G-UNI DAI/USDC and G-UNI USDC/USDT.\n\nDisclaimer:\nThis proposal is a joint recommendation from Gauntlet, BGD Labs, Chaos Labs, and Aave Companies.\n\nCopyright:\nCopyright and related rights waived via CC0.", "reads": 46, "readers_count": 45, "score": 334.2, "word_count": 373, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-market-alerts-mar-2023", "topic_id": 12159, "title": "Gauntlet Market Alerts (Mar 2023)", "posts_count": 13, "views": 2437, "like_count": 10, "author_username": "seawolf", "created": "2023-03-04T00:11:52.966Z", "text": "\nBTC.b Supply Cap Notification\nGauntlet wants to notify the community that asset BTC.b supply cap utilization is at 100%.\n\nAsset:  BTC.b on Avalanche V3\nSupply Cap:  5,800K ($129.6M)\nSupply Amount : 5,800K ($129.6M)\n\n\nUntitled (34)2072×708 61.8 KB\n\nGauntlet is analyzing and will let the community know of any next steps.", "reads": 47, "readers_count": 46, "score": 594.4, "word_count": 930, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-supply-and-borrow-cap-updates-aave-v3-polygon-and-arbitrum-2023-02-07", "topic_id": 11605, "title": "[ARC] - Chaos Labs Supply and Borrow Cap Updates - Aave V3 Polygon and Arbitrum - 2023.02.07", "posts_count": 9, "views": 2294, "like_count": 14, "author_username": "ChaosLabs", "created": "2023-02-07T23:34:31.178Z", "text": "\nSimple Summary\nA proposal to adjust five (11) total risk parameters, including Supply Cap and Borrow Cap, across seven (7) Aave V3 Polygon and Arbitrum assets.\n\nMotivation\nThe objective of this proposal is to recommend updated supply and borrow caps for V3 assets that have reached over 85% utilization of either cap. The recommendations provided in this proposal were derived using Chaos Labs’ Updated Supply and Borrow Cap Methodology.\nBelow are the data and considerations for the assets and recommended caps:\n\nPolygon\nDAI, USDC, USDT\nWe propose updating the borrow caps for DAI, USDC, and USDT. The new proposed caps are set to allow growth on V3 and room for the migration of positions from V2. The image below shows the total value in borrows for the said assets\n\nScreen Shot 2023-02-10 at 4.14.38 PM1530×680 55.2 KB\n\nBAL\n\nScreen Shot 2023-02-08 at 12.56.38 AM1394×1366 105 KB\n\nGiven the calculation below, we recommend increasing the supply cap of BAL to 569,200, doubling the current supply. As the borrow cap is to be updated in this AIP, we do not recommend a change.\n\nScreen Shot 2023-02-08 at 4.22.42 AM1480×184 20 KB\n\n\nArbitrum\nWETH\n\nScreen Shot 2023-02-08 at 12.53.15 AM1660×1394 217 KB\n\nGiven the calculation below, we recommend increasing the supply cap of WETH to 35,280, doubling the current supply. As the current borrow cap is at <33% utilization, we do not recommend updating it.\n\nScreen Shot 2023-02-08 at 4.23.08 AM1516×192 18.9 KB\n\nLINK\n\nScreen Shot 2023-02-08 at 12.52.46 AM1646×1486 217 KB\n\nGiven the calculation below, we recommend increasing the supply cap of LINK to 676,980, doubling the current supply. As the current borrow cap is at <10% utilization, we do not recommend updating it.\n\nScreen Shot 2023-02-08 at 4.23.21 AM1504×178 19.5 KB\n\n\nRecommendations\n\nPolygon\n\n\n\n\n\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nnotes\n\n\n\n\nBAL\n284,600\n284,600\n361,000\n136,400\n256,140\nNO CHANGE\nsupply cap was modified from our original analysis to address Gauntlet’s recommendation)\n\n\nEURS\n2,060,000\n2,000,000,000\n4,000,000\n728,530\n728,530\n947,000\nRecommendation provided by Gauntlet\n\n\nDAI\n5,680,000\n2,000,000,000\n45,000,000\n3,160,000\n3,860,000\n30,000,000\n\n\n\nUSDC\n35,590,000\n2,000,000,000\n150,000,000\n18,600,000\n30,680,000\n100,000,000\n\n\n\nUSDT\n5,940,000\n2,000,000,000\n45,000,000\n4,870,000\n5,060,000\n30,000,000\n\n\n\n\n\nArbitrum\n\n\n\n\n\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nLINK\n338,490\n350,000\n677,000\n$763,400\n20,427\nNO CHANGE\n\n\nETH\n17,640\n20,300\n35,280\n3,663\n11,165\nNO CHANGE\n\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.", "reads": 49, "readers_count": 48, "score": 434.8, "word_count": 1360, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-gauntlet-recommendations-for-wsteth-and-reth-on-eth-v3", "topic_id": 12349, "title": "[ARC] Gauntlet Recommendations for wstETH and rETH on ETH V3", "posts_count": 8, "views": 1950, "like_count": 9, "author_username": "seawolf", "created": "2023-03-18T21:23:03.228Z", "text": "\nSimple Summary\nGauntlet would like to flag that assets wstETH and rETH borrow caps are above the 75% threshold. As per our Methodology, Gauntlet would recommend the following changes to borrow cap:\n\nIncrease wstETH Borrow Cap from 3k to 6k.\nIncrease rETH Borrow Cap from 1.2k to 2.4k\n\n\nSpecification\n\n\n\n\nAsset\nCurrent Borrow Cap\nConservative Borrow Cap Rec\nAggressive Borrow Cap Rec\n\n\n\n\nrETH\n1,200\n2,482\n2,482\n\n\nwstETH\n3,000\n11,644\n11,644\n\n\n\nrETH\n\nwstETH\n", "reads": 54, "readers_count": 53, "score": 900.8, "word_count": 397, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-risk-parameter-updates-aave-v3-optimism-2023-02-28", "topic_id": 12099, "title": "[ARC] - Chaos Labs Risk Parameter Updates - Aave V3 Optimism - 2023.02.28", "posts_count": 3, "views": 1464, "like_count": 7, "author_username": "ChaosLabs", "created": "2023-03-01T00:31:56.973Z", "text": "\nSimple Summary\nA proposal to adjust nine (9) total risk parameters, including Loan-to-Value, Liquidation Threshold, and Liquidation Bonus, across four (4) Aave V3 Optimism assets.\n\nMotivation\nChaos Labs’ Parameter Recommendation Platform runs hundreds of thousands of agent-based off-chain and on-chain simulations to examine how different Aave V3 risk parameters configurations would behave under adverse market conditions - and find the optimal values to maximize protocol borrow usage while minimizing losses from liquidations and bad debt.\nNote: As a general guideline, we limit the proposed changes by ±3% for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters if the optimal configuration is outside this range.\nPlease find more information on the parameter recommendation methodology here.\nYou can also view the simulation results and breakdown for the different assets by clicking on them on this page.\nThe output of our simulations reveals an opportunity to increase LTVs and LTs for WBTC, WETH, USDC, and DAI on V3 Optimism, resulting in improved capital efficiency of the system, with no effect on the projected VaR (95th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours) and EVaR (Extreme VaR, the 99th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours)\nSimulating all changes jointly yields a projected borrow increase of ~$470,000, with no increase in VaR and Extreme VaR compared to simulations with the current parameters.\n\nScreen Shot 2023-02-27 at 17.46.431920×953 50.4 KB\n\n\nScreen Shot 2023-02-27 at 17.47.081920×954 50.9 KB\n\n\nScreen Shot 2023-02-27 at 17.47.511920×944 51 KB\n\n\nScreen Shot 2023-02-27 at 17.48.281920×936 48.3 KB\n\n\nLiquidity and Position Analysis:\nThe TVL in Aave on Optimism (115.5M$) is concentrated primarily on two blue-chip, high-liquidity assets, which together account for ~75% of the supplied assets in $ values: USDC (44%) and Ethereum (30%), with the remaining supply, mostly being WBTC (13%). As we see adequate on-chain liquidity to support significant liquidations with minimal slippage on these assets, we recommend increasing the LT and LTV for them and one additional high-liquidity asset (DAI). Similarly, we recommend reducing the Liquidation Penalty for WBTC, which is set conservatively at 10% to a lower level (7%) closer to that of USDC and Ethereum (5%).\n\nScreen Shot 2023-02-27 at 19.26.481964×1078 148 KB\n\nWETH\nWe have not identified any outsized positions that are actively affecting our recommendations. There are a few positions that supply 1-4M$ WETH each and borrow USDC against it; with the chain’s current liquidity, it is possible to liquidate these positions with slippage far below the liquidation penalty.\n\nScreen Shot 2023-02-27 at 21.37.421920×1219 78.3 KB\n\nSource: Aave V3 Risk Dashboard\n\nScreen Shot 2023-02-27 at 21.46.48908×946 64.7 KB\n\nSource: 1inch\nWBTC and DAI\nWe have not identified any outsized positions that are actively affecting our recommendations, however, we should call out that around 50% of the on-chain supply of WBTC on Optimism is currently held on Aave, which calls for some caution. We have proposed an amendment to the supply cap to limit the concentration of liquidity on Aave.\nGiven the blue-chip nature of BTC/WBTC, we expect significant arbitrage buying pressure to offset any slippage that may be created by future liquidations of WBTC and, therefore, recommend reducing the Liquidation Penalty even with the current significant liquidity concentration on Aave. We expect a lower LP to drive liquidators to liquidate positions in smaller portions, pacing the process and allowing the market more time to react.\nUSDC\nWe have identified a large position that supplies approximately 75% of USDC on Optimism and does not borrow against its ~$40M USDC position, and therefore does not currently pose a liquidation/bad debt risk to the protocol.\n\nScreen Shot 2023-02-27 at 21.33.241920×1023 38 KB\n\nSource: Aave V3 Risk Dashboard\n\nRecommendations\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWETH\nLiquidation Threshold\n82.5%\n85%\n+2.5%\n\n\nWETH\nLoan-to-Value\n80%\n82.5%\n+2.5%\n\n\nWBTC\nLiquidation Threshold\n75%\n78%\n+3%\n\n\nWBTC\nLoan-to-Value\n70%\n73%\n+3%\n\n\nWBTC\nLiquidation Penalty\n10%\n7%\n-3%\n\n\nDAI\nLiquidation Threshold\n80%\n82%\n+2%\n\n\nDAI\nLoan-to-Value\n75%\n77%\n+2%\n\n\nUSDC\nLiquidation Threshold\n85%\n86%\n+1%\n\n\nUSDC\nLoan-to-Value\n80%\n81%\n+1%\n\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.", "reads": 32, "readers_count": 31, "score": 191.4, "word_count": 958, "category_id": 7}, {"url": "https://governance.aave.com//t/evaluating-stablecoin-e-mode", "topic_id": 12299, "title": "Evaluating Stablecoin E-Mode", "posts_count": 1, "views": 1622, "like_count": 8, "author_username": "ChaosLabs", "created": "2023-03-15T22:16:47.736Z", "text": "\nMotivation\nFollowing the USDC De-Peg and the bad debt accrued as a result, we are evaluating the optimal operation mode of the stablecoin E-Mode category.\nAs we have observed during the USDC depeg, the parameters of E-Mode categories fully expose them to de-peg events. While stablecoin E-Mode provides a strong competitive advantage, allowing very high leverage on stablecoins, it also encapsulates big risks.\n\nAlmost all of the bad debt on Avalanche during the USDC de-peg was caused by 3 large E-Mode positions.\n\nMitigating Stablecoin de-peg risk\nAAVE V3 provides a set of risk levers to control different aspects of risk. We have examined several alternatives to mitigate such shortfalls in the future while examining their impact both on risk and protocol reward:\n\n\nIncreasing Stablecoin Reserve Factor\n\n\nRemoving assets from the E-Mode category\n\n\nDecreasing E-Mode Category LT\n\n\nTight supply caps and/or borrow caps to limit exposure on E-Mode\n\n\nPlacing specific stablecoins in Isolation Mode (more on that on that soon)\n\n\nUltimately, we recommend increasing stablecoins’ reserve factor as the most effective method to address stablecoin de-peg risk.\n\nIncreasing Stablecoins’ Reserve Factor\nThe above are options to limit the risk exposure to stablecoin de-peg events. However, every risk management decision is essentially the valuation of risk vs. reward. By increasing the reserve factor of stablecoins, we seek to increase protocol revenue (reward) such that it will compensate for the de-peg risk.\nThe original documentation of AAVE V3 reads:\n“The Reserve Factor is a risk premium calibrated based on the overall risk of the asset. Stablecoins are the least risky assets with a lower reserve factor”.\nThis holds for V2, where stablecoin borrows are treated equally to non-stablecoins, as there is no E-mode for increased capital efficiency. However, considering the increased risk exposure allowed by E-Mode, the risk premium should be higher.\nTo evaluate the increase in risk premium that needs to account for the increased risk in E-Mode due to de-peg events, we evaluate for an asset a:\n1. f(a) - The frequency of de-peg events per asset per year\n2. l(a)- The expected loss or bad debt in case of a de-peg event\nFor all assets in the category, we evaluate\n1. r - The revenues generated from borrowed assets\nThen we calculate the expectancy of annual loss from de-peg events:\n\nTo account for the loss, we increase the reserve factor of the stablecoins by the percent of the de-peg losses from protocol revenues.\n\nBy applying an increase in the reserve factor proportional to the loss amount, we compensate for the extra risk incurred by listing assets in E-Mode.\nNext, we will share a simulation-based evaluation of stablecoin de-peg risk losses and recommend the appropriate reserve factor settings. To get an intuition as to the amounts, the bad debt incurred by the recent USDC de-peg on AAVE V3 on Avalanche amounted to $260K, over 10% of the annual protocol revenues from stablecoin borrowing in E-Mode.\n\nScreen Shot 2023-03-16 at 17.43.441633×858 143 KB\n\n\nScreen Shot 2023-03-16 at 17.44.261578×859 73.7 KB\n\n\nOther Alternatives\n\nRemoving assets from the E-Mode category\n\nA potential solution is to remove certain assets from the stablecoin E-Mode category. Although this would eliminate any risk associated with the stablecoin’s de-peg impact on E-Mode positions, it comes with significant drawbacks:\n\nDetermining which assets should or should not be included is challenging, as USDC was previously considered the safest centralized stablecoin until the SVB announcement.\nThis change will immediately affect E-Mode positions with this asset as collateral, as they will be subject to Non-E-Mode LT. Since E-Mode is commonly used to obtain high leverage, most positions are maintained with low health factors, making them susceptible to immediate liquidation.\nAave may lose its competitive advantage in offering high-leverage borrowing of pegged assets.\n\n\n\nDecreasing E-Mode Category LT\n\nReducing the E-Mode LT can enhance position sustainability during limited de-peg occurrences. Currently, with an LT setting of 97.5%, temporary deviations can lead to liquidations and bad debt since most E-Mode-managed funds have a low health factor below 1.1.\nNotably, the three significant positions responsible for the majority of bad debt during recent events on Avalanche would have faced liquidation with a de-peg of as little as 2.5%.\nWhile decreasing LT may trigger some liquidations, if done gradually, it will allow E-Mode position holders to adjust while incurring small amounts to be liquidated.\nThis action reduces leverage and may also decrease the stablecoin supply to Aave. Nevertheless, it still provides higher leverage than other protocols.\n\n\nUsing supply caps and/or borrow caps to limit E-Mode\n\nOne way to limit exposure to E-Mode is by limiting the supply or borrow caps of stablecoins. However, since the supply and borrow caps apply to all positions, this will decrease asset supply to Non-E-Mode markets. This, in turn, could severely affect the usability and revenue of the protocol, given that many positions involve stable<>crypto transactions.\nSetting stringent supply caps is akin to eliminating assets from E-Mode, as it restricts Aave’s offering, losing its competitive edge. Therefore, if adopted, we must do so thoughtfully, such that the caps will mitigate fat-tail risk and contain the loss percentage from a de-peg while also allowing reasonable usage.\n\nConclusion\nE-Mode presents a higher leverage option, which comes with a new risk to the AAVE protocol. Currently, the risk of de-peg events is not factored into the protocol’s risk settings. To address this, the anticipated loss from such events should be considered, and we propose increasing the Reserve Factor proportionally. This approach preserves AAVE’s risk-reward balance and has fewer adverse effects than the alternatives.\n\nNext Steps\nWe invite the community to discuss the options presented above. We value the community’s feedback and suggestions, which we will consider when developing our final recommendation.", "reads": 51, "readers_count": 50, "score": 570.2, "word_count": 1076, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-chaos-labs-supply-and-borrow-cap-updates-aave-v3-polygon-2023-03-16", "topic_id": 12310, "title": "[ARFC] - Chaos Labs Supply and Borrow Cap Updates - Aave V3 Polygon - 2023.03.16", "posts_count": 5, "views": 1760, "like_count": 3, "author_username": "ChaosLabs", "created": "2023-03-16T17:55:25.123Z", "text": "\nSimple Summary\nThis ARFC proposes to increase the MAI (mimatic) supply cap to 2.2M and the borrow cap to 1.2M on Aave V3 Polygon.\n\nMotivation\nMAI is currently at ~80% utilization of its supply cap and ~85% utilization of its borrow cap on Aave V3 Polygon.\nGiven the on-chain liquidity levels and the current conservative caps set, we recommend doubling the supply and borrow cap.\nThe proposal represents a near 100% increase from the current caps, making this ARFC compliant with the “direct-to-AIP” framework.\n\nScreen Shot 2023-03-16 at 1.41.05 PM1644×1852 289 KB\n\n\n\nAdditional Assets\nWe want to flag that the following assets are at >75% of their supply or borrow cap. However, we do not recommend increasing these caps at this time due to current liquidity levels:\n\n\nGHST\n\nScreen Shot 2023-03-16 at 1.41.40 PM1666×1612 239 KB\n\n\n\nSUSHI\n\nScreen Shot 2023-03-16 at 1.42.36 PM1686×1630 244 KB\n\n\n\nBAL\n\nScreen Shot 2023-03-16 at 1.41.25 PM1660×1812 257 KB\n\n\n\nEURS\n\nScreen Shot 2023-03-16 at 1.41.16 PM1682×1772 286 KB\n\n\n\nLINK\n\nScreen Shot 2023-03-16 at 1.41.51 PM1686×1608 239 KB\n\n\n\n\nSpecification\n\nTicker: MAI (mimatic)\nContract Address: 0xa3Fa99A148fA48D14Ed51d610c367C61876997F1\n\n\n\n\nParameter\nCurrent\nProposed\n\n\n\n\nSupply Cap\n1.1M\n2.2M\n\n\nBorrow Cap Cap\n600K\n1.2M\n\n\n\n", "reads": 38, "readers_count": 37, "score": 437.6, "word_count": 647, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-supply-and-borrow-caps-update-wsteth-v3-arbitrum", "topic_id": 12309, "title": "[ARFC] - Supply and Borrow Caps Update - wstETH - V3 Arbitrum", "posts_count": 3, "views": 1420, "like_count": 7, "author_username": "ChaosLabs", "created": "2023-03-16T14:13:51.390Z", "text": "\nSummary\n\nThis ARFC proposes to increase the wstETH supply cap to 4,650 on Aave V3 Arbitrum.\n\nMotivation\n\nwstETH is currently at 100% utilization of its supply cap on Aave V3 Arbitrum. This increase happened over the past couple of days after the supply cap was doubled from 1,200 to 2,400.\n\nScreen Shot 2023-03-16 at 10.11.16 AM1704×1488 226 KB\n\nTo calculate the new cap, we have utilized our supply cap methodology. As wstETH is in the ETH-correlated emode, we have simulated a 15% drop in its price to evaluate the amount that would be liquidated, and assessed the on-chain liquidity that would allow for profitable liquidations under the 2% LP configured for the emode.\n\n\n\n\n\nSupply Cap\nExtreme Liquidation Amount\nMax Amount Liquidated\nR\nRecommended Supply Cap\n\n\n\n\nwstETH\n2,400\n$621,000\n$1,080,000\n1.93\n4,650\n\n\n\n\nScreen Shot 2023-03-16 at 9.36.21 AM2656×806 197 KB\n\n\nScreen Shot 2023-03-16 at 9.38.27 AM898×730 43.9 KB\n\nThe proposal represents a near 100% increase from the current caps, making this ARFC compliant with the “direct-to-AIP” framework.\n\nSpecification\n\nTicker: wstETH (wstETH)\nContract Address: 0x5979D7b546E38E414F7E9822514be443A4800529\n\n\n\n\nParameter\nCurrent\nProposed\n\n\n\n\nSupply Cap\n2,400\n4,650\n\n\nBorrow Cap\n190\n400\n\n\n\n", "reads": 42, "readers_count": 41, "score": 488.4, "word_count": 311, "category_id": 7}, {"url": "https://governance.aave.com//t/arfc-supply-and-borrow-caps-update-lusd-v3-ethereum", "topic_id": 12289, "title": "[ARFC] - Supply and Borrow Caps Update - LUSD - V3 Ethereum", "posts_count": 2, "views": 1310, "like_count": 3, "author_username": "ChaosLabs", "created": "2023-03-15T00:53:59.636Z", "text": "\nSummary\n\nThis ARFC proposes to increase the LUSD supply cap to 6M and the borrow cap to 2.4M.\n\nMotivation\n\nLUSD is currently at ~96% of its supply cap and ~89% of its borrow cap on Aave V3 Ethereum. This increase in supply and borrow has happened over the past few days following the de-peg events of several stablecoins, including LUSD.\nGiven the on-chain liquidity levels, current conservative caps set, and the fact that LUSD is a non-collateral asset, we recommend doubling the supply and borrow cap.\n\nScreen Shot 2023-03-14 at 8.41.03 PM942×884 58.4 KB\n\nThe proposal represents a 100% increase from the current caps, making this ARFC compliant with the “direct-to-AIP” framework.\n\nSpecification\n\nTicker: LUSD (LUSD)\nContract Address: 0x5f98805A4E8be255a32880FDeC7F6728C6568bA0\n\n\n\n\nParameter\nCurrent\nProposed\n\n\n\n\nSupply Cap\n3M\n6M\n\n\nBorrow Cap\n1.2M\n2.4M\n\n\n\n", "reads": 24, "readers_count": 23, "score": 249.8, "word_count": 184, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-risk-parameter-updates-aave-v3-ethereum-2023-02-22", "topic_id": 12015, "title": "[ARC]- Chaos Labs Risk Parameter Updates - Aave V3 Ethereum - 2023.02.22", "posts_count": 3, "views": 2286, "like_count": 5, "author_username": "ChaosLabs", "created": "2023-02-22T19:59:39.373Z", "text": "Simple Summary\nA proposal to adjust four (4) total risk parameters, including Loan-to-Value and Liquidation Threshold, across two (2) Aave V3 Ethereum assets.\nMotivation\nAave V3 Ethereum was launched successfully on January 27th, 2023, with a conservative configuration for the initial assets, as recommended by Chaos Labs.\n\n\n\nChaos Labs - Aave V3 Ethereum (Initial Parameters)\n\nwe believe that the best approach will be to launch AAVE V3 on Ethereum with conservative LT parameters and incrementally increase them over time rather than deploy with the current LT and LTV parameters.\n\n\nFollowing the successful launch and after analyzing the initial supply and borrow distribution and general usage across the deployment, we propose incrementally increasing the LTs and LTVs for USDC and DAI with the following goals:\n\nProvide a sustainable set of parameters that are better optimized for risk-reward in the long term.\nServe as a catalyst to promote migration of funds from V2 to V3, as capital efficiency under the current parameter settings is significantly inferior to V2.\n\nNote: As a general guideline, we limit our proposed changes by ±3% for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters if the optimal configuration is outside this range.\nIt is important to note that V3 Ethereum still needs to be integrated into our parameter recommendation platform, and therefore the recommendations provided here are not simulation-based. However, from running our simulations on similar assets on Arbitrum and Avalanche and considering the differences between the deployments, we conclude that the provided parameters are still conservative and can be further increased toward an optimized state in future iterations.\nLiquidity and Position Analysis:\nUSDC\nUSDC is mainly used as collateral for blue chip, high liquidity assets, most of which are WETH ($9M borrowed against USDC collateral) and recursive USDC borrowing. It is currently possible to liquidate USDC to cover all open USDC-WETH positions with very low slippage.\n\nSource: Chaos Risk Dashboard\n\nSource: 1inch\nDAI\nDAI is mainly used as collateral for blue chip, high liquidity assets, most of which are WETH ($340K borrowed against DAI collateral) and USDC ($240K borrowed against DAI collateral). It is currently possible to liquidate DAI to cover all open DAI-WETH positions and DAI-USDC with very low slippage.\n\nSource: Chaos Risk Dashboard\n\n\nSource: 1inch\nRecommendations:\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nUSDC\nLiquidation Threshold\n76%\n79%\n+3%\n\n\nUSDC\nLoan-to-Value\n74%\n77%\n+3%\n\n\nDAI\nLiquidation Threshold\n77%\n80%\n+3%\n\n\nDAI\nLoan-to-Value\n64%\n67%\n+3%\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.", "reads": 36, "readers_count": 35, "score": 227.2, "word_count": 670, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-risk-parameter-updates-mkr-on-aave-v2-ethereum-2023-02-17", "topic_id": 11948, "title": "[ARC] - Chaos Labs Risk Parameter Updates - MKR on Aave V2 Ethereum - 2023.02.17", "posts_count": 3, "views": 2275, "like_count": 4, "author_username": "ChaosLabs", "created": "2023-02-17T19:23:05.659Z", "text": "\nSimple Summary\n\nA proposal to adjust two (2) total risk parameters, including Liquidation Threshold (LT) and Loan-To-Value (LTV), for one (1) asset on Aave V2 Ethereum.\n\nMotivation\n\nThis proposal is a continuation of a series of proposals (AIP-136, AIP-137) intended to reduce the viability of different attack vectors on V2 assets.\nAt Chaos Labs, we continuously monitor markets and utilize our Asset Protection Tool to assess potential attack vectors on the protocol and suggest parameter and configuration updates accordingly (Supply/Borrow Caps, Liquidation Threshold updates, freezing of assets, listing in isolation mode, etc.)\nCapital efficiency reductions on V2 assets will further mitigate attack vectors by increasing the capital required to wage a price manipulation attack on Aave. In addition, these changes will act as an effective motivation to shift usage to V3, where users can enjoy the benefits of enhanced risk mitigation mechanisms.\nAs Liquidation Threshold reductions may lead to user accounts being eligible for liquidations upon their approval, we want to clarify the full implications to the community at each step. To minimize this impact, we suggest reaching the desired settings by a series of incremental decreases, following the Risk-Off Framework previously approved by the community, with a reduction of up to 3% in any given AIP.\nTo avoid liquidations, Chaos Labs will communicate the planned amendments before their on-chain execution via all available avenues (Twitter, forums, Nansen Connect, and Blockscan Chat).\nBelow, we share data to quantify the effect of the recommended reductions on protocol users.\nAt the time of this proposal, none of the current positions will be eligible for liquidation due to the proposed change.\n\n$MKR\n\nZero (0) accounts are eligible for liquidation.\n\n\n331932712_577684467344152_9109238961120781746_n (1)2048×1007 39 KB\n\n\nRecommendation\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nMKR\nLiquidation Threshold\n67%\n64%\n-3%\n\n\nMKR\nLoan-to-Value\n62%\n59%\n-3%\n\n\n\n", "reads": 27, "readers_count": 26, "score": 260.4, "word_count": 417, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-risk-parameter-updates-aave-v3-arbitrum-2023-02-20", "topic_id": 11986, "title": "[ARC] - Chaos Labs Risk Parameter Updates - Aave V3 Arbitrum - 2023.02.20", "posts_count": 5, "views": 2543, "like_count": 6, "author_username": "ChaosLabs", "created": "2023-02-20T18:18:00.275Z", "text": "\nSimple Summary\nA proposal to adjust nine (9) total risk parameters, including Loan-to-Value, Liquidation Threshold, and Liquidation Bonus, across four (4) Aave V3 Arbitrum assets.\n\nMotivation\nChaos Labs’ Parameter Recommendation Platform runs hundreds of thousands of agent-based off-chain and on-chain simulations to examine how different Aave V3 risk parameters configurations would behave under adverse market conditions - and find the optimal values to maximize protocol borrow usage while minimizing losses from liquidations and bad debt.\nNote: As a general guideline, we limit the proposed changes by ±3% for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters if the optimal configuration is outside this range.\nPlease find more information on the parameter recommendation methodology here.\nYou can also view the simulation results and breakdown for the different assets by clicking on them on this page.\nThe output of our simulations reveals an opportunity to increase LTVs and LTs for WBTC, WETH, USDC, and DAI on V3 Arbitrum, resulting in improved capital efficiency of the system, with a negligible effect on the projected VaR (95th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours) and EVaR (Extreme VaR, the 99th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours)\nSimulating all changes jointly yields a projected borrow increase of ~$510,000, with no increase in VaR and Extreme VaR compared to simulations with the current parameters.\n\nScreen Shot 2023-02-16 at 11.33.14 AM2790×1378 252 KB\n\n\nScreen Shot 2023-02-16 at 11.33.25 AM1920×975 50.3 KB\n\n\nScreen Shot 2023-02-16 at 11.33.36 AM1920×959 49.8 KB\n\n\nScreen Shot 2023-02-20 at 10.25.49 AM2618×1462 261 KB\n\n\nLiquidity and Position Analysis:\nGenerally, the TVL in Aave on Arbitrum (98M$) compared to the overall chain trading volume (~$142M /daily over the past three months) should allow on-chain liquidity sources to absorb liquidations across the Arbitrum positions.\n\nScreen Shot 2023-02-20 at 11.50.40 AM1222×296 34.8 KB\n\n\nScreen Shot 2023-02-20 at 11.51.28 AM1920×600 54.1 KB\n\nSource: DeFiLlama\nAs a result, Aave protocol on Arbitrum is expected to experience very low bad debt, even in extreme market conditions, across most assets. Specifically, the current values of LT and LTV for multiple assets can be safely increased to improve capital efficiency at a very low or no additional bad debt risk due to price volatility. This assumption is backed by simulation sweeps across a large range of values, measuring low Extreme Value-at-Risk (P99 bad debt) value even as LT is increased significantly.\nWETH and WBTC\nWe have not identified any “whale” positions or activity affecting our recommendations.\nUSDC\nWe have identified two large positions that supply ~45% of USDC on Arbitrum. One of these wallets does not borrow against its $7.63M USDC position.\n\nScreen Shot 2023-02-20 at 10.36.20 AM1920×1109 45.5 KB\n\nSource: Chaos Risk Dashboard\n\nScreen Shot 2023-02-20 at 10.36.03 AM2844×1336 211 KB\n\nSource: Chaos Risk Dashboard\nEven in the event of a change in the borrow usage (increasing disproportionately), the on-chain liquidity for USDC on Arbitrum should support its liquidation potential.\n\nScreen Shot 2023-02-20 at 1.17.28 PM874×570 38.6 KB\n\nSource: 1inch\n\nScreen Shot 2023-02-20 at 1.16.04 PM894×558 40.5 KB\n\nSource: 1inch\nDAI\nWe have identified one large position which supplies ~40% of DAI on Arbitrum and does not currently borrow against the position.\n\nScreen Shot 2023-02-20 at 10.48.20 AM2854×1298 203 KB\n\nSource: Chaos Risk Dashboard\nEven in the event of a change in the borrow usage (increasing disproportionately), the on-chain liquidity on Arbitrum should be able to support its liquidation potential.\n\nScreen Shot 2023-02-20 at 1.12.46 PM916×550 38.3 KB\n\nSource: 1inch\n\nScreen Shot 2023-02-20 at 1.13.05 PM914×566 40 KB\n\nSource: 1inch\n\nRecommendations\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWETH\nLiquidation Threshold\n82.5%\n85%\n+2.5%\n\n\nWETH\nLoan-to-Value\n80%\n82.5%\n+2.5%\n\n\nWBTC\nLiquidation Threshold\n75%\n78%\n+3%\n\n\nWBTC\nLoan-to-Value\n70%\n73%\n+3%\n\n\nWBTC\nLiquidation Penalty\n10%\n7%\n-3%\n\n\nDAI\nLiquidation Threshold\n80%\n82%\n+2%\n\n\nDAI\nLoan-to-Value\n75%\n77%\n+2%\n\n\nUSDC\nLiquidation Threshold\n85%\n86%\n+1%\n\n\nUSDC\nLoan-to-Value\n80%\n81%\n+1%\n\n\n\n", "reads": 42, "readers_count": 41, "score": 453.4, "word_count": 1075, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-supply-and-borrow-cap-updates-aave-v3-2023-02-24", "topic_id": 12048, "title": "[ARC] - Chaos Labs Supply and Borrow Cap Updates - Aave V3 - 2023.02.24", "posts_count": 8, "views": 3189, "like_count": 15, "author_username": "ChaosLabs", "created": "2023-02-24T17:41:43.909Z", "text": "\nSimple Summary\nA proposal to adjust:\n\nTwenty-five (25) total risk parameters, including Supply Cap and Borrow Cap, across thirteen (13) stablecoins on Aave V3 Polygon, Arbitrum, Avalanche, and Optimism assets.\nFour (4) supply caps across four (4) assets on Aave V3 Polygon and Avalanche\n\n\nMotivation\nThe objective of this proposal is to recommend updated supply and borrow caps for:\n\n\nV3 stablecoins that have excessive supply caps set and/or have no set borrow cap.\n\nThe caps are intended to allow for substantial growth compared to the current supply while not set too excessively.\nThe recommendations for the supply caps are set to up to 40% of the circulating supply for most assets and no more than 60%. You can find the exact number for each asset in the tables below. Borrow caps are set to ~65% of the supply cap.\n\n\n\nV3 assets that have reached over 75% utilization of either cap.\n\nThe recommendations provided in this proposal were derived using Chaos Labs’ Updated Supply and Borrow Cap Methodology. Below are the data and considerations for the assets and recommended caps for these assets:\n\n\n\nThere following assets are at >75%. However, we do not recommend increasing their caps at this time due to current liquidity levels:\n\nGHST (V3 Polygon)\nSUSHI (V3 Polygon)\nBAL (V3 Polygon)\nAAVE (V3 Arbitrum)\n\n\nPolygon\nWe propose updating the supply caps for WETH and AAVE. The new proposed caps are set to allow growth on V3 and room for the migration of positions from V2. The image below shows the total value in borrows for the said assets.\nWETH\n\nScreen Shot 2023-02-24 at 12.19.35 PM1684×1462 235 KB\n\nGiven the calculation below, we recommend increasing the supply cap of WETH to 50,000, nearly doubling the current supply cap (rounded down from 53,800).\nWe do not recommend a change to the borrow cap at this time.\n\n\n\n\n\nCurrent Supply\nExtreme Liquidation Amount\nMax Amount Liquidated\nR\nRecommended Supply Cap\n\n\n\n\nWETH\n22,310\n$350,000\n$8,500,000\n2.00\n50,000\n\n\n\nAAVE\n\nScreen Shot 2023-02-24 at 12.22.33 PM1668×834 74.6 KB\n\nGiven the calculation below, we recommend increasing the supply cap of AAVE to 70,000 nearly doubling the current supply cap (rounded down from 73,640).\n\n\n\n\n\nCurrent Supply\nExtreme Liquidation Amount\nMax Amount Liquidated\nR\nRecommended Supply Cap\n\n\n\n\nAAVE\n34,360\n$70,250\n$280,000\n2.00\n70,000\n\n\n\n\nAvalanche\nWe propose updating the supply caps for LINK and AAVE. The new proposed caps are set to allow growth on V3 and room for the migration of positions from V2. The image below shows the total value in borrows for the said assets.\nAAVE\n\nScreen Shot 2023-02-24 at 12.27.28 PM1732×858 76 KB\n\nGiven the calculation below, we recommend increasing the supply cap of AAVE to 5,800.\n\n\n\n\n\nCurrent Supply\nExtreme Liquidation Amount\nMax Amount Liquidated\nR\nRecommended Supply Cap\n\n\n\n\nAAVE\n3,860\n$11,100\n$15,000\n1.50\n5,800\n\n\n\nLINK\n\nScreen Shot 2023-02-24 at 12.28.12 PM1654×1494 222 KB\n\nGiven the calculation below, we recommend increasing the supply cap of LINK to 440,000.\nWe do not recommend a change to the borrow cap at this time.\n\n\n\n\n\nCurrent Supply\nExtreme Liquidation Amount\nMax Amount Liquidated\nR\nRecommended Supply Cap\n\n\n\n\nLINK\n294,910\n$121,770\n$166,000\n1.50\n440,000\n\n\n\n\n\nRecommendations\n\nArbitrum\nUpdated Caps for Stables\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nNotes\n\n\n\n\nDAI\n3,530,000\n2,000,000,000\n50,000,000\n1,940,000\nN/A\n30,000,000\n38% of the circulating supply\n\n\nEURS\n36,590\nN/A\n60,000\n24,242\nN/A\n45,000\n60% of the circulating supply\n\n\nUSDC\n34,700,000\n2,000,000,000\n150,000,000\n17,410,000\nN/A\n100,000,000\n16% of the circulating supply\n\n\nUSDT\n3,720,000\n2,000,000,000\n50,000,000\n3,060,000\nN/A\n35,000,000\n20% of the circulating supply\n\n\n\n\nOptimism\nUpdated Caps for Stables\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nNotes\n\n\n\n\nDAI\n2,620,000\n2,000,000,000\n25,000,000\n1,210,000\nN/A\n16,000,000\n35% of the circulating supply\n\n\nsUSD\n1,510,000\n20,000,000\nNo Change\n783,150\nN/A\n13,000,000\n25% of the circulating supply\n\n\nUSDC\n48,510,000\n2,000,000,000\n150,000,000\n15,870,000\nN/A\n100,000,000\n43% of the circulating supply\n\n\nUSDT\n3,880,000\n2,000,000,000\n25,000,000\n3,100,000\nN/A\n16,000,000\n47% of the circulating supply\n\n\n\n\nAvalanche\nUpdated Caps for Stables\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\nNotes\n\n\n\n\nDAI\n12,260,000\n2,000,000,000\n30,000,000\n6,480,000\nN/A\n20,000,000\n52% of the circulating supply\n\n\nFRAX\n16,260\n50,000,000\n1,500,000\n15,281\n2,000,000\n1,000,000\n38% of the circulating supply\n\n\nMAI\n113,620\n50,000,000\n700,000\n103,660\n2,000,000\n460,000\n42% of the circulating supply\n\n\nUSDC\n156,940,000\n4,000,000,000\n250,000,000\n97,960,000\nN/A\n175,000,000\n45% of the circulating supply\n\n\nUSDT\n52,450,000\n2,000,000,000\n200,000,000\n35,930,000\nN/A\n140,000,000\n30% of the circulating supply\n\n\n\nHigh Utilization\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nAAVE\n3,860\n4,500\n5,800\nN/A\nN/A\nN/A\n\n\nLINK\n294,870\n353,000\n440,000\n5,750\n220,000\nNo Change\n\n\n\n\nPolygon\nHigh Utilization\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\nCurrent Borrow\nCurrent Borrow Cap\nRecommended Borrow Cap\n\n\n\n\nWETH\n22,250\n26,900\n50,000\n2,695\n14,795\nNo Change\n\n\nAAVE\n34,300\n36,820\n70,000\nN/A\nN/A\nN/A\n\n\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and utilizing the Aave V3 Caps Framework, are targeting an AIP for Monday, February 27th.", "reads": 59, "readers_count": 58, "score": 661.8, "word_count": 2810, "category_id": 7}, {"url": "https://governance.aave.com//t/aave-v3-borrow-caps-methodology", "topic_id": 10925, "title": "AAVE V3 Borrow Caps Methodology", "posts_count": 8, "views": 2593, "like_count": 15, "author_username": "ChaosLabs", "created": "2022-12-05T18:54:43.657Z", "text": "\nSummary\nSupply and borrow caps are new risk parameters introduced in AAVE V3. For many of the assets already listed, neither cap has been set. For those that have been implemented, there wasn’t always a consistent methodology. Moreover, with the recent changes in market sentiment and volatility, there is a need to set forward a new, transparent methodology and process.\nIn the short term, we expect to iterate more frequently on setting supply and borrow caps while setting optimal thresholds. It will allow us to better identify and analyze market behavior following such changes, as we have already witnessed increased deposits in response to setting the supply cap on LINK.\nBorrow Cap References (from Aave docs and forum posts)\n\n\nBorrow caps can be used to prevent traditional and flash borrowing of an asset that may experience a price exploit and lead to protocol insolvency (link)\n\n\nTokens that are mainly used as collateral and have no obvious borrowing use cases usually should start off with a conservative borrow cap slightly above optimal utilization. With this, the asset can still be borrowed while limiting the exposure of the protocol (link)\n\n\n\nMethodology\nTo determine initial borrow caps, we’re looking at several factors:\n\nThe optimal utilization rate (UOptimal)\nThe current supply of the asset (CurrentSupply)\nThe supply cap of the asset (SupplyCap)\n\nNote: UOptimal is a static 0.45 based on the interest rate curves currently approved. There are already several reviews underway to modify and enhance these curves, which will require further research and likely amended Borrow Cap proposals.\n\nThe rationale behind setting the caps\nWe want to accommodate all cases, including when the maximum amount is supplied (the supply cap). The ideal utilization in the case of maximum supply will be achieved at the optimal utilization ratio meaning SupplyCap * UOptimal. For instance, if the supply cap is set at 1,000 for token AAA and UOptimal is 0.45, a borrowing cap of 450 AAA tokens will suffice. This is because even if 1,000 AAA tokens are supplied, we can reach the optimal utilization point. Of course, most of the time, the supply will be lower. In this case, Slope 2 of the interest rate curve is supposed to help limit borrowing at CurrentSupply * UOptimal. However, as it takes time to adjust supply caps when nearing the cap, we also allow another 10% of the supply to be borrowed in case of high demand until the supply cap is raised.\nA temporary exception to this rule is when the amount of tokens already supplied to the protocol is already high. In this case, we understand that supply pressure pushes to increase the supply cap, so we allow for a somewhat higher borrow cap for the asset to accumulate demand ahead of the supply. This cap is at 70% of the current supply. Using the example above, where the cap on token AAA is 1,000, and there is already a supply of 900 AAA tokens, we’ll set the cap to 0.7 * 900 = 630 AAA tokens. This is because we understand that under the current supply pressure nearing the cap, we’re likely to review an increase in the supply cap (depending on risk concerns), and following also the borrowing cap.\nLevel 1 Borrow Cap =  SupplyCap * (UOptimal+0.1)\nThis theoretical limit still allows optimal asset utilization at the point of maximum supply. The additional buffer of 10% of the supply leaves room for more borrowing in case of high demand until the supply cap is raised.\nLevel 2 Borrow Cap = 0.7 * CurrentSupply\nIn cases where the current supply is nearing the existing supply cap, we want to allow for a higher borrow cap, as it is a signal of high supply that may likely result in increasing the supply cap. Higher borrow caps will leave space to identify increased demand to support such a decision. The borrowing cap is complementary to the interest rate curve, and the latter is the main mechanism to ensure sufficient liquidity on the supply side to allow aToken redemption both for suppliers to withdraw liquidity and to ensure efficient liquidations. At the same time, we seek to ensure sufficient liquidity for suppliers in case of surging demand from borrowers, so the lower bound is set at 0.7.\nThe recommended borrow cap should be the larger value between Level 1 and Level 2.\nThis is an initial iteration of the borrow cap methodology. We’d love any community feedback or ideas on how to improve the methodology.", "reads": 85, "readers_count": 84, "score": 2632.0, "word_count": 1314, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-chaos-labs-risk-parameter-updates-aave-v3-avalanche-2023-02-07", "topic_id": 11603, "title": "[ARC] - Chaos Labs Risk Parameter Updates - Aave V3 Avalanche - 2023.02.07", "posts_count": 5, "views": 2497, "like_count": 15, "author_username": "ChaosLabs", "created": "2023-02-07T20:14:01.807Z", "text": "\nSimple Summary\nA proposal to adjust nine (9) total risk parameters, including Loan-to-Value, Liquidation Threshold and Liquidation Bonus, across four (4) Aave V3 Avalanche assets.\n\nMotivation\nChaos Labs’ Parameter Recommendation Platform runs hundreds of thousands of agent-based off-chain and on-chain simulations to examine how different configurations of Aave V3 risk parameters would behave under adverse market conditions - and find the optimal values to maximize protocol borrow usage while minimizing losses from liquidations and bad debt.\nNote: As a general guideline, we limit the search range to ±3% change for all parameters as a high/low bound for a given proposal. This ensures more controlled changes and allows us to analyze their effect on user behavior before recommending further amendments to the parameters in cases the optimal configuration is outside this range.\nIt is important to note that the parameters across the different assets were not jointly optimized, meaning that for each asset, the risk parameter optimization was done against the current state of the protocol. After optimizing the configuration for each asset individually, we verify that the combination of parameter updates leads to improving the risk-reward balance by simulating the recommended changes together.\nPlease find more information on the parameter recommendation methodology here.\nYou can also view the simulation results and breakdown for the different assets by clicking on them on this page.\n\nUntitled (17)2038×1204 229 KB\n\n\nIncrease LTs + LTVs (WAVAX, BTC.b, and LINK.e)\nThe output of our simulations reveals an opportunity to increase LTVs and LTs for WAVAX, BTC.b, and LINK.e, resulting in improved capital efficiency of the system, with a minor effect on the projected VaR (95th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours) and EVaR (Extreme VaR, the 99th percentile of the protocol losses that will be accrued due to bad debt from under-collateralized accounts over 24 hours)\nGiven the changes, we project an increase of ~0.9% in borrow usage across the assets, while the increase in VaR is <10K$. The simulation shows Extreme VaR to remain within the same level.\nWAVAX\n\nUntitled (18)2062×1032 168 KB\n\nBTC.b\n\nUntitled (19)2038×976 71.1 KB\n\nLINK.e\n\nUntitled (20)2022×960 68.3 KB\n\n\nDecrease LT + LTV (WETH.e)\nThe simulations show that the LT and LTV set for WETH.e are not optimal and should be reduced to improve the overall safety of the protocol. Given the change, the projected decrease in borrow usage for the asset is 1.37%, while the decrease in VaR and EVaR is ~$7K and ~$120K, respectively.\nAs of 02/06/2023, reducing the LT by 3% will lead to no new liquidated accounts (link).\n\nScreen Shot 2023-02-06 at 11.03.49 AM1113×167 38.9 KB\n\nCommunity Risk Appetite\nWhen considering the reduction of LTs and LTVs of an asset, there are more considerations to take into account that are challenging to quantify and are not currently accounted for in our simulations. These include, for example, the impact of forced liquidations on the public trust of the protocol, borrower user experience, and capital efficiency vs. competing protocols.\nGiven the risk-reward tradeoff presented above and other subjective considerations, we will present two options in the Snapshot vote - YAE/NAE for the LT+LTV reduction of WETH.e.\nWe are eager to hear the community’s risk preferences and invite a discussion regarding key voting considerations.\n\nRecommendations\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWAVAX\nLiquidation Threshold\n70%\n73%\n+3%\n\n\nWAVAX\nLoan-to-Value\n65%\n68%\n+3%\n\n\nBTC.b\nLiquidation Threshold\n75%\n78%\n+3%\n\n\nBTC.b\nLoan-to-Value\n70%\n73%\n+3%\n\n\nBTC.b\nLiquidation Penalty\n6.5%\n5.5%\n-1%\n\n\nLINK.e\nLiquidation Threshold\n65%\n68%\n+3%\n\n\nLINK.e\nLoan-to-Value\n50%\n53%\n+3%\n\n\n\nAs mentioned above, Chaos Labs will present two options in the Snapshot vote - YAE/NAE for the parameter updates of WETH.e shown below:\n\n\n\n\nAsset\nParameter\nCurrent\nRecommended\nChange\n\n\n\n\nWETH.e\nLiquidation Threshold\n82.5%\n79.5%\n-3%\n\n\nWETH.e\nLoan-to-Value\n80%\n77%\n-3%\n\n\n\n\nNext Steps\nWe invite a community discussion around the proposed parameter updates and will follow up with a Snapshot vote in 5 days, barring community objection.", "reads": 46, "readers_count": 45, "score": 484.2, "word_count": 1696, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-supply-cap-update-savax-avalanche-v3", "topic_id": 11904, "title": "[ARC] - Supply Cap update sAVAX Avalanche V3", "posts_count": 2, "views": 2268, "like_count": 2, "author_username": "ChaosLabs", "created": "2023-02-15T17:14:14.932Z", "text": "\nSimple Summary\nA proposal to increase the supply cap for sAVAX on Avalanche V3.\n\nMotivation\nIn this proposal, Chaos Labs recommends increasing the supply cap for sAVAX on Avalanche V3, which has reached 100% utilization.\nsAVAX Oracle\nThe sAVAX oracle on Aave is unique in implementation. The custom-built oracle adapter ‘attaches itself’ to two contracts to calculate the price for sAVAX.\n\nHalf of the price is derived from the AVAX-USD Chainlink feed\nHalf of the price is derived from the sAVAX contract.  Unlike rebasing tokens (i.e., Aave’s aTokens), sAVAX accumulates the underlying yield of staking AVAX and distributes the yield to sAVAX holders via the exchange rate.\n\nThis composition of the sAVAX oracle means that its price will always be equal to or higher than that of AVAX.\nE-Mode Liquidations\n\nThe majority (83%) of sAVAX is lent within E-mode.\n\n\nsAVAX1167×554 53.2 KB\n\n\nGiven that the oracle will only show increasing prices compared to AVAX, it is unlikely for a lender to get liquidated in the leveraged loop on the correlated E-mode.\n\nThere is a theoretical possibility of liquidation due to interest rate payments on the loan. However, we do not think this poses a significant risk on account of the following:\n\nIf Aave borrowing APY < sAVAX Staking APY, then the price appreciation is greater than IR payments, and no liquidation will take place\nIf Aave borrowing APY > sAVAX Staking APY, then it will be unprofitable for sAVAX holders to borrow AVAX against sAVAX, as they’d rather simply unstake their AVAX.\n\n\n\n\n\nNon E-Mode Liquidations\nOutside of E-mode, with the liquidation bonus set at 10%, liquidators may choose to seize sAVAX if an account’s health dips below one and sell off the sAVAX with a higher profit margin than other collateral. In the past 90 days, we have seen 19 liquidations of a total amount of ~$2,000\n\nthe y-axis represents the value liquidated in USD\n\nScreen Shot 2023-02-14 at 2.56.18 PM1920×1046 90.6 KB\n\nSource: Chaos Labs\nThe majority of liquidity for sAVAX is on Platypus Finance. A single swap of 145,000 sAVAX incurs slippage lower than the 10% liquidation penalty. On Trader Joe, there is additional liquidity of around 10% of the amount available on Platypus within the same price impact range.\n\nScreen Shot 2023-02-14 at 21.01.53716×527 92.2 KB\n\nPlatypus Finance\n\nScreen Shot 2023-02-14 at 21.00.36509×529 67.3 KB\n\nTrader Joe\nConclusion\nWhile in E-mode, given the characteristics of the sAVAX oracle, sAVAX-AVAX lenders/borrowers cannot face liquidation, pushing the risks primarily towards the sAVAX counter-party risk, i.e., sAVAX contract breaking or failing (audits of Benqi smart contracts - link 1, link 2, link 3).\nTherefore, we mainly observe considerations of liquidity that will serve the liquidations of positions outside of E-mode.\nLess than 20% of sAVAX is currently out of eMode, which is approximately the amount that can be liquidated profitably at once on Platypus and Trader Joe’s.\nWhile liquidity is not constant, we see across several observations that the liquidity available for sAVAX is maintained around these levels. Under the current risk parameters of 30% LT outside of E-mode, we assume that sAVAX collateral increase will distribute similarly and may lean even more towards E-mode positions than the current supply. Under this assumption, even when we increase the supply cap by 100%, there is still enough liquidity to profitably liquidate 50% of the total positions that may be liquidated (outside of E-mode).\nWith these defensive assumptions, we recommend increasing the supply cap to 2M sAVAX.\n\nRecommendations\n\n\n\n\nAsset\nCurrent Supply\nCurrent Supply Cap\nRecommended Supply Cap\n\n\n\n\nsAVAX\n999,910\n1,000,000\n2,000,000\n\n\n\n\nDisclaimer: Benqi is an existing customer of Chaos Labs’ risk and optimization services which provides us further visibility and knowledge of risks related to sAVAX. That engagement is unrelated to work done for Aave, and they do not compensate us for asset listing or parameter modifications on any instance of Aave, but we have shared this proposal with them for initial feedback as we do with most projects interacting with the Aave protocol to ensure its accuracy.", "reads": 36, "readers_count": 35, "score": 332.2, "word_count": 873, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-market-alerts-feb-2023", "topic_id": 11622, "title": "Gauntlet Market Alerts (Feb 2023)", "posts_count": 7, "views": 2109, "like_count": 9, "author_username": "seawolf", "created": "2023-02-08T22:43:57.628Z", "text": "Gauntlet would like to alert the community to two high supply concentrations that have reached the 50% concentration risk threshold in the Polygon v3 and Eth v3 markets. Our team is investigating and will keep the community updated on any further developments.\nWe are continuing to monitor this account, but we wanted to share this information to make sure the protocol is aware and add context if possible:\n\nAddress: 0xbeef2691e1d13ec8cb278c3068c2edfb2109cef3\n\nSize of Supply Position (USD): $3M\n\nRisk Concentration of Supply Position: 51%\n\nBorrow Usage: 59.60%\n\nUntitled (14)3742×1160 256 KB\n\n\n\n\nUntitled (15)1856×984 43.2 KB\n\nWe are continuing to monitor this account, but we wanted to share this information to make sure the protocol is aware and add context if possible:\n\nAddress: 0xd7cd13d8f86c7c580491b4cdadf849267475a965\n\nSize of Supply Position (USD): $2.41M\n\nRisk Concentration of Supply Position: 83%\n\nBorrow Usage: 89.12%\n\n\n\nUntitled (16)3724×984 182 KB\n\n\nUntitled (17)1876×982 42.7 KB\n", "reads": 40, "readers_count": 39, "score": 88.0, "word_count": 786, "category_id": 7}, {"url": "https://governance.aave.com//t/projection-finance-alpha-aave-v3-avalanche", "topic_id": 11276, "title": "Projection Finance [Alpha - Aave V3 Avalanche]", "posts_count": 2, "views": 1604, "like_count": 1, "author_username": "projection_finance", "created": "2023-01-05T08:41:26.920Z", "text": "Hello to all Aave users!\nI am happy to announce that we are releasing an alpha version of Projection Finance for Aave V3 Avalanche. Projection Finance is an online tool that allows you to simulate the impact of price changes and actions on a portfolio of assets. The product is initially focused on the DeFi and cryptocurrency market, but it may be expanded to include other types of assets in the future.\nWe are seeking feedback from Aave V3 Avalanche users to ensure that Projection Finance is useful and easy to use for those who have positions on Aave V3. If you have positions on Aave V3 Avalanche and would like to try out Projection Finance, please do not hesitate to message us for more information.\nWe plan to open Projection Finance to all V3 markets, including Ethereum, as soon as the protocol is released. We believe that Projection Finance can be particularly useful for Aave users, as they will be able to create projection scenarios by modulating asset prices and know at what threshold they can be liquidated or simply see the evolution of their debt or supply over time and prices.\nWe hope that many of you will try out Projection Finance and give us your feedback. We are excited to work with you and improve the tool. If you have ideas for new features or encounter any issues while using Projection Finance, please do not hesitate to contact us. We are committed to making Projection Finance a useful and accessible portfolio simulation tool for all Aave users.\nIn addition to simulating the impact of price changes on your portfolio, we are also working on adding new features to Projection Finance. For example, we plan to add the ability to simulate actions such as borrow, supply, emode, and many more. We believe that these features will be particularly useful for Aave users who want to better understand how these actions can affect their portfolio.\nWe are excited to continue developing Projection Finance and adding new features to meet the needs of our users. If you have ideas for new features that you would like to see in Projection Finance, please do not hesitate to contact us. We are always open to suggestions and feedback from our users.\nFinally, we want to thank all those who have supported us so far (Aave Grants, Aave Company, Leverageux,users, partner’s,…) and helped us develop Projection Finance.\nWe look forward to continuing to work with you and helping you achieve your investment goals on Aave.\nThank you again for your support and we hope to hear from you soon!\nDon’t hesitate to fill in the typeform on the website to access the alpha\n\n  \n      \n\n      Projection Finance\n  \n\n  \n    \n\nProjection Finance\n\n  Predictions & Analytics Platform for Defi\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nTwitter https://www.twitter.com/projection_defi\nLens : https://lenster.xyz/u/projection\nWe will open the discord in a few days", "reads": 28, "readers_count": 27, "score": 310.6, "word_count": 559, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-aave-v3-ethereum-initial-parameters", "topic_id": 11159, "title": "Chaos Labs - Aave V3 Ethereum (Initial Parameters)", "posts_count": 2, "views": 2491, "like_count": 10, "author_username": "ChaosLabs", "created": "2022-12-23T20:49:12.891Z", "text": "\nIntroduction\nAave v3 Ethereum is planned to launch in the coming weeks following the community’s approval of the deployment. As a first step, the community has decided on the initial assets listed on this deployment.\nThe primary blocker to launching v3 Ethereum is the risk parameter configuration of the assets to be deployed. To provide parameter recommendations and enable the deployment at the earliest convenience, Chaos Labs suggests dividing the listing of assets into two stages.\n\nLaunch - Stablecoins and select “top-tier” assets (full list and recommendations below)\nPost-Launch - rest of the assets as voted on here\n\nGiven Gauntlet’s parameter recommendations for isolated long-tail assets, the community can decide to include them in the initial deployment stage. Chaos Labs will be able to provide our analysis and recommendations for these assets after launching the Parameter Recommendation Dashboard in the coming weeks.\n\n\n\nChaos Labs is proposing the following framework for deciding on the initial parameter configurations of these assets and is inviting the community to provide feedback and input to incorporate into these initial recommendations.\n\nMotivation\nUnder the current market conditions and in light of the recent CRV attack, Aave aims to provide lenders and borrowers with enhanced security and risk measures via the Ethereum V3 deployment. Chaos Labs is building a set of agent-based simulations that will inform optimized risk parameters for V3 markets with the aim of:\n\nUnblocking other contributors in launching V3 on Ethereum.\nFacilitating a safe and guarded initial launch.\nRecommend parameters in-line with current market conditions and liquidity.\nIterate on recommended parameters to help incentivize users to migrate from V2 to V3, where more granular risk parameter tuning is available.\n\nOur V3 Monte Carlo simulation framework is expected to be completed in January 2023; however, due to the urgency of deploying Aave V3 on Ethereum, we have devised an interim methodology for initial launch risk parameters. Under current conditions, our risk-reward tradeoff leans heavily toward risk aversion; therefore, our primary motivation with the interim methodology is to provide a risk-off strategy for the community to opine on. Optimizing for risk-averse parameters while producing recommendations promptly has intentionally yielded less capital-efficient results. Once the simulation framework is complete and published for review, we can iterate on the recommendations to produce more capital-efficient risk parameter recommendations while keeping protocol risk at acceptable levels.\n\nMethodology\nSince Aave V2 on Ethereum has a long history and significant TVL and volume, the best approach for the initial recommendations is to use its risk parameter settings as a reference. Our approach is as follows:\n\nUtilize existing risk parameters as a baseline.\nAdjust parameters based on simulation results.\nIntroduce additional risk parameters to accommodate extra security measures.\n\nV3 offers a comprehensive set of risk parameters - some available on V2 (LT, LTV, Liquidation Penalty). We start by replicating the existing V2 parameters, adjusting them, and adding new ones (Supply Cap, Borrow Cap). After that, we will examine how we can use additional V3 risk levers and modes (efficiency mode, isolation mode) to make the assets more efficient via parameter updates, unfreezing assets, and enabling borrows.\n\nTLDR - Initial Set Results\n\n\n\n\nAsset\nSupply Cap\nBorrow Cap\nLT\nLTV\nLiquidation Bonus\nDebt Ceiling\n\n\n\n\nWBTC\n43K\n28K\n75%\n70%\n6.25%\nN/A\n\n\nWETH\n1.8M\n1.4M\n82.5%\n80%\n5%\nN/A\n\n\nwstETH\n200K\n3K\n79.5%\n68.5%\n7%\nN/A\n\n\nUSDC\n1.76B\n1.58B\n76%\n74%\n4.5%\nN/A\n\n\nDAI\n338M\n271M\n77%\n64%\n4%\nN/A\n\n\nLINK\n24M\n13M\n65%\n50%\n7.5%\nN/A\n\n\nAAVE\n1.85M\n0\n70%\n60%\n7.5%\nN/A\n\n\n\nIn addition, we recommend configuring an Ethereum-correlated (wstETH & ETH) e-mode category with the following parameters (more info on e-mode configuration below):\n\n\n\n\nCategory\nAssets included\nLT\nLTV\nLiquidation Bonus\n\n\n\n\nEthereum Correlated\nWETH, wstETH\n93%\n90%\n1%\n\n\n\n\nInitial Parameter Recommendation Process Overview\nThe Initial Assets List\nIn light of the urgency to transition to Aave V3, we have focused on a limited number of assets to ensure proper risk coverage. To drive the most impact, we have selected assets representing a significant portion of the protocol’s usage (and, therefore, revenue).\nRisk Parameters that already exist on Aave V2\nFollowing the guidelines of our approach to start with the battle-tested parameters of V2, we begin with a baseline of LT, LTV, Liquidation Penalty, and IR Curve similar to the values set today for those assets on V2.\nSupply Caps for Non-Stable Crypto Assets\nThen, we determine the supply caps described in our supply cap methodology. Since the supply caps are derived from the liquidity available in DEXs to facilitate potential liquidations, it is essential to note that they should apply to the supply of both V2 and V3 for each asset. This is because we expect to see accounts from both V2 and V3 liquidated in cases of high market volatility, and the same DEX pools will be used to absorb the liquidated assets. However, the base assumption is without significant increases in rewards or yields, we don’t expect to see significant net new liquidity in V3. Instead, as economic incentives align (improved capital efficiency in V3 versus V2), we expect the liquidity to originate from V2 as users migrate.\nTo ensure a significant V3 migration, we will recommend risk parameter changes shortly (see recommendations below) to incentivize users to transition to V3.\nSupply Caps for Stable Coins\nThe supply caps for stablecoins are derived from the number of stablecoins required to ensure the economic efficiency of the protocol, similar to V2. To do that, we examine the following:\n\nThe percentage of collateral each stablecoin represents from the total collateral supplied against non-stable crypto assets (that we choose to list on V3) borrows in V2. For example, consider all positions in which an asset is provided as collateral and assets such as WBTC or WETH are borrowed against the said stablecoins.\n\n\nimage1800×1230 72.3 KB\n\nSource - Block Analitica - AAVE | Block Analitica\n\nThe percentage of borrows each stablecoin represents from the total borrows against collateral provided in non-stable crypto assets that we choose to list on V3. The following graphic illustrates this on a trailing 30-day basis:\n\n\nimage1800×1204 61.3 KB\n\nSource - Block Analitica - AAVE | Block Analitica\nWe set the supply caps to sufficiently accommodate collateral and borrow against the listed non-crypto assets.\nStablecoins supplied as collateral for WBTC and WETH loans from Aave V2\n\n\n\n\nAsset\nAgainst WBTC Loans\nAgainst WETH Loans\nTotal\n\n\n\n\nUSDC\n$49.7M\n$94.6M\n$144.3M\n\n\nDAI\n$0\n$12.4M\n$12.4M\n\n\n\nStablecoins borrowed against WBTC and WETH collateral from Aave V2\n\n\n\n\nAsset\nAgainst WBTC Loans\nAgainst WETH Loans\nTotal\n\n\n\n\nUSDC\n$147.2M\n$185.7M\n$332.9M\n\n\nDAI\n$13.4M\n$36.5M\n$49.9M\n\n\nUSDT\n$62M\n$65.9M\n$127.9M\n\n\n\nObserving the current amounts of stablecoins borrowed or supplied against WBTC and WETH, we see the total amounts of stablecoins borrowed are significantly higher. Therefore they should serve as the reference to determine the supply caps of stablecoins. Although stablecoins generally do not contribute much to the risk of the protocol, it is better to set caps if they are such that they can assure proper utilization and efficiency.\nSince the only non-stable crypto assets listed initially are WETH, WBTC, and wstETH, we know that the borrows against WBTC collateral will be WETH, wstETH, and stablecoins, and conversely, borrows against WETH collateral will be WBTC, wstETH, and stablecoins.\nWe recommend setting the caps for stablecoins as the sum of their respective borrow amounts against WETH and WBTC on V2. Once deriving the estimated stablecoin amounts borrowed against WBTC and WETH on V3, we suggest setting the supply cap to the sum of the estimated quantities multiplied by UOptimal (the optimal utilization ratio) of the crypto asset. This way, in the event of max supply of both WETH and WBTC, there will be enough stablecoins to be borrowed while keeping each stablecoin’s utilization rate at the optimal level.\n\nDenote amount of stables borrowed against WETH in v2 as Bv2(Stable, WETH)\n\nDenote LTV(Stable, WETH) = Bv2(Stable, WETH)/CollateralUSDValueV2(WETH)\n\nWe wish to maintain the same LTV(Stable, WETH) in v3, even when the WETH supply cap has been filled.\nThat yields LTV(Stable, WETH) = Bv3(Stable, WETH)/SupplyCapV3(WETH)\n\nTo support this amount of borrows and maintain optimal utilization, we must allow Supply(Stable) of at least Bv3(Stable, WETH)/U_{opt}.\nTherefore, we set Supply(Stable, WETH) = Bv3(Stable, WETH)/U_{opt} = Bv3(Stable, WETH)/U_{opt} = (LTV(Stable, WETH) * SupplyCapV3(WETH))/U_{opt}\n\n\nConversely, this holds for Supply(Stable, WBTC). Adding both terms together yields the following:\nSupplyCap(Stable) = Supply(Stable, WETH) + Supply(Stable, WBTC)\n\nLowering LT, LTV for Stablecoins\nDuring the last bull run, many risk parameters on AAVE V2 were relaxed significantly. Specifically, LTs, LTVs, and Liquidation Penalties of stablecoins and the major crypto assets are too high considering current market conditions.\nChallenges with Lowering LT, LTV\nIncreasing LTs enables additional borrows against the same collateral. This has no direct negative impact on users. However, lowering LT may cause loan liquidations that fall below the new lower LT. An example of this regarding USDC and DAI LTs was discussed recently after the CRV attack (link). Therefore, we believe that the best approach will be to launch AAVE V3 on Ethereum with conservative LT parameters and incrementally increase them over time rather than deploy with the current LT and LTV parameters.\nA conservative approach to setting LT, LTV for WETH, WBTC\nWBTC and WETH are highly liquid assets that lead the market, and their current LT and LTV levels are high, as they were set during different market conditions. As part of the general approach to start with conservative parameter settings, we recommend starting with conservatively low LT and LTV settings for those assets and increasing them over time. The method we chose to adjust the LT and LTV of non-stable assets is to use the LT, and LTV values of those assets on other V3 deployments, relying on the fact that it is derived from volatility and liquidity. Since the volatility of those assets is similar regardless of chain and liquidity is lower on chains of current V3 deployment, the values of LT and LTV will be conservative.\nThe approach to setting LT and LTV for Stablecoins\nLT, LTV, and Liquidation Penalty should be derived from the volatility of the collateral factor, i.e., the ratio between the loan’s value and the collateral’s value. When stablecoins are used as collateral, we assume that the collateral asset has near-zero volatility, so the LT and LTV should be derived from the borrowed asset’s volatility. The intuition behind this is that if we set the LTs to be the same for all assets borrowed against a specific collateral asset (stablecoin), then highly volatile assets are more likely to fall quickly from a state where the loan is healthy to a state where it is defaulted and not profitable for liquidations.\nAAVE V3 provides a set of risk parameters to control this type of risk but not directly setting different LTs according to the borrowed asset. Therefore, setting LT and LTV for stablecoins will be determined in conjunction with the risk parameters of volatile assets that may be borrowed against them. Future parameter recommendations will derive these values from large-scale Monte Carlo simulations. To unblock the V3 deployment, we recommend starting with LT and LTV of stablecoins that will reflect the current composition of borrowed assets on V2.\nFor the initial parameter setting for V3, we recommend deriving the LT of each stablecoin from those of assets borrowed against it in V2, under the assumption that the transition of funds from AAVE V2 to AAVE V3 will not change the supply/borrow composition significantly. To this end, we have calculated the weighted average of LT of assets borrowed against USDC as collateral and against DAI as collateral separately. This is because it reflects the implied volatility behind loans that are taken against those assets. Once LTs are calculated, we set the LTV of DAI and USDC, keeping the same LTV/LT ratio of those assets on AAVE V2.\nGiven there are n assets Xi...Xn borrowed against a stablecoin S, where the dollar value of the amount borrowed in each asset is USDBorrow(Xi,S), and the LT of the borrowed asset is LT(Xi); we calculate the LT of stablecoin S as:\n\nimage1056×88 7.5 KB\n\nRecommended LT, LTV Values for USDC and DAI\nBased on the methodology described above, we recommend setting the following initial parameters:\n\n\n\n\nAsset\nLT\nLTV\n\n\n\n\nUSDC\n76\n74\n\n\nDAI\n77\n64\n\n\n\n\nProposals for incentivizing and accelerating a V3 transition\nSuccessful migration of users to V3 will require economically aligning incentives for suppliers and borrowers. Since most initial risk parameters are similar in both versions, users are inclined to keep using V2 because it is more liquid. Moreover, launching the protocol with lower LTs for stablecoins will create a state where stablecoin suppliers are incentivized to use AAVE V2 over AAVE V3, as the LTs are higher.\nWe believe there are three main levers the protocol can utilize to expedite the transition:\n\n1. Incrementally Reduce LT and LTVs across active markets in V2\n\nWe’ve previously written about this (here, here, and here) and have initiated this process via a batch of AIPs. Reducing LTs across V2 will ultimately help migrate users to V3, where they can reap the benefits of higher capital efficiency. Since lowering LTs can invoke liquidations, this needs to be done gradually over time, with ample notice for users so that they can wind down positions and, ideally, a clear roadmap communicated from the start.\n\n2. Freezing Markets Post V3 Launch\n\nAfter the CRV attack, a proposal was made to freeze most V2 markets. Chaos Labs, with Llama, proposed an alternative path forward aimed at neutralizing market risk more precisely while keeping healthier markets open. The primary rationale was that effective risk mitigation could be applied while not shutting down Aave for business. However, we support revisiting V2 asset freezing as said assets are activated on V3 with tighter risk controls. This is because we no longer harm user experience and limit optionality as users can opt to deposit and borrow on V3 while only withdrawing from V2.\n\n3. AAVE V3 Rewards to Incentivize Transition from AAVE V2\n\nLooking at previous deployments of new protocol versions of AAVE, we know that providing rewards to protocol users is a powerful and significant tool to encourage a timely migration.\nFor example, let’s examine the deployment of AAVE V3 on Avalanche and Polygon. A sizeable reward program was deployed on Avalance, and in just one week, most funds shifted from V2 to V3. On Polygon, where there was no such reward program, V2 is still more than twice the size of V3, both in terms of market size and total borrows.\nA reward program was also put in place during the transition from AAVE V1 to V2 on Ethereum, and it is essential for the quick transition from V2 to V3. We will follow up with further thoughts on a reward program shortly.\n\nimage1800×1035 137 KB\n\n\nimage1800×1115 64.1 KB\n\n\nV3 Asset Risk Parameter Recommendations\n\nSupply Caps\n\n1. WETH\nThe projected price trajectories of Aave assets when ETH price crashes:\n\nimage1800×1133 193 KB\n\nFigure 1.1 Luna returns  - 2022/05/09 - 2022/05/10, applied to WETH. Prices of other assets are highly correlated, as expected in such a scenario.\nFigures 1.2-1.4 show the ability to liquidate examined asset, WETH, given the price trajectory in figure 2.1. The orange line at the top is the maximum amount that can be liquidated profitably based on the estimated change in liquidity at time t, which we denote as $MaxDump(t)$. The blue line on the same plot is the projection of the liquidated amount in case the supply cap will be the current supply divided by r. This corresponds with the assumption that an increase in TVL towards the cap is distributed similarly to the current state, so we can expect liquidations to grow at the same rate.\nIn some cases, the amount eligible for liquidation cannot be entirely liquidated:\nAmountEligibleForLiquidation(t)/r < MaxDump(t)\nWe get debt(t) = AmountEligibleForLiquidation(t)/r - MaxDump(t), shown in the middle plot. If that amount is not liquidated over 3 minutes, the insolvable amount is bad debt (bottom plot). We wish to find minimal r such that BadDebt(t) = 0 , throughout the entire simulation. We scan over r in the range [0.2:1]. Below we show examples from this range:\n\nimage1800×1229 259 KB\n\nFigure 1.2 - For r=0.2 (which yields a supply cap 5 times the current supply), There is an amount that cannot be liquidated. We assume liquidity will not support the following liquidations.\n\nimage1800×1287 266 KB\n\nFigure 1.3 - For r=0.388, there is still bad debt.\n\nimage1800×1382 293 KB\n\nFigure 1.4 For r=0.435, no bad debt is left. We set the cap to be the current supply of WETH divided by 0.435\n\nCalculating the Cap for WETH:\nr =0.435\nSupplyCap(WETH) = CurrentSupplyV2(WETH)/r = 782K/0.435 = 1.8M\n\nimage1800×1132 184 KB\n\nFigure 1.5 Sweep over r values. The current supply of WETH on AAVE is 782k (12/7/2022). r=0.435 yields a cap of 1.8M WETH - The largest Cap where bad debt is still 0.\n\n\n2. WBTC\nThe projected price trajectories of Aave assets when BTC price crashes:\n\nimage1800×1098 193 KB\n\nFigure 2.1 - Luna returns  - 2022/05/09 - 2022/05/10, applied to WBTC. Prices of other assets are highly correlated, as expected in such a scenario.\nFigures 2.2-2.4 show the ability to liquidate examined assets (WBTC), as explained above, given the price trajectory in figure 2.1.\n\nimage1800×1270 285 KB\n\nFigure 2.2 For r=0.4 (which yields a supply cap that is 2.5 times the current supply), There is an amount that cannot be liquidated. We assume liquidity will not support the following liquidations.\n\nimage1800×1322 278 KB\n\nFigure 2.3 - For r=0.727, there is still bad debt.\n\nimage1800×1287 274 KB\n\nFigure 2.4  Figure 1.4 For r=0.782, no bad debt is left. We set the cap to be the current supply of WETH divided by 0.782.\n\nCalculating the Cap for WBTC:\nWe choose the minimal r value so that no debt is accrued throughout the simulation. That means the liquidity in the examined scenario can support an increase of CurrentSupplyV2(WETH) by a factor of 1/r under the assumption that additional supply will have a similar distribution of health factor levels to that which we see on V2 today. We Calculate the supply cap for the examined asset:\nr =0.782\nSupplyCap(WBTC) = CurrentSupplyV2(WBTC)/r = 34K/0.782 = 43k\n\nimage1800×1316 202 KB\n\nFigure 2.5 Sweep over r values. The current supply of WBTC on AAVE is 34k (12/7/2022). r=0.782 yields a cap of 43K WBTC - The biggest Cap where bad debt is still 0.\n\n\n3. Link\nThe projected price trajectories of Aave assets when Link price crashes:\n\nimage1800×1097 135 KB\n\nFigure 3.1 Luna returns  - 2022/05/09 - 2022/05/10, applied to LINK. Prices of other assets are their historical prices at the time of the crash.\n\nCalculating the Cap for LINK:\nr =0.59\nSupplyCap(LINK) = CurrentSupplyV2(LINK)/r = 14.5M/0.59 = 24M\n\nimage1800×1123 168 KB\n\nFigure 3.2 Sweep over r values. The current supply of LINK on AAVE is 14.5M (12/7/2022). r=0.59 yields a cap of 24M LINK - The biggest Cap where bad debt is still 0.\n\n\n4. AAVE\nThe projected price trajectories of Aave assets when AAVE price crashes:\n\nimage1800×1140 143 KB\n\nFigure 4.1 Luna returns  - 2022/05/09 - 2022/05/10, applied to AAVE. Prices of other assets are their historical prices at the time of the crash.\n\nCalculating the Cap for AAVE:\nWhile AAVE has significant on-chain liquidity, it still has a lower market cap than the above assets (~800M). To account for this, and in line with the guarded approach we recommend for the initial launch, we introduce MarketCapFactor for assets with a market cap smaller than 2 billion USD.\nMarketCapFactor = MarketCap(Token)/LowMarketCapTokenThreshold\nMarketCapFactor is applied to the final cap calculation. We have currently set LowMarketCapTokenThreshold to 2 Billion USD.\nPutting it all together, for AAVE, we compute the following:\nMarketCapFactor = 800/2000 = 0.39\nr =0.435\nSupplyCap(AAVE) = CurrentSupplyV2(AAVE)/r *MarketCapFactor = 2.07M/0.435*0.39  = 1.85M\n\nimage1800×1221 199 KB\n\nFigure 4.2 Sweep over r values. The current supply of AAVE Token on Aave is 2M (12/7/2022). r=0.435 yields a cap of 24M LINK - The biggest Cap where bad debt is still 0.\n\n\nE-mode Configuration\nWe recommend the configuration of the following Ethereum-correlated e-mode configuration:\n\n\n\n\nCategory\nAssets included\nLT\nLTV\nLiquidation Bonus\n\n\n\n\nEthereum Correlated\nWETH, wstETH\n93%\n90%\n1%\n\n\n\n\nAnalysis\n\nIf liquidated immediately, the entire cap of 200K stETH has a price impact of 5% on the average stETH/ETH price (0.988). In the worst case, where all positions are fully leveraged, an LT of 93% would guarantee an over-collateralization high enough to enable liquidations. LTV is set to 90%, a slightly higher margin than staked assets on other chains, as historically, we have seen daily price changes of 2.22%. This protects retail users and still allows 10x leverage. Under the proposed cap, there is a very low risk of triggering stETH liquidations on v2.\n\nUntitled (10)1920×1128 72.1 KB\n\n\nUntitled (11)1920×1185 51.7 KB\n\nThe Max Abs price change observed historically is 2.15%. LT - LTV margin is derived from absorbing such volatility.\n\nPrice Impact When Price = AveragePrice(0.988)\n\nPrice impact was calculated using liquidity conditions in the Curve STETH/ETH pool for average price levels.\n\n\n\n\nSTETH In\nETH out\nPrice Impact\n\n\n\n\n10k\n9880\n0.0%\n\n\n50k\n49200\n0.49%\n\n\n100k\n97623\n1.2%\n\n\n150k\n144661\n2.67%\n\n\n200K\n188k\n5.03%\n\n\n\nAn LT of 93% ensures over-collateralization that allows liquidation of the entire amount.\n\nPrice Impact When Price = AllTimeLow(0.934)\n\nPrice impact was calculated using a liquidity snapshot of the Curve STETH/ETH pool on June 18, 2022\n\n\n\n\nSTETH In\nETH out\nPrice Impact\n\n\n\n\n10k\n9291\n0.54%\n\n\n50k\n44808\n4.7%\n\n\n100k\n80870\n19.57%\n\n\n150k\n99646\n29%\n\n\n200K\n106k\n42%\n\n\n\nAs shown in the table above, the high price impact at low liquidity conditions could cause v2 position liquidations that will trigger further cascading liquidations. With stETH supply on Aave v2 of over $1B this is a significant risk to the protocol.\nTo mitigate this risk, we recommend a relatively low borrow cap of 3,000 for stETH. Dumping this amount has a price impact of ~0.11, which allows a buffer for profitable liquidations, given the 1% liquidation bonus.\n\nAave V2 Liquidation Levels\n\nUntitled (12)1920×980 55.6 KB\n\nWe see a major account (health=1.18), that would fall under health = 1 if the price drops to 0.81 (If not rebalanced) - https://debank.com/profile/0x94269a09c5fcbd5e88f9df13741997bc11735a9c. Liquidation of the entire Supply cap should not bring us to those price levels.\n\n\nNext Steps\nThe deployment of V3 on Ethereum must be considered holistically, accounting for the current state of pools on V2. Supply caps are a crucial piece of risk management in V3 but will only be impactful once the usage of the respective asset in V2 is minimized.\nAssuming the rationality of borrowers and suppliers, the incentives must be aligned between the protocol and users to usher migration and deployment of new and existing capital to V3. While increasing capital efficiency (i.e., increased Liquidation Thresholds) on V3 immediately would attract new deposits and borrows, it also introduces increased risk, which we advise against during this transition phase. Instead, we propose an incremental plan involving reducing LT and LTVs incrementally on V2, as proposed here (AIP-136, AIP-137), while proposing attractive Interest Rate curves for V3 deployments, thus aligning economic incentives.", "reads": 95, "readers_count": 94, "score": 1234.0, "word_count": 4340, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-for-aave-v3-optimism-2022-12-29", "topic_id": 11213, "title": "[ARC]: Risk Parameter Updates for Aave V3 Optimism 2022-12-29", "posts_count": 8, "views": 3210, "like_count": 22, "author_username": "jmo", "created": "2022-12-29T22:00:13.773Z", "text": "\nSimple Summary\nA proposal to adjust one (1) total risk parameter - Supply Cap - across one (1) Aave V3 Optimism asset.\nThis should reduce risk in the protocol, though it could limit the growth of AAVE token deposits on Optimism.\n\nAbstract\nThere is currently not a supply cap for the AAVE asset on Aave’s v3 deployment on Optimism. We are going to set this quickly and provide a deeper analysis of all of the current supply caps next week. We believe these could be more conservative, but setting a supply cap for AAVE sooner rather than later will reduce the chance of new positions creating a dangerous spike in VaR.\nBeyond this, the cap greatly reduces the viability of market downturn and price manipulation attacks involving the AAVE token.\n\nMotivation\nAny market without supply caps could experience an outsize risk by someone opening a very large position quickly. Maintaining supply caps that ensure that one user cannot subject the protocol to outsize risk is a key part of risk management for Aave v3 markets.\nGauntlet’s parameter recommendations are driven by an optimization function that balances 3 core metrics: insolvencies, liquidations, and borrow usage. This change was driven by analysis focusing on insolvency, as estimated by our simulations. Our agent-based simulations use a wide array of varied input data that changes on a daily basis (including but not limited to asset volatility, asset correlation, asset collateral usage, DEX / CEX liquidity, trading volume, expected market impact of trades, and liquidator behavior). The input metrics we show below can help understand why some of the param recs have been made but should not be taken as the only reason for recommendation. The individual collateral pages on the Gauntlet Risk Dashboard cover other key statistics and outputs from our simulations that can help with understanding interesting inputs and results related to our simulations.\nFor more details, please see Gauntlet’s Parameter Recommendation Methodology and Gauntlet’s Model Methodology.\n\nSupporting Data on Aave V3 Optimism\nTop 10 borrowers’ aggregate positions\n\nTop 10 borrowers’ entire supply\n\nTop 10 borrowers’ entire borrows\n\n\nAave V3 Optimism Parameter Changes Specification\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\nCurrent AAVE Supply\n\n\n\n\nAAVE Supply Cap\nNone\n100,000\n87,980\n\n\n\n\nWhy would we limit the AAVE supply?\nThere’s limited AAVE liquidity on Optimism on Uniswap, with $121k AAVE/ETH being the largest AAVE pool. The current AAVE supply on Optimism Aave v3 is $4.7M, so a liquidator will not be able to arbitrage a large AAVE position solely on Optimism DEXs. However, the liquidation bonus at 10% is high enough that we anticipate liquidators should be willing to hold or bridge AAVE. As the markets on Optimism grow, AAVE will rely more and more on the asset bridge and available cross-chain liquidity. This is why we mentioned that all of these caps could be more conservative, and look forward to sharing more info there next week. If the Aave community wants to take a conservative stance on risk, we should consider lowering these across the board.\n\nAave Token Balances Since Oct 30th\n\n\n\n\nNext Steps\n\nInitiate Snapshot vote immediately since the community has recently weighed in on changes of this nature.\nTargeting an AIP on [2023-01-02]\n\n\nQuick Links\nAnalytics Dashboard\nRisk Dashboard\nAave Arc Risk Dashboard\nGauntlet Parameter Recommendation Methodology\nGauntlet Model Methodology\n\nNotes\nThese parameter updates are a continuation of Gauntlet’s regular parameter recommendations. Our simulation engine has ingested the latest market data to recalibrate parameters for the Aave protocol. The community has aligned on a Risk Off Framework regarding lowering liquidation thresholds.\nBy approving this proposal, you agree that any services provided by Gauntlet shall be governed by the terms of service available at gauntlet.network/tos.", "reads": 67, "readers_count": 66, "score": 1728.4, "word_count": 2469, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-v3-borrow-cap-recommendations-fast-track-2022-12-05", "topic_id": 10927, "title": "[ARC] V3 Borrow Cap Recommendations (Fast-track) (2022-12-05)", "posts_count": 8, "views": 2788, "like_count": 19, "author_username": "ChaosLabs", "created": "2022-12-05T19:32:53.585Z", "text": "\nSimple Summary\n\nA proposal to add Borrow Caps for seven (7) uncapped assets and amend the Borrow Cap of nine (9) assets across four (4) chains in v3.\n\nMotivation\nIn continuation of the successful vote on V3 Supply Cap Recommendations for Uncapped Assets, Chaos Labs proposes to add Borrow Caps to V3 assets, using the AAVE V3 Borrow Caps Methodology.\nThis proposal follows the fast-track process for increasing borrow caps as outlined here.\nThis ARC will focus on assets that are currently not utilizing e-mode.\n\nRecommendations\n\nAvalanche\n\nScreen Shot 2022-12-05 at 4.13.31 PM2206×330 121 KB\n\n\nArbitrum\n\nScreen Shot 2022-12-05 at 4.13.45 PM2212×332 117 KB\n\n\nOptimism\n\nScreen Shot 2022-12-05 at 4.13.57 PM2210×330 115 KB\n\n\nPolygon\n\nScreen Shot 2022-12-05 at 4.14.35 PM1920×532 66.2 KB\n\n\nNext Steps\nIn the next 24 hours, we will share a Snapshot for a community vote.\nAfter setting the initial caps, Chaos Labs will continuously monitor and examine the markets and provide recommendations given significant changes in the supply and borrowing rates of different assets.", "reads": 61, "readers_count": 60, "score": 527.2, "word_count": 531, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-for-aave-v2-ethereum-lts-and-ltvs-for-long-tail-assets-2022-12-04", "topic_id": 10926, "title": "[ARC] - Risk Parameter Updates for Aave v2 Ethereum - LTs and LTVs for Long Tail Assets (2022.12.04)", "posts_count": 11, "views": 2851, "like_count": 15, "author_username": "ChaosLabs", "created": "2022-12-05T19:20:23.438Z", "text": "Simple Summary\nA proposal to adjust eight (8) total risk parameters, including Liquidation Threshold (LT) and Loan-To-Value (LTV), for four (4) assets on Aave V2 Ethereum.\nAbstract\nFollowing recent market events, the AAVE community has decided to reduce the risk profile across many higher volatile assets by disabling borrow or freezing across v2 markets (AIP-121, AIP-124, and AIP-125)\nAfter mitigating the immediate risk to the protocol with the above AIPs, Chaos Labs is exploring the impact and trade-offs of decreasing the Liquidation Thresholds and LTVs of long-tail assets on Ethereum v2 (ENS, MKR, SNX, and CRV).\nThis proposal is the second in a series of proposals intended to reduce the viability of different attack vectors on v2 assets.\nMotivation\nCapital efficiency reductions on v2 assets will further mitigate attack vectors, in part by increasing the capital required to wage a price manipulation attack on Aave. In addition, these changes will act as an effective motivation to shift usage to v3, where users can enjoy the benefits of E-mode with enhanced risk techniques and mitigation methodologies.\nAs Liquidation Threshold reductions may lead to user accounts being eligible for liquidations upon their approval, we want to clarify the full implications to the community at each step. To best minimize this impact, we suggest reaching the desired settings by a series of incremental decreases, following the Risk-Off Framework previously approved by the community, with a reduction of up to 3% in any given AIP. In an attempt to avoid liquidations, Chaos Labs will communicate the planned amendments 7 days before their on-chain execution via all available avenues (Twitter, forums, Nansen Connect, and Blockscan Chat).\nIn the graphs below,  we share data to quantify and visualize the effect of the recommended reductions on protocol users for community discussion.\n\n Mainnet snapshot captured on December 4th, 2022, 16:30 GMT\n\n$CRV\n\n$MKR\n\n$SNX\n\n$ENS\n\nZero (0) liquidations for up to an 8% reduction.\n\nJoint Reduction of $MKR, $CRV, $SNX and $ENS\n\nReducing LTs jointly for the above long tail assets by 3% results in less than 6K USD worth of liquidations\n\n\nJoint Reductions with $USDC and $DAI\n\nThe assets can also be reduced jointly with the suggested USDC, DAI change without causing additional liquidations.\n\nRecommendation\n", "reads": 64, "readers_count": 63, "score": 517.8, "word_count": 1059, "category_id": 7}, {"url": "https://governance.aave.com//t/chaos-labs-aave-v3-supply-cap-methodology", "topic_id": 11141, "title": "Chaos Labs - Aave V3 Supply Cap Methodology", "posts_count": 1, "views": 1639, "like_count": 9, "author_username": "ChaosLabs", "created": "2022-12-22T02:54:11.806Z", "text": "Overview\nOur goal is to mitigate protocol risk by introducing supply caps for all assets on Aave v3 deployments. Our initial batch of recommendations for uncapped assets was conservative, with the primary objective of getting reasonable supply caps deployed in production. This document outlines the Chaos v0 methodology for determining supply caps. The methodology adheres to the guideline suggested by @eboado that when listing a new asset, “the caps are a perfect generalized constraint to cover almost any wide problem for the pool.”\nAlthough the assets discussed have been active historically, we believe that recent market events and the short history of supply caps mandate approaching this as the initial supply cap recommendation methodology. The goal is to start with prudent recommendations and incrementally increasing caps as DEX liquidity increases and market volatility stabilizes.\nMotivation\n\nThis is an initial iteration on supply caps, and we welcome community input and feedback.\n\nAre there additional risk vectors, metrics, or data that the community would like to consider?\n\n\nAs this document and methodology are solidified, it can serve as a guide to list new assets or increase caps for currently listed assets. Transparently sharing the methodology should allow interested parties to source the data and bring it forward as they make various ARCs more pertinent to them.\n\n\n Note: This is the first iteration of the Supply Cap Methodology and aims to promptly provide a solution for the current state of assets across multiple deployments, given the current market instability. Chaos will be iterating over this methodology over the coming weeks, and it is subject to change.\n\nThe General Approach\nTo set the Supply Cap for an asset, we try to answer the question: what is the maximum token value that can be liquidated profitably under extreme scenarios, i.e., when significantly large amounts are being liquidated over a short period? We examine whether the current supply of a given token in Aave V3 eligible for liquidation can be liquidated profitably. We can conclude that if this holds, incurring bad debt is unlikely when assuming healthy and rational liquidator activity. We aim to create a heuristic-based, closed-form formula for answering this question based on current market liquidity while also considering volatility and historical liquidation throughput. Additionally, we want to assess the overall qualitative risk of each asset. Empirically, the Aave Asset Risk Score correlates well with DEX liquidity.\n\nAAVE Risk Qualification Criterion\nAssumptions for Extreme Scenarios\nTo estimate the supply cap for a given asset, we assume a token crash that will drive extreme liquidations. We make several assumptions:\n\nAll supply serves as collateral.\n\nThis is a very defensive assumption that accounts for a worst-case scenario, and we believe it could be relaxed for future iterations\n\n\nFuture crashes are likely to resemble previous crashes in terms of price trajectory\nFuture crashes are likely to resemble previous crashes in terms of liquidity; that is, liquidity provisioning in DEXes will resemble the liquidity in DEXes across previous crashes\nThe distribution of the health factor of accounts that supply this asset will remain similar as the supply grows\n\nSupply Cap Methodology\n1. Reference Price Crashes\n\nFirst, we select $n$ historic price crash trajectories {X1…Xn}\nWe denote the token that crashed as R(Xi)\nThe crashed tokens may differ from the tokens for which we wish to determine supply caps. Using the crash pattern as a common baseline, we adjust liquidity according to the specific token; consider these as the Reference Tokens.\n\n\n2. Observe DEX Liquidity During Crashes\n\nWe then observe token DEX liquidity changes in pools throughout the price crash. Specifically, we’re interested in evaluating the amount that can be sold within a given range of slippage at each point in time. We denote that amount at block t as Amt(t, Slippage), counting the first block of the crash as t=0. Essentially, Amt(t, liquidationPenalty) is the maximum amount of the token that can be sold to the pool by a liquidator at block t, with a constraint that ensures that realized slippage is smaller than the liquidation bonus for the examined asset.\n\n\nIllustration of the process of recording DEX liquidity levels throughout the price crash (Please note,  the numbers used are merely for demonstration purposes)\n3. Extrapolate the Maximum amount to be liquidated from DEX Liquidity\nAfter obtaining the price trajectories of crashes and the corresponding DEX liquidity, we perform a sequence of operations individually for each token to determine its supply cap. We refer to it as the examined token.\nThe sequence of operations we perform for each examined token Token over a price crash scenario of reference token R(Xi) is as follows:\n\n\nDenote the current supply of the token as Sup(Token)\n\n\nDenote the AAVE Liquidation Penalty of each token as Pen(Token)\n\n\n*We derive the liquidity through a correlation between the liquidity amount in DEXes of the reference token, R(X_i), and the examined token at the beginning of the simulation (before the crash) for each slippage %. This is the LiquidityCorrelationFactor. Then we apply this ratio to the liquidity of the reference token at block t.\n\n\nFor each price crash scenario, extrapolate the available liquidity of the examined token across DEXes with slippage equal to Pen(Xi) at block t and denote it as\nAmt(Token, t, Pen(Token)) = Amt(R(Xi),t, Pen(Token) * LiquidityCorrelationFactor(R(Xi), Token, Pen(Token))\nThis is the maximum amount that can be liquidated in this block profitably for a liquidator.\n\n\nRun n simulations of the price trajectories of the examined token with each reference token and for each liquidation record for each block t where liquidation is triggered, the ratio between liquidation amount and available liquidity\nr(Token, t)=LiquidatedAmount(t)/ Amt(t, Pen(Token))\n\n\n4. Determine the new supply cap\nDenote r_m = Max(r(Token(Xi),t))\nFinally, set the new supply cap for each token to be equal to Current Supply(Token) / r_m\nThis is because r_m is the maximum ratio between the liquidated amount with the current supply. By dividing the current supply by the maximum ratio that may be liquidated per block, we achieve the maximum amount that could be liquidated in total and set it as the supply cap for this token.\nPrice Trajectories of other assets\nWhen we simulate the impact of an extreme price movement scenario on an asset, we must take into consideration the impact it may have on other assets. Usually, when the price of a significant asset plummets, we see the impact on the prices of other assets. The LUNA crash is a good example of this. When examining liquidations, there is significance to the prices of other assets - either those borrowed by suppliers of the examined asset or those that serve as collateral together with the examined asset. We are currently using two behaviors of other assets’ price trajectories:\n\nThe first is for significant assets with a market cap larger than $1B. In this case, we assume other assets’ prices will move similarly to how they moved in the referenced price crash.\nThe second is for market leaders, namely ETH and BTC, where a significant crash of either is likely to cause an overall crash of asset prices. When simulating these scenarios, we project other assets’ prices according to their correlation with ETH/BTC.\n\nNote: We are currently utilizing this methodology for medium-large cap assets. Analysis for low-cap assets will be added in upcoming iterations.\nNext Steps\nV0 of the Chaos Supply Cap Methodology is conservative by design. When examining future increases in supply caps, there are two primary relaxations we can explore:\n\nThe assumption that all supply is used as collateral\nWhen using r_m, setting the cap as suggested above will likely ensure all liquidatable collateral can be liquidated under the extreme scenario examined. Taking a less conservative approach, we may select r < r_m, considering the risk of bad debt in a worst-case scenario, e.g., if we can tolerate a bad debt of $100K USD, we can reduce r as long as the calculated bad debt is under that limit.\nThe crashed tokens may differ from the tokens we wish to determine supply caps for. Using the crash pattern as a common baseline, we adjust liquidity according to the specific token; consider these as the Reference Tokens.\n\nIn future proposals, we will provide the community with recommendations based on the above methodology and risk analysis. In addition, we aim to provide data on alternatives with different risk-reward balances for the community to vote on, given an ever changing risk appetite.\nReal-life Examples\nBelow are initial recommendations which we have calculated using this methodology for assets in the Polygon Market. These recommendations were all made with the assumption of zero bad debt tolerance. As mentioned in the ‘next steps’ section above, this assumptions can be relaxed in future proposals given a community preference for different risk-reward balance.\n1. Polygon Market / WMATIC\nPrice Trajectories of all assets during the MATIC crash\n\nMATIC Liquidated Amount vs. Liquidity in DEX Pools\nThe top chart shows the liquidity in DEX pools and the eligible amount for liquidation and the bottom chart shows the ratio between the amount eligible for liquidation and the maximum amount of MATIC that can be sold in DEXes with slippage below the liquidation penalty (r)\nLiquidatable Amount - the amount of MATIC eligible for liquidation throughout the simulation\nMax Dump Under Penalty - the maximum amount of MATIC that can be sold in DEXes with slippage below the liquidation penalty\n\nThe ratio between amounts eligible for liquidation and the liquidity in pools\nThe chart below shows a histogram of the ratio between the amount eligible for liquidation and the maximum amount of MATIC that can be sold in DEXes with slippage below the liquidation penalty (r).\n\nSupply Cap Recommendation\nThe current supply cap is displayed for reference only\n\n\n\n\nr\nRecommended Supply Cap\nCurrent Supply Cap\nEstimated Bad Debt\n\n\n\n\n0.36\n47M\n32.88M\n0\n\n\n\n2. Polygon Market / LINK\nPrice Trajectories of all assets during the LINK crash\n\nLINK Liquidated Amount vs. Liquidity in DEX Pools\nThe top chart shows the liquidity in DEX pools and the eligible amount for liquidation and the bottom chart shows the ratio between the amount eligible for liquidation and the maximum amount of LINK that can be sold in DEXes with slippage below the liquidation penalty (r)\nLiquidatable Amount - the amount of LINK eligible for liquidation throughout the simulation\nMax Dump Under Penalty - the maximum amount of LINK that can be sold in DEXes with slippage below the liquidation penalty\n\nThe ratio between amounts eligible for liquidation and the liquidity in pools\nThe chart below shows a histogram of the ratio between the amount eligible for liquidation and the maximum amount of LINK that can be sold in DEXes with slippage below the liquidation penalty (r).\n\nSupply Cap Recommendation\nThe current supply cap is displayed for reference only\n\n\n\n\nr\nRecommended Supply Cap\nCurrent Supply Cap\nEstimated Bad Debt\n\n\n\n\n0.37\n400k\n297,640\n0\n\n\n\nFeedback\nWe have already been contacted by community members and token teams looking to understand what levers are important for supply (and borrow) caps to democratize the process for the proposition of changes. We encourage the community to converge around a standard to determine these parameters so that these groups can have more transparency moving forward.\nWe welcome all feedback on the proposed methodology and ideas on how to enhance it.", "reads": 52, "readers_count": 51, "score": 360.4, "word_count": 1995, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-recommendations-for-aave-v2-polygon-2022-11-25", "topic_id": 10826, "title": "[ARC] Risk Parameter Recommendations for Aave V2 Polygon (2022-11-25)", "posts_count": 6, "views": 1976, "like_count": 21, "author_username": "OriN", "created": "2022-11-25T16:57:52.562Z", "text": "\nSimple Summary\n\nIn response to recent market events and the resulting discussion on the Aave governance forum (link) regarding Aave community risk appetite, Llama and Chaos Labs propose to make a series of parameter changes to the Polygon Aave v2 Liquidity Pool.\n\nAbstract\n\nThis proposal presents an alternative pathway forward to AIP-124. The community can elect to Disable Borrowing whilst retaining the ability to Deposit assets across some of the reserves rather than Freezing as outlined in AIP-124.\nWe specifically recommend freezing for GHST, BAL, and Sushi, while only pausing borrowing on other markets as a risk-off approach because the community can utilize the asset on the Polygon v3 deployment with enhanced risk tooling, such as supply and borrow caps.\nThis proposal is a collaborative effort between Llama and Chaos Labs and reflects the community’s governance forum discussion.\n\nMotivation\n\nIn response to recent market events and the continued contraction of liquidity across markets, this proposal seeks to reduce the risk profile across many of the higher volatile assets. AIP-124 presents an opportunity to Freeze many Reserves, whereas this proposal intends to Disable Borrowing where possible, whilst retaining the ability to deposit assets.\n\nSpecification\n\nThe following risk parameter proposal is presented below:\n\n\n\n\nAsset\nStatus\nGauntlet AIP-124\nProposed Action\n\n\n\n\nBAL\nBorrowing Enabled,Collateral Enabled\nFreeze\nFreeze\n\n\nCRV\nBorrowing Enabled, Collateral Enabled\nFreeze\nDisable Borrow\n\n\nAavegotchi(GHST)\nCollateral Enabled, Borrowing Disabled\nFreeze\nFreeze\n\n\nLINK\nBorrowing Enabled, Collateral Enabled\nFreeze\nDisable Borrow\n\n\nSUSHI\nBorrowing Enabled, Collateral Enabled\nFreeze\nFreeze\n\n\nDPI\nBorrowing Enabled, Collateral Enabled\nFreeze\nDisable Borrow\n\n\n\nWe will publish an AIP with these recommendations shortly.", "reads": 71, "readers_count": 70, "score": 554.2, "word_count": 760, "category_id": 7}, {"url": "https://governance.aave.com//t/aave-v3-is-now-live-on-riskdao-s-bad-debt-dashboard", "topic_id": 10620, "title": "Aave v3 is now live on RiskDAO’s Bad Debt Dashboard", "posts_count": 2, "views": 2037, "like_count": 5, "author_username": "nonstopTheo", "created": "2022-11-11T11:00:36.179Z", "text": "\nAave v3 is now live on RiskDAO’s Bad Debt Dashboard\nThis forum post is published by nonstopTheo on behalf of RiskDAO.org\n\nTL;DR:\n\n\nAave v3 bad debt data can now be tracked in real time, on any of the Aave v3 markets (Arbitrum, Avalanche, Optimism, Polygon)\nThe integration has been funded by a grant from Aave Grants DAO to RiskDAO (riskdao.org)\nThe data is useful to Aave users, contributors, community and tokenholders alike: Bad debt data is surfaced and easily displayed\nThe code is fully open source and available on github (both frontend and backend)\nOnce v3 is live on Ethereum, the data will be supported in the dashboard as well\nAave will be the only major lending platform who features and monitors its bad debt across all of its multichain deployments\n\n\nOverview:\nIn an attempt to bring transparency to DeFi lending protocols, RiskDAO created the bad debt dashboard which displays the insolvency level of lending protocols. Bad debt stems from borrow positions that have not been liquidated. Too much bad debt is a red flag as it indicates poor risk management standards. Most lending protocols do not easily display this data point which leaves users in the dark.\nTotal bad debt in Aave v3 is a relatively small amount of $16.1k (as of 10 Nov ‘22). The dashboard provides a chain-by-chain breakdown to highlight where bad debt accrues.\nHistorically, Aave bad debt has been small and mostly due to dust accounts: The gas cost in liquidating these positions is higher than the payoff. Hence, liquidators struggle to make money from liquidating these tiny insolvent accounts and no action is taken.\nThe dashboard will allow anyone to access and track changes in bad debt. There is no need to wait for official reports or disclosures. This is a step change in bringing transparency to DeFi lending markets and highlights Aave’s commitment to risk management & disclosure standards.\n\nDashboard highlights:\nThe Aave v3 dashboard can be accessed at bad-debt.riskdao.org.\n\nUsers can access dashboards for each individual chain deployment.\n\nFrom there, users can see details for all insolvent accounts by clicking on the link on the right hand side.\n\nResources & Links:\nBad debt dashboard: bad-debt.riskdao.org\nAave v3 bad debt dashboard (direct link): Risk DAO | bad-bebt dashboard\nBad debt source code via Github:\nFrontend: Add Aave V3 dashboard by alfulinku · Pull Request #18 · Risk-DAO/bad-debt-frontend · GitHub\nBackend: merge/aave3-main by shmuel-web · Pull Request #29 · Risk-DAO/bad-debt-leaderboard · GitHub", "reads": 52, "readers_count": 51, "score": 5545.4, "word_count": 464, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-v3-supply-cap-recommendations-for-uncapped-assets-fast-track", "topic_id": 10750, "title": "[ARC] V3 Supply Cap Recommendations for Uncapped Assets (Fast-track)", "posts_count": 10, "views": 3243, "like_count": 26, "author_username": "OriN", "created": "2022-11-22T20:24:36.016Z", "text": "The objective of this proposal by Chaos Labs is to recommend supply caps for v3 assets that are currently uncapped. This proposal follows the fast-track process for increasing supply caps as outlined here. It’s important to note that these are initial supply caps for these assets and will be iterated upon. The recommendations for every asset on every chain take into consideration:\n\nAsset Market Cap\nAsset Counter Party Risk\nAsset Volume\nAsset Liquidity (DEX and CEX based)\nHistorical Liquidations in times of high volatility\n\n\nUncapped Assets\n\n\nAvalanche\n\n\n\n\nAsset\nCurrent Supply\nCap Recommendation\nCurrent Usage / Recommendation\nLiquidation Threshold\nLiquidation Penalty\nDEX Liquidity*\n\n\n\n\nWETH.e\n27.34K ETH\n113K ETH\n24%\n82.5%\n5%\n~$7M pool\n\n\n\nWBTC.e\n1.8K WBTC.e\n5233 BTC\n34%\n75%\n6.25%\n$490K pool\n\n\n\nLINK.e\n317K LINK\n353K LINK\n90%\n65%\n7.5%\n$305K pool\n\n\n\nAAVE.e\n4.14K AAVE\n4.5K AAVE\n92%\n71.3%\n7.5%\n$238K pool\n\n\n\nWAVAX\n2.8M WAVAX\n13.1M WAVAX\n21%\n70%\n10%\n~$25M AVAX-USDC WETH.e-AVAX USDC.e-AVAX BTC.b-AVAX USDT.e-AVAX\n\n\n\n\nOptimism\n\n\n\n\nAsset\nCurrent Supply\nCap Recommendation\nCurrent Usage / Recommendation\nLiquidation Threshold\nLiquidation Penalty\nDEX Liquidity*\n\n\n\n\nLINK\n47.3K LINK\n258K LINK\n18.3%\n75%\n10%\n$110K pool\n\n\n\nWETH\n32.3K WETH\n35.9K WETH\n89.97%\n82.5%\n5%\n$5.35M pool\n\n\n\nWBTC\n1K WBTC\n1.1K WBTC\n90%\n75%\n10%\n$2.33M pool\n\n\n\n\nArbitrum\n\n\n\n\nAsset\nSupply\nCap Recommendation\nCurrent Usage / Recommendation\nLiquidation Threshold\nLiquidation Penalty\nDEX Liquidity*\n\n\n\n\nWBTC\n500 WBTC\n2.1K WBTC\n23.8%\n75%\n10%\n$3.39M pool\n\n\n\nWETH\n12.6K WETH\n20.3K WETH\n63%\n82.5%\n5%\n$10M pool\n\n\n\nAAVE\n2.11K AAVE\n2.5K AAVE\n84.4%\n65%\n10%\nN/A\n\n\nLINK\n313.7K LINK\n350K LINK\n89.62%\n75%\n10%\n$967K pool\n\n\n\n\n*TVL of the deepest pool, captured on 11/22/22", "reads": 90, "readers_count": 89, "score": 758.0, "word_count": 1448, "category_id": 7}, {"url": "https://governance.aave.com//t/the-risk-of-wbtcs-underlying-bitcoin-being-claimed-in-bankruptcy-proceedings", "topic_id": 10768, "title": "The risk of WBTC's underlying Bitcoin being claimed in Bankruptcy Proceedings", "posts_count": 1, "views": 1697, "like_count": 2, "author_username": "rp_blockfer", "created": "2022-11-23T01:34:47.015Z", "text": "Is anyone having any concerns about holding WBTC after the FTX and Alameda blow-up? The Binance BTC/WBTC peg has not returned since Nov 8th when the saga first began.\nMy main concern here is that Alameda was the top merchant to mint/burn WBTC. If there’s a valid legal argument that Alameda used stolen BTC from FTX users to mint WBTC then the courts can tie up the underlying BTC that was used to mint WBTC.\nBitgo is the custodian of WBTC and is set up as a New York Trust. I am confident in this legal structure that the BTC is there and it was not used in lending liabilities.\nThe main risk here is that Alameda was using FTX users’ Bitcoin deposits to mint WBTC. Then during the Bankruptcy arguments, there’s a good case against going after the underlying BTC in the WBTC vaults to recover Bitcoin for FTX users.\nWBTC Merchants\n  \n      \n\n      dune.com\n  \n\n  \n    \n\nMessari Dashboard: wBTC Supply\n\n  Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nBTC/WBTC PEG\nhttps://www.binance.com/en/trade/WBTC_BTC?theme=dark&type=spot\nWBTC BURN/MINT ORDER BOOK\n  \n      \n\n      Wrapped Bitcoin\n  \n\n  \n    \n\nWBTC Wrapped Bitcoin an ERC20 token backed 1:1 with Bitcoin\n\n  Wrapped Bitcoin ( WBTC ) delivers the power of an ERC20 token! The first ERC20 token backed 1:1 with Bitcoin\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n", "reads": 32, "readers_count": 31, "score": 481.4, "word_count": 188, "category_id": 7}, {"url": "https://governance.aave.com//t/aave-v3-top-at-risk-borrower-scores", "topic_id": 10655, "title": "Aave V3 Top At-Risk Borrower Scores", "posts_count": 2, "views": 1622, "like_count": 1, "author_username": "ccb_roci", "created": "2022-11-14T17:37:46.584Z", "text": "ABSTRACT\nThe analysis is meant to build atop of Chaos Lab’s existing analytics regarding V3 borrowers ‘at-risk’ of liquidation. This additive analysis further drills into a borrower’s riskiness based on their credit score which is the likelihood of default (or liquidation in case of Aave).\nPremise: Borrowers with strong credit scores are risk-minded, thus unlikely to let their loans be liquidated, even with unexpected market volatility.\nMOTIVATION\nUnderstanding liquidation risk from a user level (micro) and protocol level (macro), Aave can better assess true insolvency risk to the protocol.\nANALYSIS\nAave V3 - Arbitrum - Borrower 0x004c718103fed0bf75f2a02c3da7ea2332137fac\nPer RociFi’s credit risk model, this address is rated a 9 out of 10, i.e. a weaker credit score.\nBorrower 0x004c718103fed0bf75f2a02c3da7ea2332137fac historical activity across all of DeFi – not just Aave – include:\n\n4 total borrows, all-time\nWallet age of 216 days\n$300K in total debt repaid, all-time\nZero liquidations, all-time\n$902K debt outstanding to Aave\n\nThe borrower’s weaker credit score coupled with current health factor of 1.20 indicate heightened risk. Given the relatively small amount of debt coupled with liquid collateral assets of WBTC and WETH, the overall risk to Aave does not seem cause for concern at the moment.\nAave V3 - Avalanche - Borrower 0xcc5b1fef95f632c4a25f95ad88bfe12f928d04cb\nThis address is rated a 7 out of 10, i.e. a weaker credit score.\n\n11 total borrows, all-time\nWallet age of 91 days\n$3.1M in total debt repaid, all-time\nZero liquidations, all-time\n$4.3M debt outstanding to Aave\n\nThe borrower’s weaker credit score coupled with current health factor of 1.26 suggest moderate risk given higher health factor.\nAave V3 - Optimism - Borrower 0xd075ca0b40d67db2570ae23936baeb64449dc8ba\nThis address is rated a 5 out of 10, i.e. a good credit score.\n\n47 total borrows, all-time\nWallet age of 211 days\n$9.7M in total debt repaid, all-time\nZero liquidations, all-time\n$1.03M debt outstanding to Aave\n\nThe borrower’s good credit score coupled with current health factor of 1.24 suggest less risk.\nAave V3 - Polygon - Borrower 0x61a8d768de76361e2538f1d4f490118d881da0cc\nThis address is rated a 4 out of 10, i.e. a good credit score.\n\n14 total borrows, all-time\nWallet age of 235 days\n$912K in total debt repaid, all-time\nZero liquidations, all-time\n$439K debt outstanding to Aave\n\nThe borrower’s credit score is good but the current health factor of 1.12 elevates riskiness. Given the relatively small amount of debt coupled with liquid collateral assets of SUSHI and MATIC, the overall risk to Aave does not seem cause for concern at the moment.", "reads": 45, "readers_count": 44, "score": 2424.0, "word_count": 747, "category_id": 7}, {"url": "https://governance.aave.com//t/a-game-theoretical-analysis-of-potential-avax-usd-price-manipulation-attack-on-aave", "topic_id": 10196, "title": "A game-theoretical analysis of potential AVAX-USD price manipulation attack on AAVE", "posts_count": 4, "views": 1973, "like_count": 10, "author_username": "nonstopTheo", "created": "2022-10-06T16:28:18.278Z", "text": "\nA game-theoretical analysis of potential AVAX-USD price manipulation attack on AAVE\nThis is Theo from the Risk DAO, a service DAO launched by B.Protocol and 1kx research arm ( not associated with the risk dao initiative of Aave).\nA recent manipulation of the AVAX-USD price pair resulted in significant losses for liquidity providers on GMX, a perpetual swap DEX on Arbitrum.\nIn this post, we’ll examine what happened and how this attack vector can be replayed on the Aave protocol. Whilst also relevant to other lending protocols the sheer size of Aave’s borrow markets represent an attractive target as even small percentage gains could mean substantial USD profits for the attacker.\nTL;DR:\n\nThe attack scenario looks like the following: An attacker can artificially inflate the AVAX price, deposit the token into Aave and borrow against this inflated collateral value. A similar attack played out for the Venus Protocol in May 2021 which bankrupted the protocol.\nLiquidity and LTV are the key profitability drivers: Lower exchange liquidity allows the attacker to manipulate the price much easier (i.e. less cost required), whilst a higher LTV on Aave allows more borrow power (i.e. higher cash proceeds).\nWe show how different liquidity curves may make price manipulation profitable. We look at super-linear, linear and sublinear slippage functions.\nWe conclude that in this simplistic framework the attack is not profitable, however further research is needed, and risk managers of lending protocols need to closely monitor slippage levels of collateral tokens and associated LTVs to pre-empt malicious attacks.\n\n\nAVAX-USD exploit on GMX - What happened\nOn 18 September, a trader engaged in a series of trades to impact the price of AVAX by >2%. This does not seem substantial at first sight but cost Liquidity Providers on perpetual swap exchange GMX.io dearly, losing approx $0.5m. GMX offers zero-slippage trading, based on oracle prices fetched from CEXes.\nThe trader successfully extracted profits from GMX’s AVAX-USD market by opening large positions at 0 slippage, then moving AVAX-USD on CEXes in their favor. The trader switched from long to short 5 times over an hour, creating a sinusoidal pattern.\nNotional trade sizes ranged between $4.2m to $4.8m.\n\n  \n\n      twitter.com\n  \n\n  \n    \nJoshua Lim\n@joshua_j_lim\n\n\n  3/ let's take a look at the first cycle which took place from 01:15:31 to 01:28:11 UTC. X was able to extract roughly $158k in profit by trading clips of $4-5mm at a time https://t.co/W6eu7Iz6lz\n\n\n\n  5:38 PM - 18 Sep 2022\n\n    \n      \n        \n      \n      87\n    \n\n    \n      \n        \n      \n      5\n    \n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nSome trading sleuths on CryptoTwitter put the price of the attack at c. $700k, mostly from slippage on the CEXes.\n\n  \n\n      twitter.com\n  \n\n  \n    \nalphanonce Intern\n@alphanonceStaff\n\n\n  How about slippage? The trader made a 2.2% [$18.3-$18.7] price impact. If half of the price impact was slippage, 1.1% would be the cost that the trader paid\n\n70M x 1.1% = 770K\n\n402K - 770K = -368K\n\nIf the above assumption is true, then the exploiter lost money in the trade\n\n\n\n  7:08 AM - 22 Sep 2022\n\n    \n      \n        \n      \n      8\n    \n\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nThe choice of trading venue (GMX) and time (low volume weekend hours) is not by chance and enabled the incident.\n\nConnecting the dots - How can such an attack vector be replayed on Aave?\nAave markets also fetch prices from Chainlink Oracles and thus rely on external data to quantify borrow limits and liquidation data.\nPrice manipulation can be a substantial threat to the stability of the Aave protocol: By artificially inflating asset prices, a trader can deposit overvalued tokens and drain borrow assets from the protocol.\nIn terms of profit, the attacker would walk away with whatever borrowing proceeds he can generate less the cost of the collateral asset (which gets deposited).\nA similar attack played out in a major exploit in May 2021 with $VXS, Venus Protocol’s governance token, at the center of it. Whales bought a significant amount of $VXS token and deposited them as collateral on Venus Protocol at the peak, bankrupting the protocol in the process (as can be tracked on the Bad Debt Dashboard the Risk DAO has published).\nWhat are the costs involved?\nFirst up, let’s look at the required bankroll: The trader needs to acquire AVAX as collateral asset and move the price in the process.\nBy looking at the GMX incident, some estimates suggest a $700k price tag, based on slippage and the aggregate trading volume. It is not clear what the attacker’s bankroll was but aggregate trading volume amounted to $70m over the period of the attack. However, this was a series of trades where the attacker went long and short and thus could recycle the bankroll.\nAs referenced earlier, a series of trades in the mid-$4m range (notional size) were entered which moved the price by approx 2%. Looking at the AVAX-USDT pair on Binance, it would cost approx $1.3m for a 2% move on a normal weekday.\nModeling methodologies for the price curves\nLet’s imagine Trader Alice who wants to manipulate the AVAX price by 100%. Her preferred trading venue is Binance and she assumes that every $1.3m trade moves the price by 2%.\nWe define the following variables:\nslippate_rate: Assumes 2% for every trade of $1.3m\nqty_trade: This is the n-th trade.\nprice_current: AVAX-USD price of $17.5 (as of 28 September 2022)\nprice_target = price_current*2\nThe following slippage functions are modeled:\nSuper-linear case:\nPrice_new = price_current * (1+slippage_rate)^qty_trade\nAssumes that slippage would increase the higher the percentage change is compared to price_current. This could be explained by positive reflexivity and more traders going long whilst supply of the token remains static.\nLinear case:\nprice_new = price_current * (1+slippage_rate*qty_trade)\nAssumes slippage stays constant regardless of the price changes.\nSublinear case:\nprice_new = price_current * (1+slippage_rate*qty_trade^0.9)\nAssumes the slippage rate decays as token price goes up. A rising token price would attract traders who sell their tokens into the price rally thereby suppressing the slope of the price curve.\nThe cumulative growth rates for the three slippage functions is visualized in the table below (for the first 10 trades).\n\n\nModelling results\nSuper-linear function\nAssuming an super-linear increase of the price based on 2% slippage, Alice would spend $45.5m to acquire 1.9m $AVAX at an average price of $24.5.\n\nIn terms of profitability, this trade would generate a loss of $3.3m. “Value” is defined as the post-pump price of $35 multliplied by the number of $AVAX token acquired.\n\nLinear function\nIf the 2% slippage persists in a linear style, Alice would spend $65m to acquire 2.6m $AVAX at an average cost of $25.4.\n\nIn terms of profitability, this trade would generate a loss of $6.8m.\n\nSub-linear function\nAssuming a sublinear function so that the slippage rate decays by a factor of 0.9, Alice would spend $100.1m to acquire 3.9m $AVAX at an average price of $25.8.\n\nIn terms of profitability, this trade would generate a loss of $12.1m.\n\n\n\n\nConclusion\nGiven the current risk parameters, the probability of a replay of the GMX attack on Aave is unlikely: The trade is just not profitable enough and an attacker would need to deploy significant sums in this high-risk strategy.\n\nThe scenario with a steeper slippage function (ie super-linear scenario) is more advantageous for malicious actors, as evidenced in the below summary chart: It costs the attacker less to pump the price. Albeit in our model it would still not result in a profit.\n\nIn the case of higher LTVs, however, this strategy could turn profitable giving malicious actors an incentive to attack.\n\nThus, risk managers need to watch the token order books for slippage and LTV parameters to stay on top of a potential gamification of collateral prices.", "reads": 52, "readers_count": 51, "score": 640.4, "word_count": 1604, "category_id": 7}, {"url": "https://governance.aave.com//t/micro-level-user-level-risk-monitoring-idea", "topic_id": 10208, "title": "Micro-Level (User Level) Risk Monitoring Idea", "posts_count": 1, "views": 1428, "like_count": 0, "author_username": "ccb_roci", "created": "2022-10-08T08:04:09.380Z", "text": "Introduction\nRociFi is a protocol building the two key pillars of Web3’s future – on-chain credit scores and under-collateralized lending. The credit scoring is powered by our non-fungible credit score (NFCS), which ranks users according to their likelihood of repaying an under-collateralized loan. The scale is 1 to 10 with 1 being the best score and 10 being the worst.\nFor reference, NFCS is built using RociFi protocol repayment data and other DeFi protocols; including Aave and Compound. The depth and breadth of data allows the NFCS to be the clear leader in on-chain credit scores which has applicabilities to other lending protocols.\nIn particular, lending protocols like Aave could use RociFi NFCS to achieve better capital efficiency by offering higher LTVs to higher scored borrowers – generating greater revenues without a demonstrable increase in insolvency risk – akin to a micro-level Gauntlet.\nThe best part is that the NFCS API is open to any developer or protocol to call for real-time scores of any NFCS holder, thus they could integrate this score based on each protocol’s individual needs.\nRevenue Increase\nBelow we provide comparisons of the revenue Aave and Compound generated historically and what they would have generated using RociFi NFCS scores for higher capital efficiency. The following LTVs used for revenue simulations are per score:\n\nScreen Shot 2022-10-08 at 9.39.22 AM562×790 20.5 KB\n\nAave\nUsing a simulation period from December 2020 to Aug 2022, we compare the estimated total and monthly gross revenue Aave would have earned with and without RociFi NFCS on Aave V2 (ETH, Avax, Polygon), and Aave V3 (Arbitrum, Optimism, Polygon, Avalanche, Fantom); assuming an APR of 8%.\nUsing RociFi NFCS would have generated revenue of ~$256,308,772 while without only earned ~$132,491,204. By being able to offer higher LTVs, Aave would generated an additional $123,817,568 in value (net of liquidations) with a negligible increase in insolvency risk.\n\nScreen Shot 2022-10-08 at 10.02.47 AM1224×618 55.3 KB\n\nTokens Considered : [‘DAI’, ‘USDC’, ‘USDT’, ‘EURS’, ‘agEUR’, ‘jEUR’, ‘AAVE’, ‘LINK’, ‘WBTC’, ‘WETH’, ‘WMATIC’, ‘CRV’, ‘SUSHI’, ‘GHST’, ‘DPI’, ‘BAL’], these were simulated with the following LTV’s : [0.97, 0.97, 0.97, 0.97, 0.97, 0.97, 0.6, 0.5, 0.7, 0.8, 0.65, 0.75, 0.2, 0.25, 0.2, 0.2]. Note that Revenue simulations assume no default\nBy scoring borrowers with the NFCS, Aave is able to achieve better capital efficiency by not penalizing responsible borrowers, enabling higher loan allocation to this subgroup, i.e. give good borrowers more loans and less to worse borrowers. This simple heuristic is illustrated in the distribution of loan amount by score chart below.\n\nUsing RociFi NFCS, despite higher LTVs, a heavy concentration of Aave loan volume went to the very best borrowers, i.e. credit scores 1-5, comprising 92% of total loan volume issued. Thus, increased revenue with minimal increase in insolvency risk.\nConclusion\nIntegrating onchain credit scores from RociFi NFCS allows existing lending protocols to offer more competitive LTVs, thus higher risk-adjusted revenues. Additional positive byproducts of adopting RociFi NFCS by protocols are (1) incremental revenue can be passed back to the community and (2) better product attractiveness via higher LTV for borrowers with lower rates, and higher supply rates to lenders.", "reads": 20, "readers_count": 19, "score": 1929.0, "word_count": 584, "category_id": 7}, {"url": "https://governance.aave.com//t/understanding-risk-on-aave", "topic_id": 8247, "title": "Understanding Risk on Aave", "posts_count": 4, "views": 1753, "like_count": 5, "author_username": "cevsde", "created": "2022-05-23T21:01:04.802Z", "text": "Hey! Could someone please clarify who takes what risk on Aave? As an example, if there’s a liquidity crunch / lots of borrowers default, is the Aave protocol bearing the risk or is it the lenders?\nYes, Aave has mechanisms in place to mitigate the risk (reserve factor, LTV etc.) but I’m curious as to who ultimately bears the risk.\nThanks!", "reads": 63, "readers_count": 62, "score": 197.6, "word_count": 127, "category_id": 7}, {"url": "https://governance.aave.com//t/ethw-action-plan", "topic_id": 9482, "title": "ETHW Action plan", "posts_count": 1, "views": 1610, "like_count": 1, "author_username": "o_O", "created": "2022-08-29T05:58:13.930Z", "text": "In the event of a (very likely) fork after Ethereum goes PoS, ETHW has a large probability of retaining some value.\nThat being said, centralized exchanges that take WBTC, USDC, and all other tokens on the Ethereum chain will only support the PoS Ethereum chain’s tokens. This would essentially send them plummeting to zero on the PoW side.\nIs there an action plan for Aave PoW Ethereum once this occurs? If all other assets drop to zero, any ETH loans using USDC as collateral would get liquidated- and all USDC loans collateralized with ETH would be essentially forgiven.\nI understand there is a vote out for pausing borrowing ETH right around the fork for risk mitigation on the PoS side but can there be anything done for the 571 thousand ETH that’s already borrowed on the PoW side to prevent it from being liquidated or locked up permanently?", "reads": 29, "readers_count": 28, "score": 315.8, "word_count": 166, "category_id": 7}, {"url": "https://governance.aave.com//t/my-4500x-stkaave-was-stolen-by-hackers", "topic_id": 9317, "title": "My 4500X stkaave was stolen by hackers", "posts_count": 22, "views": 2885, "like_count": 10, "author_username": "majestywwwc", "created": "2022-08-15T04:39:31.156Z", "text": "Hi guys,My AAVE happened to be stolen! I need a help, my 4500X AAVE STK was transferred by someone in the mining pool\n\n  \n      \n\n      Ethereum (ETH) Blockchain Explorer\n  \n\n  \n    \n\nEthereum Transaction Hash (Txhash) Details | Etherscan\n\n  Ethereum (ETH) detailed transaction info for txhash 0xf5344c627732ff0f9997d7740390945b537e0b115cad0fc59d5b7979456ae81f. The transaction status, block confirmation, gas fee, Ether (ETH), and token transfer are shown.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nI can’t understand how he did it, he also transferred my 0.2ETH at the time of the pass , but in the AAVE mining pool , he needs 10 days to unlock the mining, I only added AAVE ICO in 2017.\nThis is my debank wallet history\n  \n      \n\n      DeBank\n  \n\n  \n    \n\nDeBank | Your DeFi wallet\n\n  A multi-chain portfolio tracker that supports the largest number of DeFi protocols.\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nI hope the community team can freeze the transaction funds. Now there is a 10 day cooling time or the community votes. I can provide any evidence. If I can freeze or recover the money, I am willing to donate all the money to the AAVE community. I hope the administrator can help me.", "reads": 55, "readers_count": 54, "score": 676.0, "word_count": 1972, "category_id": 7}, {"url": "https://governance.aave.com//t/dai-as-collateral", "topic_id": 9288, "title": "DAI as collateral", "posts_count": 6, "views": 1627, "like_count": 3, "author_username": "P5555A", "created": "2022-08-12T16:38:47.667Z", "text": "Today, one of the prominent Twitter Crypto accounts published hypothetical but detailed and realistic plan of de-pegging DAI. What is AAVE going to do to assess the risk and mitigate it? I’m sure that everyone who has got collateral in would be curious to know. Just to remind that similar plan was published months before UST and Luna collapse.", "reads": 42, "readers_count": 41, "score": 118.4, "word_count": 354, "category_id": 7}, {"url": "https://governance.aave.com//t/new-protocol-that-creates-potential-risk-bribe", "topic_id": 7282, "title": "New protocol that creates potential risk: Bribe", "posts_count": 9, "views": 2120, "like_count": 16, "author_username": "Dirkalark", "created": "2022-02-10T06:23:09.175Z", "text": "Hello, Aave community!\nI just came across a platform that I thought would be of interest to Aave Governance, if they weren’t already aware of it.\n\n  \n      \n\n      bribe.xyz\n  \n\n  \n    \n\nBRIBE Protocol\n\n  where DAO token holders get paid to govern\n\n\n  \n\n  \n    \n    \n  \n\n  \n\n\nBeing that the first project to be listed there is Aave I figured I would drop the link so that others more versed in the specifics of governance than me could debate the topic.", "reads": 47, "readers_count": 46, "score": 129.4, "word_count": 494, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-2022-02-10", "topic_id": 7286, "title": "ARC: Risk Parameter Updates 2022-02-10", "posts_count": 7, "views": 2116, "like_count": 7, "author_username": "Pauljlei", "created": "2022-02-11T02:56:52.373Z", "text": "\nSimple Summary\nA proposal to adjust eleven (11) total risk parameters across seven (7) Aave V2 assets including LTV, Liquidation Threshold, and Liquidation Bonus.\n\nAbstract\nThis proposal is a batch update of risk parameters to align with the Moderate risk level chosen by the Aave community. These parameter updates are a continuation of Gauntlet’s regular parameter recommendations.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets. As a heads up, Gauntlet will publish a blog post soon on our parameter recommendation methodology to provide more context to the community\nOur parameter recommendations are driven by an optimization function that balances 3 core metrics: insolvencies, liquidations, and borrow usage. Our parameter recommendations seek to optimize for this objective function. Our agent-based simulations use a wide array of varied input data that changes on a daily basis (including but not limited to, asset volatility, asset correlation, asset collateral usage, DEX / CEX liquidity, trading volume, expected market impact of trades, and liquidator behavior). Our simulations tease out complex relationships between these inputs that cannot be simply expressed as heuristics. As such, the input metrics we show below can help understand why some of the param recs have been made, but should not be taken as the only reason for recommendation. Our individual collateral pages on the dashboard cover other key statistics and outputs from our simulations that can help with understanding other interesting inputs and outputs related to our simulations. For more information, please refer to our Aave market risk assessment where we provide a tactical understanding of our model architecture.\n\nSpecification\nThese past two weeks saw slight decreases in volatility and increases in liquidity and trading volume, which our simulations picked up on. In addition, our recent market downturn report showed that many collaterals are resilient to insolvencies, as our simulation models have predicted. We will continue to adjust risk parameters to drive increases in capital efficiency while maintaining protocol risk at safe levels.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nCRV Loan To Value\n45%\n55%\n\n\nCRV Liquidation Threshold\n60%\n65%\n\n\nFEI Loan To Value\n50%\n60%\n\n\nFEI Liquidation Threshold\n60%\n70%\n\n\nLINK Liquidation Bonus\n7.5%\n6.5%\n\n\nMKR Liquidation Bonus\n8.0%\n7.5%\n\n\nSNX Loan To Value\n40%\n45%\n\n\nSNX Liquidation Threshold\n60%\n65%\n\n\nxSUSHI Loan To Value\n45%\n50%\n\n\nxSUSHI Liquidation Threshold\n60%\n65%\n\n\nUNI Liquidation Bonus\n8.0%\n7.5%\n\n\n\nSee below volatility and exchange volume data from 01/18 to 02/09. These are useful metrics to build intuition but are not the only inputs our simulations take into account in our parameter recommendations off of.\n\n\n\n\nSymbol\n02-09 Volatility\n01-18 Volatility\nVolatility Change\nWeekly Average Daily Volume Change (%)\n\n\n\n\nCRV\n1.586428486\n1.611794518\n-0.025366032\n-48.2544541\n\n\nFEI\n0.076148592\n0.054860766\n0.021287826\n-65.5712964\n\n\nLINK\n1.322292723\n1.293466069\n0.028826654\n-38.7660331\n\n\nMKR\n1.136936786\n0.972006147\n0.164930639\n209.0123383\n\n\nSNX\n1.251241404\n1.323555377\n-0.072313973\n97.3261162\n\n\nSUSHI\n1.373581906\n1.637707787\n-0.264125881\n-30.8229681\n\n\nUNI\n1.256113579\n1.19104143\n0.065072149\n20.3782517\n\n\n\n\nRisk Dashboard\nThe community should use Gauntlet’s Risk Dashboard to better understand the updated parameter suggestions and general market risk in Aave V2.\nValue at Risk represents the 95th percentile insolvency value that occurs from simulations we run over a range of volatilities to approximate a tail event.\nLiquidations at Risk represents the 95th percentile liquidation volume that occurs from simulations we run over a range of volatilities to approximate a tail event.\n\n\n\nNext Steps\n\nInitiate a Snapshot immediately since the community has already weighed in on changes of this nature recently.\nTargeting an AIP on 2022-02-15\n", "reads": 29, "readers_count": 28, "score": 915.8, "word_count": 790, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-2022-01-14", "topic_id": 6942, "title": "ARC: Risk Parameter Updates 2022-01-14", "posts_count": 14, "views": 2268, "like_count": 20, "author_username": "Pauljlei", "created": "2022-01-14T17:32:43.034Z", "text": "\nSimple Summary\nA proposal to adjust twelve (12) total risk parameters across eight (8) Aave V2 assets including LTV, Liquidation Threshold, and Liquidation Bonus.\n\nAbstract\nThis proposal is a batch update of risk parameters to align with the the Moderate risk level chosen by the Aave community. These parameter updates are a continuation of Gauntlet’s regular parameter recommendations.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\nIn addition, we propose to enable utilizing FEI as a collateral on Aave. The initial parameters for FEI will be an LTV of 50%, a Liquidation Threshold of 60%, and a Liquidation Bonus of 6.5%. Most of the stablecoins that can be used as collateral are more liquid, and our platform’s analysis recommends initially capping the amount of collateral that can be liquidatable to the average daily trading volume. If user behavior and market conditions over the coming months continue to show safe conditions for increasing capital efficiency on FEI, we shall recommend ramping up the LTV and Liquidation Threshold incrementally.\n\nSpecification\nThis past week did not see outsized changes in market conditions nor within the Aave protocol. There were slight volatility drops and increases in trading volume and liquidity for most assets. Our platform recommends the following set of parameter changes that will decrease liquidation bonuses on several less-utilized assets.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nBAL Liquidation Bonus\n8.0%\n7.5%\n\n\nCRV Loan To Value\n45%\n55%\n\n\nDPI Loan To Value\n65%\n70%\n\n\nDPI Liquidation Bonus\n8.5%\n7.5%\n\n\nDPI Liquidation Threshold\n70%\n75%\n\n\nENJ Loan To Value\n60%\n70%\n\n\nFEI Loan To Value\n0%\n50%\n\n\nFEI Liquidation Threshold\n0%\n60%\n\n\nFEI Liquidation Bonus\n0%\n6.5%\n\n\nMANA Loan To Value\n65%\n70%\n\n\nMKR Liquidation Bonus\n8.0%\n7.5%\n\n\nUNI Liquidation Bonus\n8.0%\n7.5%\n\n\n\n\nRisk Dashboard\nThe community should use Gauntlet’s Risk Dashboard to better understand the updated parameter suggestions and general market risk in Aave V2.\n\n\nNext Steps\n\nInitiate a Snapshot immediately since the community has already weighed in on changes of this nature recently.\nTargeting an AIP on 2022-01-18\n", "reads": 52, "readers_count": 51, "score": 875.4, "word_count": 1381, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-2021-12-29", "topic_id": 6742, "title": "ARC: Risk Parameter Updates 2021-12-29", "posts_count": 2, "views": 1836, "like_count": 7, "author_username": "Pauljlei", "created": "2021-12-29T23:54:51.072Z", "text": "\nSimple Summary\nA proposal to adjust nine (9) total risk parameters across seven (7) Aave V2 assets including LTV, Liquidation Threshold, and Liquidation Bonus.\n\nAbstract\nThis proposal is a batch update of risk parameters to align with the the Moderate risk level chosen by the Aave community. These parameter updates are a continuation of Gauntlet’s regular parameter recommendations.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\n\nSpecification\nThis past week did not see outsized changes in market conditions nor within the Aave protocol. There were slight volatility drops and increases in trading volume and liquidity for most assets. Our platform recommends the following set of parameter changes that will decrease liquidation bonuses on several less-utilized assets.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nBAL Liquidation Bonus\n8.0%\n7.5%\n\n\nCRV Loan To Value\n45%\n55%\n\n\nDPI Loan To Value\n65%\n70%\n\n\nDPI Liquidation Bonus\n8.5%\n7.5%\n\n\nDPI Liquidation Threshold\n70%\n75%\n\n\nENJ Loan To Value\n60%\n70%\n\n\nMANA Loan To Value\n65%\n70%\n\n\nMKR Liquidation Bonus\n8.0%\n7.5%\n\n\nUNI Liquidation Bonus\n8.0%\n7.5%\n\n\n\n\nRisk Dashboard\nThe community should use Gauntlet’s Risk Dashboard to better understand the updated parameter suggestions and general market risk in Aave V2.\n\n\nNext Steps\n\nInitiate a Snapshot immediately since the community has already weighed in on changes of this nature recently\nTargeting an AIP on 2022-01-05\n", "reads": 37, "readers_count": 36, "score": 427.4, "word_count": 277, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-risk-parameter-updates-2021-12-16", "topic_id": 6646, "title": "ARC: Risk Parameter Updates 2021-12-16", "posts_count": 5, "views": 2079, "like_count": 12, "author_username": "Pauljlei", "created": "2021-12-16T23:24:22.033Z", "text": "\nSimple Summary\nA proposal to adjust nine (9) total risk parameters across seven (7) Aave V2 assets including LTV, Liquidation Threshold, and Liquidation Bonus. In addition, we propose freezing the KNCL reserve.\n\nAbstract\nThis proposal is a batch update of risk parameters to align with the Moderate risk level chosen by the Aave community. These parameter updates are a continuation of Gauntlet’s regular parameter recommendations.\n\nMotivation\nThis set of parameter updates seeks to maintain the overall risk tolerance of the protocol while making risk trade-offs between specific assets.\n\nSpecification\nThe recent market downturn on the weekend of December 4th led to the most liquidations on both centralized exchanges and in liquidity protocols in the recent past. Most liquidations on the Aave protocol happened between 4:30 and 5:45 UTC when the price of ETH dropped nearly 13%. Below is a graph of liquidation by collateral and repay asset.\n\nAlthough volatility for assets is slightly higher, the abundance of liquidity and active market participants is a positive sign for the health of Aave! For example, the total value of CRV (curve dao token) liquidated was large compared to the total collateral used on Aave. Lower LTV, lower liquidation threshold, and higher liquidation bonus protect the protocol from insolvencies. However, multiple liquidations of over 400,000 USD occurred in quick succession. This shows ample liquidity for liquidators even in times of high network congestion. These market events provide important data points for measuring tail risk.\nFor reference, previous analysis of liquidations on Aave from May 2021 can be found here: Aave Protocol Liquidation Retrospective: May 2021 | by Watson Fu | Gauntlet | Medium\nAlthough some assets currently have higher volatility, our analysis shows that it is safe to increase borrowing parameters and decrease liquidation bonus values. Our simulations study price drops and network congestion more extreme than was seen last week, and slippage and liquidity considerations have improved.\n\n\n\n\nParameter\nCurrent Value\nRecommended Value\n\n\n\n\nBAT Loan To Value\n70%\n75%\n\n\nCRV Liquidation Bonus\n10.0%\n8.5%\n\n\nENJ Liquidation Bonus\n10.0%\n7.5%\n\n\nREN Loan To Value\n55%\n60%\n\n\nREN Liquidation Threshold\n60%\n65%\n\n\nSNX Loan To Value\n30%\n40%\n\n\nSNX Liquidation Threshold\n55%\n60%\n\n\nSUSHI Liquidation Bonus\n10.0%\n8.5%\n\n\nZRX Loan To Value\n60%\n65%\n\n\n\nFreezing KNCL\nThe KyberDAO approved the proposal to migrate KNC token contract to a new implementation on 4/20, which enables Kyber governance to upgrade KNC efficiently. As of 11/2, 177M of KNC have migrated to the new Kyber Network Crystal (KNC) and 74M of KNC are still in the old KNC Legacy (KNCL) contract. There is currently 916K KNCL supply and 229k total borrowed on Aave.\nConsidering that exchanges (e.g. Kraken, Crypto.com) have stopped supporting KNCL deposit and trading, the liquidity of KNCL has also been reduced. We propose freezing KNCL to speed up the KNC migration as well as eliminating the risk of keeping a less liquid deprecated asset on the platform.\n\nRisk Dashboard\nThe community should use Gauntlet’s Risk Dashboard to better understand the updated parameter suggestions and general market risk in Aave V2.\n\n\nNext Steps\n\nInitiate a Snapshot immediately since the community has already weighed in on changes of this nature recently.\nTargeting an AIP on 2021-12-20\n", "reads": 42, "readers_count": 41, "score": 1063.4, "word_count": 1006, "category_id": 7}, {"url": "https://governance.aave.com//t/aave-risk-dashboard-by-gauntlet-launched", "topic_id": 5700, "title": "Aave Risk Dashboard by Gauntlet Launched", "posts_count": 1, "views": 2545, "like_count": 14, "author_username": "shaan", "created": "2021-09-22T20:46:38.319Z", "text": "Hi Folks!\nOver the last couple of months, the Gauntlet team has been building the Aave Risk Dashboard. We are happy to announce that the Aave Risk Dashboard is now live at gov.gauntlet.network/aave!! We are very excited to release this dashboard to the community and start to gather feedback so we can continue to iterate on it and maximize its impact.\nA few high level points/reminders:\n\nThere are two goals for the initial dashboard launch: a) help the community understand our methodology and recommendations and b) help the community understand how Gauntlet’s recommendations help reduce risk and increase capital efficiency for the protocol.\n\nValue at Risk (VaR) and Borrow Usage (BU) are topline measures of Risk and Capital Efficiency respectively. VaR conveys capital at risk due to insolvencies and liquidations when markets are under duress (i.e. Black Thursday). We currently compute VaR (based on a measure of protocol insolvency) at the 95th percentile of our simulation runs assuming higher than normal volatility. Borrow Usage is defined in detail in this post.\nYou may notice VaR being $0 for quite a few assets. This is due to the fact that these assets do not represent a significant portion of Aave’s borrow positions and that liquidator agents prefer large positions due to higher guarantees on making a profit. This leads to no liquidations or insolvencies happening in our sims for the smaller assets and positions in Aave.\nWe have removed the historical VaR and Borrow Usage charts from the initial version of the dashboard, as we need a bit more time to backfill market data and test. We expect to launch the charts in a few weeks.\nTo get an even more in depth understanding of our methodology for running Simulations take a look at our Aave report. In particular, Section 4.3 and Appendix Section C. While we have updated the actual data underlying the sims, the methodology remains relevant.\n\nWith the Dashboard, we are excited about making the Aave protocol safer and more capital efficient. With the most recent round of parameter changes being proposed in AIP-38, we are able to reduce Value at Risk by $7.68M, while maintaining the same level of Borrow Usage! By reducing Liquidation Bonuses we are able to reduce the chance of cascading liquidations and thus reduce potential borrower losses, making the Aave protocol safer overall. Going forward we plan on keeping the dashboard up-to-date with the current state of the Aave protocol and our recommended parameter changes.\nThis is just the start of our Risk Dashboard product for Aave and we plan on refining it with the community. Feel free to give feedback in the comments here, or directly to us using the Send Feedback button on the dashboard!\nQuick Links:\nDashboard: gov.gauntlet.network/aave\nAave Report: gauntlet.network/reports/aave\nAIP-38: https://app.aave.com/governance/38-QmciauyTVnoHG6bAXCxHjHqTsUfiDz7rSGFxMADqFgCh4z", "reads": 67, "readers_count": 66, "score": 2383.4, "word_count": 532, "category_id": 7}, {"url": "https://governance.aave.com//t/aave-risk-dashboard-development-update", "topic_id": 5370, "title": "Aave Risk Dashboard Development Update", "posts_count": 2, "views": 1894, "like_count": 12, "author_username": "shaan", "created": "2021-08-19T00:19:59.227Z", "text": "Hi Folks,\nWe wanted to walk you through our development plans for the Aave Risk Management Dashboard by Gauntlet as outlined in our ARC. Just to reiterate, our goals with this dashboard are twofold:\n\nHelp the community understand our recommendations and methodology\nHelp the community understand how our recommendations affect key risk metrics like VaR and Borrow Usage\n\nSome additional points around the dashboard\n\nIt will be updated daily, and any parameter recommendations will be pushed both to our dashboard as well as kicked off in forum discussion similar to how we have done our recent liquidation bonus update. We’ll try to streamline this process over time to get parameter updates to market faster.\nThe version we have in our mocks has been validated in user studies and serves as our initial MVP. We hope to launch this quickly and then iterate on key components with the community.\n\nWe have kicked off development of the dashboard as of last week and are expecting to have it launched and live by Sept 22nd. We have 6 people on our team working on this dashboard and the various data components that power it: @jeremy, @marcinja, @eruleman , @wfu, @shaan, @inkyamze.\nIn particular we have the following milestones that we are targeting (some of which will be done in parallel)\n\nBuild out FE components with Mock data - @jeremy\n\nDashboard Infrastructure (BE, DB, serving endpoints) - @marcinja\n\nETLs for onchain Aave data - @eruleman\n\nETLs for centralized market data - @eruleman\n\nETLs deployed for simulation data - @jeremy, @wfu\n\nQAing the dashboard - @shaan, @inkyamze\n\n\nWe wanted to share this with y’all to give you a sense of when the dashboard will go live and answer any questions you may have.", "reads": 34, "readers_count": 33, "score": 316.8, "word_count": 313, "category_id": 7}, {"url": "https://governance.aave.com//t/increasing-liquidation-threshold-on-polygon", "topic_id": 5266, "title": "Increasing liquidation threshold on Polygon", "posts_count": 1, "views": 1670, "like_count": 0, "author_username": "Chab", "created": "2021-08-12T02:38:58.435Z", "text": "I was wondering about this aspect of the security of Aave, the protocol has matured a lot and there are now efficient liquidators ready to slash any too uncautious mind. But the protocol should also protect the users and of course avoid slashing anyone if the system stability isn’t compromised.\nSo I would like to talk about $MATIC and $AAVE having both 50% borrow capacity and 65% Liquidation threshold.\nI completely understand the 50% because of volatility of these assets and being overexposed to those as collateral could be harmful. However I like 65% is pretty few.\nHaving like $AAVE $MATIC and $ETH in equivalent proportion brings the overall liquidation threshold to 0.71 and the borrow capacity to 0.6.\nEven being cautious and borrowing to 0.4 of borrowing capacity, if the price of the assets goes down half, that would bring the account to 0.8 and triggering the threshold.\nAnd this is considering having $ETH with 82.5% of liquidation threshold which brings stability here. Having just these two honorables assets would trigger the liquidation with a 39% drop of the price of these assets.\nBut such events do not happen in a second on these assets, and many bots have had enough time to take care of the liquidations and arbitrages of even more uncautious users, renforcing the stability and safety of the Aave protocol along the way.\nSo while I understand the limited borrowing capacity for such assets, I don’t really get why 70 or 75% liquidation threshold shouldn’t be considered. That could bring more opportunity to be confident in using Aave liquidities to explore interesting opportunities Polygon ecosystem offers.\nAt 70% of LT for $AAVE and $MATIC that would bring the overal LT to 75% protecting against 46.7% drop, which is way better to protect just getting caught by the dip.\nAt 75% of LT it is 77% overall LT, and protects against 49% drop, which is very good.\nManaging these kind of positions could be at risk for an unaware user, while the security of the protocol doesn’t seem so compromised in the case of a small increase of some LT, like $WBTC $AAVE or $MATIC. And that would give users more time to realize positions could be at risks, while adding no structural risk to end up over-collateralized on these assets because of the low Borrowing Capacity.\nThe rates can be checked at Polygon Market - Risk.\nPlease let me know your thoughts", "reads": 18, "readers_count": 17, "score": 263.6, "word_count": 423, "category_id": 7}, {"url": "https://governance.aave.com//t/just-got-hacked-unsure-if-its-the-cookies-on-aave-or-metamask-issue", "topic_id": 4945, "title": "Just got hacked, unsure if it's the cookies on AAVE or Metamask issue", "posts_count": 1, "views": 1767, "like_count": 0, "author_username": "zupcuz", "created": "2021-07-24T20:17:40.070Z", "text": "Hi guys, this is my first post,\nI just found out a series of foreign transactions on my ether scan,\nboth on Matic net and Etherium Mainnet\nLast night about 6 hours ago, I approved Uniswap on several token permissions and AAVE cookies. Also a JAVA UPDATE.  That was it.\nTonight, I came to check on my Metamask and everything was gone, came to check on my AAVE/Curve account and it was also all gone. If anyone has been through similar situations please HELP!! I lost what I cannot afford to lose, if anyone can help retrieve the lost fund (around 16,000USD) I’m willing to give 30% of it as a reward.\nAny suggestion on what I should do from now on is very much appreciated!\n\n\nMy metamask address: 0x5bc6f4ba5de879ab1f11c5c03b7723fd31fb44f8\n\n\nEtherscan:\nAddress 0x5bc6f4ba5de879ab1f11c5c03b7723fd31fb44f8 | Etherscan\n\n\nPolygonscan:\nAddress 0x5BC6F4ba5De879Ab1f11c5C03B7723fD31fb44f8 | PolygonScan\n\n\nThe hacker’s address: 0xe2fe66c7e452c3175a25b6b30bf0f45a6228e33a\n\n\nDebank: DeBank | DeFi Wallet for Ethereum Users\n\n\nHe took everything in the wallet and logged in to my AAVE and Curve account\nAny help is help. please help!!! \nMarcus", "reads": 38, "readers_count": 37, "score": 102.6, "word_count": 230, "category_id": 7}, {"url": "https://governance.aave.com//t/arc-disable-old-knc-activate-new-knc", "topic_id": 4478, "title": "ARC: Disable ‘old’ KNC, activate new KNC", "posts_count": 1, "views": 1686, "like_count": 2, "author_username": "denizined", "created": "2021-06-08T15:30:13.729Z", "text": "Summary:\nKyber Network Crystal (KNC), Kyber Network’s governance token, has migrated to a new smart contract address. The old KNC has been renamed KNCL (Kyber Network Crystal Legacy) to differentiate it from the new KNC.\nExchanges have mostly migrated from KNCL to the new KNC and therefore liquidity for KNCL is greatly reduced. In light of this, can we disable lending and borrowing of KNCL on Aave, and activate lending and borrowing of the new KNC since the Aave pools cannot automatically be migrated from the old to the new KNC pool?\nThere is currently roughly 1.3M KNC (now KNCL) on Aave with 166k of this supply borrowed by Aave users. Users can withdraw their KNCL and migrate it (ie. convert it) to the new KNC through a very simple procedure on Kyber.org | KyberDAO's default interface for KNC Staking and Voting\nIf users continue interacting with KNCL on Aave they are exposed to continuously diminishing liquidity and therefore borrowers might find it harder to repay their debt and the same risk applies to liquidations.\nReferences:\nKyber Network Announcement: https://twitter.com/kybernetwork/status/1384504675701952517\nMigration Guide:\n  \n      \n\n      Medium – 27 May 21\n  \n\n  \n    \n\nKNC Token Migration Guide\n\n  KNC Migration Process has begun: Tuesday, 20th April, 9 pm SGT (GMT+8)\n\n  \n    Reading time: 6 min read\n  \n\n  \n\n  \n    \n    \n  \n\n  \n\n\nKyber Improvement Proposal that triggered the migration: KIPs/kip-6.md at master · KyberNetwork/KIPs · GitHub\nExamples of exchanges migrating:\nhttps://support.kraken.com/hc/en-us/articles/4401758213268\n(I’ve removed links to Binance’s announcement and other exchange examples as I’m limited to 5 links per post as a new user on this forum)\nPlease let me know if you have any further questions. I can also be reached at deniz@kyber.network\nThanks,\nDeniz", "reads": 22, "readers_count": 21, "score": 89.4, "word_count": 272, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-s-market-risk-assessment", "topic_id": 3814, "title": "Gauntlet’s Market Risk Assessment", "posts_count": 3, "views": 3617, "like_count": 15, "author_username": "wfu", "created": "2021-04-27T18:02:02.204Z", "text": "Recently, we published a formal analysis of the financial risk to participants in the Aave V1 and V2 protocols. The report expounds on methodology minutiae and specific results of our research. This post should serve as a TLDR and also give members of the community an opportunity to give feedback and suggestions about other market risk implications to the Aave protocol.\nBackground\nAt the time of writing, Aave has over $7, $8, $10 billion in TVL (thanks @Anjan-ParaFi!). With growth of this scale, mitigating financial and market risks is increasingly important as billions in customer funds are on the line.\nWithin decentralized finance (DeFi), borrowing protocols have four main risk factors:\n\nSecurity risk\nGovernance risk\nOracle risk\nMarket risk\n\nThis post will focus on market risk, but we discuss how the Aave protocol addresses each of the other risk factors in our formal report.\nDefining Market Risks\nThere are four primary sources of market risk within the protocol:\n\nExtreme downward price movement: Shocks to market prices of collateral that cause the contract to become insolvent due to under-collateralization\nAsset illiquidity and liquidator inaction: Loss of liquidity in an external market place, leading to a liquidator being disincentivized to liquidate defaulted collateral\nCascading liquidations: liquidations lower external market prices which in turn lead to further liquidations (i.e. a deflationary spiral)\nSlashing of the safety module: Insolvency of the safety module due to extreme events where multiple collateral types concurrently fail to be liquidated\n\nHow do we test if the Aave protocol can be resilient to each of these market risks? Simulated stress tests!\nSimulated Stress Tests\nThe main tool that we use to perform simulation-based stress tests on Aave’s Ethereum smart contracts is agent-based simulation (ABS). ABS has been used in a variety of stress test contexts, including to estimating censorship in cryptocurrency protocols, detecting fraudulent trading activity in CFTC exchanges,and stress testing frameworks from the European Central Bank and the Federal Reserve. These simulations, while powerful, can be difficult to make both useful and accurate as model complexity can make it hard to match experimental results. Careful design, tuning, and infrastructure architecture can help avoid these pitfalls and has made ABS invaluable in industries such as algorithmic trading and self-driving car deployment.\nPlease take a look at our report to learn more about our simulation environment!\nMany elements of our simulation are designed to study the aforementioned market risks.\nExtreme downward price movement\nWe use a multi-asset correlated Geometric Brownian motion (GBM) to simulate price trajectories. The two most important aspects of this model are asset volatility and asset correlation. In order to properly simulate market capitulation and extreme price drops, we train models on historical data with various volatility regimes. Below is the price of ETH on Black Thursday with the cumulative liquidation value on the Aave V1 protocol. Both the price path and the delay in liquidations are key inputs to our simulation.\n\n1496×1000\n\nWith the abundance of cryptoassets available on the Aave protocol, it is important to quantify and understand asset correlation, which can give insight into possible contagion and correlated liquidation and insolvency risk. These are the correlation matrices for Aave V2 in March 2021 (Top) and Aave V1 in January 2021 (bottom).\n\n1600×1529\n\n\n817×773\n\nAsset illiquidity and liquidator inaction\nAsset illiquidity can lead to liquidator inaction because the liquidator will need to give up large amounts of profit to trade out of collateral and borrow asset positions. Below is a visualization of optimal liquidator trade sizing with respect to expected slippage in different volatilities and order sizes.\n\n1008×650\n\nIn addition, extreme network congestion will also lead to liquidator inaction. In order to simulate gas congestion and transaction delay, we construct modified and truncated normal distributions from 3 month trailing gas price data. At each time step in the simulation, we sample from the probability distribution to define the liquidator behavior.\nAs we increase ETH volatility in our simulations, we also increase the mean, standard deviation, and skew of the gas price distribution. Below are the daily gas percentile curves for February 2021 and generated gas curves.\n\n1600×887\n\n1440×720\n\nCascading liquidations\nThe deflationary spiral that can occur as a result of large liquidations is reproduced in our simulation by training market impact models. These models are trained on order-book (for centralized exchanges) and AMM (for decentralized exchanges) data. After a trade occurs (i.e. selling of liquidated collateral), we capture the impact that it has in the short-term and long-term.\nTwo factors that can affect the market impact are asset volatility and the size of the trades. We define the scaled liquidity of an asset as the average daily traded volume of the asset divided by the total collateral on the protocol. This is a snapshot of the market characteristics of each of the assets on Aave V2 in March 2021. \n1600×1173\n\nSlashing of the safety module\nThe Aave protocol has a safety module denominated in the native AAVE token which serves as a backstop for protocol insolvency. Yield seeking investors can purchase AAVE, stake (lock) it within an insurance pool, and earn a pro-rata portion of AAVE rewards (currently 550 AAVE per day).\nIf an Aave market reaches a state where its liabilities (outstanding liens) are greater than its assets (collateral), then the AAVE safety module covers the shortfall of all markets voted by the community.\nOur assumptions for safety module slashing are very conservative: we only consider the staked Aave safety module and do not use the liquidity provided by the 80/20 Balancer pool. In addition, we make the assumption that most centralized liquidity will disappear in a slashing event. In simulation, whenever there is an insolvency on the protocol, we sell Aave into the market and model the impact with only DEX liquidity.\nMetrics\nWe will first define metrics that will help us answer these questions in a quantitative manner.\n\nInsolvent account: Any account where the total borrow value in USD is larger than the total collateral value in USD.\nNet insolvent value: When looking at a single account, this is the net insolvent value of the account at the end of a simulation run divided by the total collateral value of the account at the beginning of the run. When looking at the entire protocol, this is the sum of the net insolvent value of all accounts divided by the total collateral value of all accounts.\nNet insolvent value percentage: When looking at the entire protocol, this is the sum of the net insolvent value of all accounts divided by the total collateral value of all accounts.\nAsset net insolvent value percentage: This is the sum of net insolvent value divided by the total collateral value pro-rata supply percentage for all accounts that supply a given asset as collateral. Because of the many-to-many nature of collateral and borrowed assets on the Aave protocol, attributing insolvency statistics to specific assets can be convoluted.\nSlashing run percentage: This is the percentage of simulation runs that end with greater than 1% of the total value (in Aave) of the safety module slashed to cover insolvencies and with greater than 10% drop in total value (in USD) of the safety module.\n\nResults\nOur baseline results for almost 6000 simulation runs showed that the protocol is resilient based on our metrics (<1% net insolvent value percentage of the entire protocol and <5% net insolvent value percentage of every asset). The graphs below show the percentage of users who will have any insolvency and the net insolvent value percentage of each asset in our initial simulation runs.\n\n1008×1008\n\n1008×1008\n\nThe initial simulation runs also serve to identify which assets’ parameters could have the largest impact on the health of the protocol. We chose YFI to study the impacts of various borrow parameters and liquidation parameters. Below is a graph of YFI asset net insolvent value percentage as a function of correlated asset volatility and loan-to-value ratio. Note that the insolvent value percentage is monotonic in both loan-to-value and volatility scalar, as one intuitively expects.\n\n1590×1375\n\nNext is a graph of YFI asset net insolvent value percentage as a function of correlated asset volatility and liquidation threshold. Note that the choice of liquidation threshold is only important at high enough volatilities: at low volatilities, changes to the threshold do little to change net insolvent value.\n\n1594×1379\n\nThis is a graph of YFI asset net insolvent value percentage as a function of correlated asset volatility and liquidation bonus. Note that this measures the likelihood of correlated cascades (e.g. the y-axis is the volatility of an asset highly correlated to YFI with different liquidity levels). This figure illustrates that correlated assets admit a `safe region’ in terms of liquidation bonus where net insolvent value stays relatively low. Unlike the previous figure, we see that there is a much stronger dependence on liquidation threshold even at lower volatility scalars.\n\n1555×1379\n\nThis is the total collateralization of the Aave protocol as a function of correlated asset volatility and liquidation bonus. Note that the total collateralization ratio of the system is inversely related to the net insolvency value at high volatility levels when the liquidation bonus is above 115%.\n\n1600×1304\n\nFinally, this is the percentage of simulation runs that ended with significant slashing (>1% Safety Module sold and >10% decrease in USD value). Note that we only observe significant slashing at high liquidation bonus and volatilities and that there is a `safe region’ of moderately sized liquidation bonuses.\n\n1599×1386\n\nIn section 6.3.1 of the formal report, we give a more mathematical explanation for why the liquidation bonus has this relationship with protocol safety.\nConclusions\nIn this report we conducted a market-risk assessment of the Aave protocol via agent-based simulations run against the Aave contracts.\nWe stress-tested the liquidation mechanism under a wide range of market volatility and sizing scenarios to ensure that the protocol can prevent borrowers from becoming under-collateralized in most of these cases.\nWe also used historical market data from centralized and decentralized cryptocurrency exchanges to ensure that assumptions about volatility and slippage are representative of real-world conditions.\nWe found that the protocol can withstand aggressive borrowing parameters even in extreme asset volatility and network congestion situations. However, variations in the liquidation bonuses of the protocol lead to more drastic and unexpected results, and liquidation bonus should not be the primary tool used to adjust protocol-wide market risk.\nWe also studied the relationship between borrower behavior as a result of borrowing parameter adjustments to understand the returns of both AAVE holders and lenders on the Aave protocol as a result of parameter changes. As market conditions change,\nthe optimal parameters and suggestions will need to dynamically shift as well.\nOur results suggest that monitoring and adjustment of protocol parameters is crucial for reducing risk to lenders and slashing in the safety module.\nThe community can expect us to be more active going forward with parameter suggestions and liquidation analysis in the near future!", "reads": 78, "readers_count": 77, "score": 3245.4, "word_count": 2851, "category_id": 7}, {"url": "https://governance.aave.com//t/shared-market-exposure", "topic_id": 2322, "title": "Shared market exposure", "posts_count": 4, "views": 1788, "like_count": 4, "author_username": "A5burger", "created": "2021-02-04T16:52:17.187Z", "text": "Disclosure; not technical, just a logic minded retard.\nFirst Id like to thank the team on behalf of the community for all the hard work over the years, and congratulate everyone on the success, below are some points I felt needed to be brought to attention, perhaps some are wrong but I did my best to read as much as I could before summarizing my thoughts as best I understand them. This is not a proposal, Im just hoping to open a discussion.\nFinancial risks; I understand the thought process to diversify risks into seperate daos with seperate backstops however if theirs s shared market between them (usdt, Dai, etc) then we are at risk of any of these crashing and blowing through all layers of backstop. I liken this to the insurance industry, local providers (home auto etc) purchase insurance from a national provider, they diversify their risk across a nation (assuming natural disaster only hits one location) National Insurance providers buy Global insurance to further diversify (risk is spread further incase natural disaster effects entire country) great system until their is an international pandemic. (note; a backstop for this was presented 3 years ago as an investment insurance policy to Pension Funds as they are the only industry who fades international pandemics)\nUnderexposure/UI\nSeparate market tabs and poor UI make navigation difficult, the website prompts a wallet connection while browsing tabs this is excruciatingly painful while browsing or showing the platform to new users.\nuniswap is already missing a button from the v1 market page. adding more markets will exacerbate this issue. Essentially burying new markets from eyes of the market. Shouldnt we be highlighting this?\nOne market to rule them all\nCan we tranche this model on a smaller scale? Can new coins be individually backstopped by whomever proposes the market until a milestone health metric is reached where the backstop gets returned to original investor and the market gets added to the main pool. We can attach some metric for utility strength (dom, mc, investor sentiment) I dont see the diversity in pooling a handful of high risk coins into one market. If anything this increases risk, the same with diluting high risk markets with stablecoins etc. who knows how long tether will be stable.\nNew coins backstopping themselves would operate similar to an ico in which the MM will fund or crowdsource the backstop the the new market they wish to create. Doing this they can even present a 0% borrow apy to give users a chance to try a new coin without investing too much. this would still benefit aave as they would still need to deposit collatteral in the main market to take the loan from the new market. I dont think there even needs to be incentive in the mm for this as their incentive is in the growth of the market of the currency they wish to promote. As our metric rises based on TBD factors the backstop % can slowly decrease over a period of time. This would allow Highlighting on the main page new coins with much more exposure.\nim probably missing stuff, i scribbled this in bullet points last night. if im wrong just say so ill go back to my corner.", "reads": 41, "readers_count": 40, "score": 63.2, "word_count": 682, "category_id": 7}, {"url": "https://governance.aave.com//t/gauntlet-market-risk-primer", "topic_id": 2097, "title": "Gauntlet Market Risk Primer", "posts_count": 5, "views": 5229, "like_count": 17, "author_username": "wfu", "created": "2021-01-15T22:15:54.986Z", "text": "Background\nAt Gauntlet, we use agent-based simulations to evaluate the economic security of blockchain protocols. We have worked with the Aave team in parameter optimization for V2, which includes loan-to-value ratio (LTV), liquidation threshold, and liquidation incentive values for various assets. The main purpose of this post is to provide some color into the work we have been doing with the Aave team, as well as motivate the framework for high-level analysis that we will continue to perform. We purposely exclude the rigorous definitions and methodology for our simulations in this post, but that will be available in a formal report to be released shortly. With that said, we hope to illuminate and spark discussion about overall market and systemic risk within the Aave protocol.\nAgent-Based Simulation\nThe main tool used for assessing market and system risk in Aave is agent-based simulation. Such simulations can accurately assess how well liquidations are handled under stressful scenarios, such as Black Thursday. Our simulation platform allows data scientists to directly stress test agent models (models of user behavior) against the real EVM bytecode that is used on mainnet. By stress testing against actual contract code, we reduce the surface area for false negative safety results.\nTo construct models of borrower, supplier, and liquidator behavior, we first analyze on-chain and market data. Using these models, we run Monte Carlo simulations of different users competing and interacting with the protocol to assess safety. Our methodology for stress testing DeFi protocols was established in our analyses of Compound and THORChain. For our analysis of Aave, we significantly improved the models used for analyzing borrower behavior in Compound. These model improvements allow us to handle cross-margining and better reflect multi-collateral borrowing behavior. This allows us to stress test the protocol’s safety under liquidity duress and more accurately handle the wide variety of assets utilized within Aave.\nKey Simulation Inputs\nOur simulations focus on stress-testing the protocol under extreme market conditions, including high volatility, low liquidity, and high gas congestion. The main levers available to the protocol to mitigate risk during these conditions are loan-to-value (LTV) ratio, liquidation threshold, and liquidation incentive. We also utilize these variables to help define and guide agent logic within the system. Our simulations allow for the isolation of specific changes to each of these values per asset.\nLTV\nThis variable helps to define our borrower and lender logic. As we change LTV per asset, it changes the amount that can be borrowed against a particular collateral. For each asset, we also define how borrower behavior will change based on LTV changes.\nLiquidation Threshold\nThe difference between the LTV and liquidation threshold of a particular asset is the minimum buffer for an adverse price movement that a loan can withstand. Changing liquidation threshold alters the amount of time that borrowers have to resupply collateral to maintain healthy loans.\nLiquidation Incentive\nThis variable helps to define our liquidator agent logic. The main consideration for liquidators is balancing the slippage, trading fees, and transaction fees against the liquidation incentive. This provides the framework for defining optimal liquidator behavior.\nAsset Volatility and Correlation\nHistorical data about price movements defines the price trajectories used in our simulations, but it also impacts how our liquidators behave. Changing liquidator behavior in times of high volatility and low liquidity can give insight to systemic risk. Another key aspect of our simulations is understanding asset correlation and its effects on protocol health. This is the correlation matrix of the assets on the Aave protocol over the from December 2020 to January 2021:\n\nimage817×773 78 KB\n\nIn our simulations, we are using correlated multi-asset geometric Brownian motion models for each of the asset price trajectories.\nNetwork Congestion\nAnother key aspect of understanding how Aave will perform under high stress situations is network congestion. We add gas price and transaction delay implications by building gas distribution curves on three month trailing data, and use random samples in our liquidator logic. In addition, we fit expected transaction delay times to liquidation calls.\nUser Behavior\nThere are idiosyncratic risks for each asset that might be missed through general market statistics including volatility and liquidity. In addition to considering these general risks, we monitor borrow and lend behavior on a per asset level. Specifically, one metric is borrow usage rate per asset which can be defined as:\n\nwhere U is the utilization ratio of each user:\n\nThis particular metric provides information about how aggressively suppliers of a specific asset borrow against their supply. At the time of this post, the total size of the V2 protocol is still less than 20% of V1, so we are currently utilizing V1 user behavior for our simulations, but this should change over time:\n\n870×485\n\nKey Simulation Outputs\nThe following metrics are a few ways that we monitor overall protocol health and safety throughout our simulations. These metrics guide how we make suggestions for the previously stated key protocol variables.\nInsolvency\nThe main output used to determine overall protocol market risk is account insolvencies. Whenever an account holds more debt, or borrowed assets, than collateral, or supplied assets, the account can be considered to be insolvent. On the protocol level, we monitor the gross and net insolvent value of all assets. Because many users of Aave hold multi-asset debt as well as multi-asset collateral, we also look at the gross and net insolvent value per asset by using pro rata attributions of the insolvent debt.\nLiquidation Values\nOne main mechanic that the Aave protocol utilizes to maintain the overall health of the protocol is liquidations. The total liquidated value and total liquidatable debt are valuable metrics. However, another important output is “adverse liquidations”. As explained in the OpenZeppelin audit of Aave [H08] Counterproductive incentives, there exist regimes where liquidations do not improve the overall health of a specific loan, but rather push it towards insolvency. During simulation runs, we track the changes to the volume and frequency of adverse liquidations, as well as the clustering of liquidations in terms of size. Increases in adverse liquidations places more onus on users to resupply collateral. Although insolvency statistics may not increase throughout some simulations, these metrics shed light into some hidden systemic risks.\nResults\nAs previously mentioned, we have been working with the Aave team on working with parameter suggestions that can balance protocol safety and capital efficiency. In particular, two of the major suggestions that we made were decreasing risk limits on YFI and increasing risk limits on WBTC. In this particular set of simulation results, we do a sweep of LTV and liquidation threshold changes for YFI against various volatilities. For each of the parameter and volatility settings, we run 15 simulations with differing realized price trajectories and gas prices. In these simulations, we also shifted borrower behavior based on LTV and liquidation threshold changes. Below are plots of the total collateralization of the protocol, the net insolvent value of the protocol, and the net insolvent value of just YFI for the varying initial conditions for on-chain borrower data and market data from November 2020:\n\nimage828×702 25.9 KB\n\n\nimage818×703 22.7 KB\n\n\nimage825×710 24.7 KB\n\nThe volatility scalar is a multiplier applied to each of the asset volatilities used to generate correlated price trajectories. The risky asset borrow scalar is a multiplier that directly changes the reserve configurations for a particular asset (in this case YFI), as well as directly changing borrower behavior. The overall health of the protocol is maintained even when we increase the annualized volatility an order of magnitude larger than the trailing one month data at the time, which can be seen in the net insolvency value of around 1%. However, when analyzing just accounts holding YFI, there was substantial insolvency risk at extremely high volatility settings. This guided suggestions in lowering the liquidation threshold for YFI in Aave V2. In addition, note the transitions of the total collateralization of the entire protocol at the end of each set of simulation. As the borrow scalar increases, it follows that total collateralization should decrease at the beginning of each simulation. As volatility increases, there is a non-linear relationship with total collateralization. This is a result of the dependence of our liquidator logic on choice of collateral and liquidation value on market conditions. More specifically, there were particular LINK positions that were liquidatable more quickly in high volatility settings. When those liquidations happen more quickly, the removal of these risky positions leads to a higher collateralization value at the end of certain simulations, but as volatility continues to increase, the calculated slippage and market impact in our liquidator logic results in decisions to not liquidate these positions.\nA similar set of simulations were run across WBTC LTV and liquidation threshold values. Total collateralization and net insolvency values were similar, but the WBTC net insolvency values were lower and more importantly, the impact of increasing LTV and liquidation threshold on insolvency was low:\n\nimage816×704 22.9 KB\n\nUpdate\nParameter optimization is an on-going process. An important consideration for our liquidator logic is asset volatility and liquidity, and our simulations are run using the most recent market data. Given the increase in trading volume of YFI and lower market impact of large trades, the insolvency metric for YFI has decreased substantially in January 2021:\n\nimage831×708 23.1 KB\n\nNext Steps\nThe report analyzing the protocol will be published in the near future and will formalize our findings in the context of protocol market risks and safety. As more data is available for V2, we will continue to fine-tune our simulations to changes in user behavior in the new protocol. In the future, we hope that our simulations can guide parameter changes to the Aave protocol by providing valuable insights into economic risks. Thanks for taking time to read and please feel free to leave feedback.\nReport covering V1 and V2 can be found here: Gauntlet", "reads": 119, "readers_count": 118, "score": 5143.8, "word_count": 1796, "category_id": 7}, {"url": "https://governance.aave.com//t/base-stable-rate-oracle-update-and-improvements-in-aave-v2", "topic_id": 1879, "title": "Base stable rate oracle update and improvements in Aave V2", "posts_count": 3, "views": 3092, "like_count": 13, "author_username": "Emilio", "created": "2020-12-29T11:09:21.113Z", "text": "The Aave V2 protocol implements a more aggressive IR for stable and variable rates compared to V1. Specifically, the risk parameters have been set as follows:\nUSDC — USDT\nimmagine1486×918 45.4 KB\nDAI — TUSD\nimmagine1486×918 45.4 KB\nBorrowers are taking this opportunity to borrow at a lower risk leading to a high share of stable borrows in V2. This is problematic as the stable rate only rebalances under stressed conditions, losing some of the risk management benefits of the variable rate.\nThe share of stable rates in V2 has significantly increased for all stablecoins:\n\nDAI from 18.57% to 65.3%\nUSDC from 29.13% to 69.65%\nUSDT 45.73% to 77.2%\n\nThe reason for that is that compared to the market conditions when V2 launched, many new stablecoin farms appeared, which dramatically increased the demand for stablecoins. The current implementation of the Lending rate oracle cannot keep up with the ever changing market conditions.\nThis shows to be unhealthy in the long term: too aggressive stable rates fail to attract new liquidity, which dampens the protocol growth and imposes more UX overhead (more difficulty to withdraw liquidity as there is high utilization).\nThe genesis team proposes two solutions:\n\n\nthe short term fix is to manually override the lending rate oracle (which is still under the control of the Aave genesis team) and impose a base stable rate of 7% (against the current 4%). A base that is almost twice as high will at the same time disincentivize stable borrowing for the short medium/term, or provide higher APY for LPs if the borrowers still choose to borrow at stable.\n\n\nThe long term fix is to get rid of the Lending rate oracle completely by algorithmically set the spread between the stable rate and variable rate. This can be achieved by calculating the ratio\n\n\n\nWhere Ds is the total debt stable and Dv is the total debt variable. When R > 1, it means more of the reserve is being borrowed at stable, which increases the spread between stable and variable for new loans. When R < 1, the spread can be lower, to incentivize stable rate borrowing. The equation for the spread can be adjusted to target whatever value of R.\nThis removes the need for the lending rate oracle altogether, which also reduces the centralization risk and decreases gas costs.", "reads": 66, "readers_count": 65, "score": 1453.2, "word_count": 615, "category_id": 7}, {"url": "https://governance.aave.com//t/help-with-aave-lend-conversion-problem", "topic_id": 2185, "title": "Help with aave (Lend) conversion problem", "posts_count": 1, "views": 1584, "like_count": 0, "author_username": "Logan", "created": "2021-01-23T14:19:05.947Z", "text": "Does anyone know who to contact at aave to see what happened to my conversion of aave (Lend) to aave?\nOn 1/19/21 I sent 50 aave (Lend) to aaves smart contract and they were converted to aave and sent to my Atomic wallet.\nHash\n0xc243f02a1a5b1e29bf7b80a7be6c47a54787fda06ae5e7ac408e495b85eb58f9\nSo I sent the remaining 409.488 to the same address and it has over 24000 confirmations but I still have not received them in my wallet!\nHash\n0x2248bc29b0fd885cb5b8fdcb5708e8376cb540e7f93d3f832c91c291fd53f9b0\nAny help would be appreciated.\nThanks", "reads": 26, "readers_count": 25, "score": 15.2, "word_count": 322, "category_id": 7}, {"url": "https://governance.aave.com//t/cost-to-transact", "topic_id": 2209, "title": "Cost to transact", "posts_count": 4, "views": 1731, "like_count": 5, "author_username": "UndeadBeat", "created": "2021-01-25T16:13:12.736Z", "text": "Hi all,\nI’ve staked some coins and noticed that the cost to have transactions with the smart contract are fairly expensive.\nIs this a product of the ERC20 design and there’s nothing to be done?\nOr is there a potential growth area to reduce to cost to interact?", "reads": 37, "readers_count": 36, "score": 97.4, "word_count": 458, "category_id": 7}, {"url": "https://governance.aave.com//t/request-for-brainstorm-thoughts-on-money-market-powered-governance-attack", "topic_id": 911, "title": "Request for Brainstorm : Thoughts on Money Market powered Governance Attack", "posts_count": 22, "views": 5228, "like_count": 41, "author_username": "Jordan", "created": "2020-10-15T18:28:22.227Z", "text": "Governance attack\nOne of the premises of decentralized governance is that token holders will act in good faith as they are holding assets and thus are exposed to the consequences of the decisions and votes they make.\nThis is for example the rationale behind the Maker Emergency Shutdown module, which requires to burn a consequent amount of MKR in order to shutdown the maker protocol. As of today the amount of MKR in Aave isn’t enough to trigger the emergency shutdown but the last thing we should want for the protocol is that the growing interest from the Maker community in using Aave puts the Maker Protocol and DAI, an essential building block of our ecosystem, at risk.\nBeyond Maker, it’s all the decentralized governance ecosystem which can fall victim to such an attack. The closest exemple to such a governance attack is what happened with the Steem blockchain with centralized exchanges getting involved. Not your tokens, not your protocol.\nThis was an influence based attack, but a whale backed attack in DeFi would look like someone using ETH as collateral to borrow YFI, MKR, UNI or Aave in order to propose and pass a malicious proposal. This is a threat that makes governance aware and risk averse stakeholders reluctant to use protocols such as Aave since, as they use their token as collateral, someone else can borrow those tokens for governance attack.\nVoting with aTokens\naTokens are the representations of your deposits in the Aave protocol.\nTo prepare the ongoing token migration, LEND borrowing was blocked which also enabled the use of aLEND as a voting asset, since double voting was not possible as the underlying LEND could not be borrowed.\nThis was a success and open now the possibility for other protocols to support aTokens votings.\nIf the underlying token can’t be borrowed, then risk averse stakeholders could vote in their respective governance using aTokens if the protocol supports it (As they should!)\naUNI, aMKR, aAave and aYFI could be used for both governance in their respective protocol and leverage in Aave.\nRegarding the Aave governance, it seems clear that it can’t allow voting with aAave if Aave can be borrowed as it opens to a “leverage governance attack” : e.g. a holder of 100 AAVE could deposit it into the protocol, getting 100 AAVE. Somebody else (or himself, but lower amount) could then borrow the 100 AAVE. At this point, from 100 AAVE, 200 “units of voting power” have been created. Even considering from the governance that the supply to measure voting power from should be 200 (AAVE+aAAVE), in practice, a person doing this kind of leverage by himself will just “boost” his voting power compared with plain AAVE holders not leveraging.\nEnabling aToken support also solves the difficult of calculating the proper combined supply and with it percentage over it: e.g. in a potential scenario where to submit a proposal to the Aave governance is needed a percentage of combined AAVE+aAAVE+stkAAVE supply, the fair calculation of this percentage is more complex than just using the AAVE supply (as non-deposited AAVE supply + aAAVE supply = AAVE supply).\nFor the previous reasons, there are two points of discussion/solutions proposed for this thread, with complete openness for others appearing:\n\n\nNot enabling AAVE and UNI as borrowing assets on the Aave protocol and disabling MKR and YFI, while pushing for those protocols to support aUNI, aYFI and aMKR voting.\n\n\nSetting a global borrowing limit on those assets in the Aave protocol, considering the governance voting thresholds, and taking this limit into account on the calculation of voting power.\n\n\nThis thread is inspired and consequential to the discussion/polling with positive outcome here Aave Protocol Token Addition - Community Sentiment Poll , and Proposal to add AAVE as collateral only.\nWhat are your thoughts on the matter and which road do you think is the best for the growth of the aave protocol and the safety of DeFi governance as a whole ?", "reads": 104, "readers_count": 103, "score": 1195.8, "word_count": 4102, "category_id": 7}, {"url": "https://governance.aave.com//t/cream-finance-help", "topic_id": 776, "title": "Cream.Finance help!", "posts_count": 3, "views": 2245, "like_count": 2, "author_username": "RickiiHard", "created": "2020-10-09T00:59:10.998Z", "text": "Hey guys, long term holder since Ethlend… I have simply gone to sleep and woken up to Cream finance “pausing” their Lend market on their platform, and im stuck with 8600 lend in there with no liquidity left? They say they have confirmed with us there is no decided migration end date yet, but the protocol shouldn’t leave funds not paid, and regardless obviously I voted for this migration. But not at the expense of falling asleep and losing most of my life savings… can they migrate the LEND pool straight to AAVE? please help… ???", "reads": 56, "readers_count": 55, "score": 111.2, "word_count": 277, "category_id": 7}]